{"title":"The Bank A Matter of Life and Debt s01e02 ENG SUBS WEBRIP","uid":12079690,"size":666035821,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:00b112f0e6416a3094f8fe2fdb43285dd25e6ad0&amp;dn=The+Bank+A+Matter+of+Life+and+Debt+s01e02+ENG+SUBS+WEBRIP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"makinapufterpup","files":4,"time":1435720003,"description":"The.Bank.A.Matter.of.Life.and.Debt.s01e02.Love.and.Money.ENG.SUBS.WEBRIP\n\nFormat: MPEG-4\nSize: 832x468\nDisplayAspectRatio: 16:9\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\nDocumentary series following staff and customers at a Huddersfield branch of NatWest. Money can provoke strong feelings in relationships.\n\nThe second episode of this series, with unique access to the staff and customers of a high street bank, is about love and money.\n\nAll of life passes through NatWest bank in Huddersfield. The staff there see customers at every milestone of adult life. Young love, settling down, parenthood, divorce, old age, illness and death. That's not to mention the staff, who between them have clocked up one engagement, three mortgages and three divorces, just in the last year.\n\nWhile bank staff open up about their relationships, their divorces and about who calls the shots with money in their house, they also meet customers who juggle money and their hearts. Money can provoke strong feelings in relationships.\n\nVictoria and Matthew have just moved in together and opened a joint account to test out their relationship, while Helen is trying to unpick the financial mess of her divorce. Melanie's husband has clocked her obsessive bargain hunting habit, while Kevin is looking after his father's pension money so the 79-year-old can go looking for love in Africa. Andy's homeless and so can't close the joint account he shared with his ex. Deputy bank manager Claire is still living at home with her parents, until she and her boyfriend can afford to get on the property ladder.\n\n[img]https://yuq.me/users/44/769/43MIFJxPBq.png[/img]\n\n[img]https://yuq.me/users/44/769/nFkiGoT6ry.jpg[/img]","torrent":{"xt":"urn:btih:00b112f0e6416a3094f8fe2fdb43285dd25e6ad0","amp;dn":"The+Bank+A+Matter+of+Life+and+Debt+s01e02+ENG+SUBS+WEBRIP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00b112f0e6416a3094f8fe2fdb43285dd25e6ad0","infoHashBuffer":{"type":"Buffer","data":[0,177,18,240,230,65,106,48,148,248,254,47,219,67,40,93,210,94,106,208]},"announce":[],"urlList":[]}}