{"title":"Mad About Men (1954) DVD5 - Glynis Johns, Donald Sinden, Anne Cr","uid":10712140,"size":3967109120,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:044348a0edc8912b4ce17a6b44b84515625aecf2&amp;dn=Mad+About+Men+%281954%29+DVD5+-+Glynis+Johns%2C+Donald+Sinden%2C+Anne+Cr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"SaM","files":-1,"time":1407373218,"description":"Mad About Men (1954) DVD5 - Glynis Johns, Donald Sinden, Anne Crawford [DDR]\n\nMad About Men is a British comedy film, made in 1954 in Technicolor. It was directed by Ralph Thomas and written by Peter Blackmore, who also wrote the 1948 film Miranda which preceded Mad About Men. Glynis Johns appears in both films as the mermaid Miranda.\n\n    CAST:-\n    Glynis Johns as Caroline Trewella / Miranda Trewella\n    Donald Sinden as Jeff Saunders\n    Anne Crawford as Barbara Davenport\n    Margaret Rutherford as Nurse Carey\n    Dora Bryan as Berengaria, a somewhat dimwitted mermaid friend of Miranda\n    Nicholas Phipps as Colonel Barclay Sutton\n    Peter Martyn as Ronald Baker\n    Noell Purcell as Percy, a fisherman friend of Jeff\n    Joan Hickson as Mrs Forster\n    Judith Furse as Viola\n    Irene Handl as Mme. Blanche\n    David Hurst as Signor Mantalini, a musician who plays at the concert\n    Martin Miller as Dr. Fergus, a noted biologist summoned by Barbara to the concert\n    Deryck Guyler as Editor\n    Anthony Oliver as Pawnbroker, who buys some Spanish doubloons from Miranda\n\nDirected by Ralph Thomas\nProduced by Betty E. Box, Earl St. John (executive)\nMusic by Benjamin Frankel\nRunning time 89 min\n\nWhen gymnastics school teacher Caroline (Glynis Johns) goes on holiday at her family's home in Cornwall, she meets her distant mermaid relative Miranda, who looks exactly like her. She agrees to let Miranda trade places with her, while she goes on a bicycling trip with a friend. Caroline feigns an accident which leaves her confined to a wheelchair for a few weeks and gets nurse Carey to attend to Miranda. This conceals the fact that Miranda has a fish tail instead of legs.\n\nCaroline is engaged to Ronald Baker (Peter Martyn), but when he shows up, Miranda does not like him at all. She decides to make Caroline a better match. She flirts outrageously with two eligible bachelors, Jeff Saunders (Donald Sinden) and Colonel Barclay Sutton (Nicholas Phipps), right in front of Ronald. When she discovers that Ronald works in the government sanitation department (and approves of dumping garbage into the ocean), she dumps a tureen of cold soup on his head.\n\nMeanwhile, Barbara Davenport (Anne Crawford), the colonel's fiance, takes an understandable dislike to Miranda. While out swimming, she discovers Miranda's secret and arranges for &quot;Caroline&quot; to sing at a charity concert, plotting to reveal her true nature. Caroline reads about the forthcoming concert during her holiday, guesses what Barbara intends, and rushes back to take Miranda's place, foiling Barbara's scheme.\n\nAfterward, Jeff takes Caroline boating. When he tries to kiss her, she resists at first, then willingly gives in, while a somewhat sad Miranda watches.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4514 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec:  AC3\nAudio Bitrate: 448kb/s CBR 48000 Hz\nAudio Streams: 6\nAudio Languages: English\nRunTime: 89 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]   \nDuration: 89 mins","torrent":{"xt":"urn:btih:044348a0edc8912b4ce17a6b44b84515625aecf2","amp;dn":"Mad+About+Men+%281954%29+DVD5+-+Glynis+Johns%2C+Donald+Sinden%2C+Anne+Cr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"044348a0edc8912b4ce17a6b44b84515625aecf2","infoHashBuffer":{"type":"Buffer","data":[4,67,72,160,237,200,145,43,76,225,122,107,68,184,69,21,98,90,236,242]},"announce":[],"urlList":[]}}