{"title":"POtHS - The Word - 047 - Why the Cross by Shieldoftheson","uid":11844253,"size":11272781243,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1270707b18fd1921e31276b23e251a869d4d536f&amp;dn=POtHS+-+The+Word+-+047+-+Why+the+Cross+by+Shieldoftheson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"greghar","files":120,"time":1429894087,"description":"POtHS\nPouring Out the Holy Spirit\n\n\nThis contains various video sermons by Shieldoftheson, a devout Christian that walks us through many topics of the faith and problems which arise among the brethren.\n\nWhy The Cross?\nWhy did Jesus Christ use a cross to die for mankind?  What is its symbology and what do the various books of the Bible say on the matter?\n\nEndures Forever:\nStanding in faith in a lost world.  How does the blood of Christ transform us into a lamb without blemish?  How do we overcome the obstacles along our path?  How do we recognize those false teachings of our forefathers that hinder our relationship with God?  And worse, cause us to be given over to the Heathen?\n\nIdol Christians:\nThe truth about spirituality in Church families.  Please be forewarned, this is very disturbing news.  For those with ears, let them hear!\n\nWaiting on the Lord:\nShieldoftheson presents the lessons of Psalm 62 and how in reflects the Christian struggles of our daily lives.\n\nWoe to the Pharisees:\nThe problems of modern churches that we encounter today.\n\nCry of the Father:\nThe more complicated lessons of Jesus Christ that many people have difficulty in understanding.\n\nForgiveness:\nThe wisdom of letting go of misery.\n\nInner Battles:\nThe truth about wickedness in the world and the struggles for Christians.\n\nWalking By Faith:\nThe concept of wlak by faith in a world that is filled with wants and needs.  What does it mean to walk in a world as children of Jesus Christ?\n\nWhat is a Christian?\nMany people today call themselves a Christian, but do they actually walk in the faith?  How do we diagnose the problems among the brethren and distinguish who are legitimate brehren and those who simply latch onto the name of Christ?\n\nFalse Christians:\nSpotting false coven friends.\n\nAlso included...\nSigns - Part 68:\nA folder series compiled of various short clips presenting recent apocalyptic signs occurring around the world today to help us identify the state of affairs ushering the end","torrent":{"xt":"urn:btih:1270707b18fd1921e31276b23e251a869d4d536f","amp;dn":"POtHS+-+The+Word+-+047+-+Why+the+Cross+by+Shieldoftheson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1270707b18fd1921e31276b23e251a869d4d536f","infoHashBuffer":{"type":"Buffer","data":[18,112,112,123,24,253,25,33,227,18,118,178,62,37,26,134,157,77,83,111]},"announce":[],"urlList":[]}}