{"title":"JULinux10_x86_32bit_RC2","uid":10810805,"size":1329669952,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:128c35ac410c4165a7b48c778991ee5ba92f00b6&amp;dn=JULinux10_x86_32bit_RC2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"JULinux","files":4,"time":1408427143,"description":"FinishInstall.sh 5.6 kB (5,553 bytes)\nJULinux10x86_RC2.iso 1.3 GB (1,329,594,368 bytes)\nJULinux10x86_RC2.iso.md5 55 bytes\nReadme.txt 70.0 kB (69,976 bytes)\n\n\nPlease check out: https://www.indiegogo.com/projects/julinux-11-project-just-use-linux/x/3372462#activity\n\nWELCOME TO JULINUX 10 x86 (32 bit) Revision 1 !\n\nThis readme will go over getting support, what the full version installer contains, \nand what you can expect. You can see a short video with full instructions and an\nOverview here:\n\nWhat is JULinux, and who is it for ?\nJULinux or Just Use Linux, is a distribution currently based off of Xubuntu 14.04 LTS\nWith a user friendly interface, that makes users feel right at home, coming from\nWindows XP, 7, 2000, Vista, and 8.1. JULinux has the capability to run Windows Software\nas well as tons of superior Open Source software as well. By default JULinux 10 comes\npackaged in a 1.4 GB .iso file that you can burn to a DVD, or install to a USB thumbdrive.\nOnce installed, the user can run the Upgrade icon on the desktop to get even more. \nJULinux is one of the few modern distributions, to include OpenOffice !\nOpenOffice is the most compatible, and capable Office Suite that we are aware of, and it\ncomes by popular request.\n\nThe full Upgrade option, allows the user to install Netflix for Linux, and many other\nuseful applications.\n\nJULinux has been featured on several websites, and news articles.\n\nGetting support is easy, all you need to do is open the Seamonkey Browser,  and \nthe links for help and support will be in the bookmarks. We have forum &lt;a href=&quot;\nhttp://sourceforge.net/p/ultumix/discussion/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sourceforge.net/p/ultumix/discussion/&lt;/a&gt;\nas well as commercial support options. We also have an FAQ page.\n\nThe following packages will be installed by the FinishInstall script,\ncalled the &quot;Upgrade To Full Version of JULinux&quot; icon on the Desktop.\nSome packages are optional, and you will be asked before installing them.\n\nvlc playonlinux p7zip-full p7zip-rar rar xubuntu-restricted-extras xubuntu-restricted-addons openshot blender flashplugin-installer winetricks audacity soundconverter k3b devede acidrip netflix-desktop warzone2100 supertux supertuxkart urbanterror teeworlds frozen-bubble 0ad 3dchess airstrike alienblaster amphetamine antigravitaattori armagetronad asciijump asylum atomix balder2d barrage berusky billard-gl biniax2 black-box blobandconquer blobby blockout2 brainparty btanks bygfoot einstein extremetuxracer five-or-more flare foobillardplus four-in-a-row freedroid frozen-bubble funnyboat gnome-chess gnome-hearts gnome-klotski gnome-mahjongg gnome-mastermind gnome-mines gnome-nibbles gnome-robots gnome-tetravex gnubik gnuchess gnugo gtkatlantic gtkpool gunroar holdingnuts lbreakout2 lightsoff liquidwar ltris megaglest minetest mokomaze monopd monsterz moon-buggy moon-lander netmaze netpanzer neverball neverputt openarena pacman performous pingus quadrapassel scorched3d slimevolley smc snake4 snowballz supertux supertuxkart swell-foop tali teeworlds tennix tetzle tomatoes transcend warzone2100 wesnoth widelands xblast xmoto zaz\n\nBen Fitzpatrick is a top level contributor\nHe helped, and provided a computer to develop and compile on\n\nTo determine what kind of video card, or other hardware you have, do the following:\nClick the Start Menu Button at the lower left of the screen\nClick Accessories &gt; then click Terminal Emulator.\nType lspci and press the enter key. I am running a VirtualBox VM so my output looks\nlike this: \n\njulinux10@julinux10-VirtualBox01:~$ lspci\n00:00.0 Host bridge: Intel Corporation 440FX - 82441FX PMC [Natoma] (rev 02)\n00:01.0 ISA bridge: Intel Corporation 82371SB PIIX3 ISA [Natoma/Triton II]\n00:01.1 IDE interface: Intel Corporation 82371AB/EB/MB PIIX4 IDE (rev 01)\n00:02.0 VGA compatible controller: InnoTek Systemberatung GmbH VirtualBox Graphics Adapter\n00:03.0 Ethernet controller: Intel Corporation 82540EM Gigabit Ethernet Controller (rev 02)\n00:04.0 System peripheral: InnoTek Systemberatung GmbH VirtualBox Guest Service\n00:05.0 Multimedia audio controller: Intel Corporation 82801AA AC'97 Audio Controller (rev 01)\n00:06.0 USB controller: Apple Inc. KeyLargo/Intrepid USB\n00:07.0 Bridge: Intel Corporation 82371AB/EB/MB PIIX4 ACPI (rev 08)\n00:0b.0 USB controller: Intel Corporation 82801FB/FBM/FR/FW/FRW (ICH6 Family) USB2 EHCI Controller\n00:0d.0 SATA controller: Intel Corporation 82801HM/HEM (ICH8M/ICH8M-E) SATA Controller [AHCI mode] (rev 02)\njulinux10@julinux10-VirtualBox01:~$ \n\nThe VGA listed is &quot;InnoTek Systemberatung GmbH VirtualBox Graphics Adapter&quot; and I am using the\ncorrect driver: &quot;x86 virtulization solution - guest addition module source for dkms from virtualbox guest dkms (proprietary)&quot;\n\nYou can also see the other hardware as well. To list usb devices type lsusb and press enter instead of lspci.\n\nPS installing video drivers can be easy. First try the easy way: (Installing Video Drivers Should Be Done\nRight after Install, because if done incorrectly, you may need to re-install JULinux)\nClick the Start Menu Button at the lower left of the scr","torrent":{"xt":"urn:btih:128c35ac410c4165a7b48c778991ee5ba92f00b6","amp;dn":"JULinux10_x86_32bit_RC2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"128c35ac410c4165a7b48c778991ee5ba92f00b6","infoHashBuffer":{"type":"Buffer","data":[18,140,53,172,65,12,65,101,167,180,140,119,137,145,238,91,169,47,0,182]},"announce":[],"urlList":[]}}