{"title":"[PS3] Clash of the Titans","uid":10824627,"size":6606744280,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:12f44fa1993cdad1f4d58610eebf89949805337d&amp;dn=%5BPS3%5D+Clash+of+the+Titans&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fuckface69","files":-1,"time":1408570837,"description":"Featuring a thematic setting based on Greek Mythology and a story entwining the &quot;War of Hades&quot; the game delivers an intense world of Dark Fantasy. Gameplay standout features the ability to acquire and use enemy weapon to advance and defeat opponents, as well as challenging boss battles and faithful reproduction of scenes out of the movie.\n\nFierce mythological beasts have been unleashed upon the land. Caught in a war between gods, you must combat mythological creatures and trek through treacherous territories to save Earth from Hades' malevolent rule. Do you have what it takes to step up to the epic battle before you and defeat the keeper of the underworld? It's up to you to conquer massive enemies and battle your way through a mythical underworld and earn the grace of the gods.\n\nClash of the Titans is a dark adventure full of gods and monsters that thrusts you into the role of Perseus as you embark on an epic journey to defeat Hades and his many mythological minions. Navigate 15 dangerous environments that test your limits. Conquer brutal beasts using more than 80 customizable weapons or steal weapons from your enemies and use them to your advantage. Through a combination of courage and brute strength, you will ultimately determine the fate of the Earth.\n\nFeatures:\n\n* Clash of the Titans is an action-adventure game pairing to the theatrical release of the same name.\n* Dark Fantasy Based on Greek Mythology.\n* Relive adventures of Perseus from movie.\n* New, original bosses &amp; adventure.\n* Take your enemies power and make it your own.\n* Explore and conquer 15 vast environments.\n* Customize more than 80 weapons to help you in battle or steal weapons from your enemies for additional power.\n* Downloadable content includes bonus quests, skills and custom items to enhance gameplay and weaponry.\n* Unlock new adventures beyond the Clash of the Titans film in Storyline mode.\n* Battle more than 100 mythological creatures including centaurs, succubi, cyclops and enemies from the film.\n____________________________________________\n\nYOU HAVE TO USE WINRAR 5 TO EXTRACT ARCHIVE!","torrent":{"xt":"urn:btih:12f44fa1993cdad1f4d58610eebf89949805337d","amp;dn":"%5BPS3%5D+Clash+of+the+Titans","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12f44fa1993cdad1f4d58610eebf89949805337d","infoHashBuffer":{"type":"Buffer","data":[18,244,79,161,153,60,218,209,244,213,134,16,238,191,137,148,152,5,51,125]},"announce":[],"urlList":[]}}