{"title":"Yoga in Hawaii with Lynne Oliver Vol 2 Sandy Bay x264 aac [MP4]","uid":11820968,"size":830182214,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:13356784655f74c697568d46aa2ad56aecfde3c7&amp;dn=Yoga+in+Hawaii+with+Lynne+Oliver+Vol+2+Sandy+Bay+x264+aac+%5BMP4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"elessedilgirl","files":2,"time":1429259448,"description":"This DVD is dedicated to strengthening the whole self, Mind, Body, Emotions and Spirit. It will encourage beginners to practice with safety and confidence and advanced students to look more carefully at their techniques. Filmed in Hawaii, the charisma of a beautiful environment with authentic nature sounds makes this a truly Holistic Experience. SANDY BAY Chapter Info 1. STANDING INTRODUCTION and THE POWER OF BREATH AWARENESS Shoulders, neck, arm releasers for tight, painful shoulders, elbows, carpel tunnel syndrome and arthritic wrist pain. 2. CORE STABILITY AND LEG STRENGTHENING Side body stretches Hip stabilizers Spine opener and lengthening sequence Upper thoracic spinal twist Supported inversion for sinusitis More advanced leg strengthening sequence in preparation for Sun Salutation 3. LOWER BACK SECTION Tight lower back and lumber spine soother Detailed stomach exercise, safe but powerful Lying down spinal twist with lower back protection Military Salute Sequence to strengthen lower backs Flowing Sequence to increase mobility in lower and upper spine. Cranial work and neck opener 4. DOWNWARD FACING DOG with correct emphasis on rhomboid back muscles for support 5. HAM STRING AND SHOULDER OPENERS Wide angled leg stretch Side body core stability Powerful core stability exercise for lower back stiffness 6. RELAXATION\n\nVideo; x264; 720*570 (4:3); 2412 kbps; 25.000 fps\nAudio; aac; 160 kbps; 2 ch; 48.0 Khz","torrent":{"xt":"urn:btih:13356784655f74c697568d46aa2ad56aecfde3c7","amp;dn":"Yoga+in+Hawaii+with+Lynne+Oliver+Vol+2+Sandy+Bay+x264+aac+%5BMP4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13356784655f74c697568d46aa2ad56aecfde3c7","infoHashBuffer":{"type":"Buffer","data":[19,53,103,132,101,95,116,198,151,86,141,70,170,42,213,106,236,253,227,199]},"announce":[],"urlList":[]}}