{"title":"Metamorphosis (Hipcentric) - x264 - MP4 - DVDrip","uid":10867647,"size":2443777057,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:13a74f38eb98efcb1b066e05de300be08249f92f&amp;dn=Metamorphosis+%28Hipcentric%29+-+x264+-+MP4+-+DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MrTVGuy","files":-1,"time":1408933827,"description":"Metamorphosis is A full-body workout and does not Neglect any area of your body. However, by selecting your body type, your problem areas will be targeted throughout your 90-Day Transformation. In the newly released Metamorphosis by Tracy, Will you transform your body, defy Genetics, and create the body you never That Thought Possible. Prepare to be challenged throughout this 90-day program that includes 4 discs of transforming muscular structure work, designed for your specific body types, a cardio component, and a dynamic eating plan. Experience this Total Transformation through your Own Metamorphosis! Metamorphosis Buyers are Also Eligible to Extend Their workouts with Metamorphosis Continuity. Starting 90 days after you Place your order you'll Receive A set of Metamorphosis by Tracy muscular structure workouts automatically shipped to you. Meta Metamorphosis is targeted to your Body Type With the help of &quot; Metamorphosis &quot;by Tracy Anderson we change his body, despite genetics, and create the body that thought was impossible! Get ready for a load for the 90 days following the program, which includes 10 workouts on the transformation of muscle structures designed for different types of shapes, cardio workout and nutrition plan.\n\nOMNICENTRIC - For those who gain weight evenly across the body. \n\nHIPCENTRIC - For those who have a small waist, wide hips and full legs. For you, it is important to tighten the thighs, remove excess fat and get rid of cellulite. \n\nABCENTRIC - For those who gain weight in the stomach and waist. This is aimed at reducing the middle of your body and creates a flat stomach and a feminine form. \n\nGLUTECENTRIC - For those who have a large and shapeless &quot;back end.&quot; This complex will pull your ass, take away fat and cellulite in order to give an appetizing form\n\nThis Workout system is the first 90 days of Hipcentric.\n\nAs all workouts, encoded with maximum compatibility, small file size and good quality.","torrent":{"xt":"urn:btih:13a74f38eb98efcb1b066e05de300be08249f92f","amp;dn":"Metamorphosis+%28Hipcentric%29+-+x264+-+MP4+-+DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13a74f38eb98efcb1b066e05de300be08249f92f","infoHashBuffer":{"type":"Buffer","data":[19,167,79,56,235,152,239,203,27,6,110,5,222,48,11,224,130,73,249,47]},"announce":[],"urlList":[]}}