{"title":"Heroes and Castles 2 v1.00.08.1~4 + Mod Money/Skill ","uid":12102141,"size":2303483191,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:141fc163db5f58a6c0d070a961fcc49ec1cb322b&amp;dn=Heroes+and+Castles+2+v1.00.08.1%7E4+%2B+Mod+Money%2FSkill+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"JDNYP","files":12,"time":1436349342,"description":"[b]Heroes and Castles 2 v1.00.08.1~4 + Mod[/b]\n[b]Requirements[/b]: 3.1 +\n[b]Overview[/b]: You stand solemn, overlooking the battlefield. To your left, towering giants rush into battle, bashing hordes of goblins high into the air with each swing of their bone clubs. \n[img]http://s23.postimg.org/8q4etl7fr/I3q_En_VGo_HGJ82_Wje2_QBz_D_3_SUGorrlc_GQLC_rrd_RE8i_W67b.jpg?noCache=1436339633[/img]\n\nTo your right, Dwarven Iron Helms break into shambling skeletons, while a line of Pikemen ready their spears for one last charge. Behind you, your Elven Archers unleash their arrows overhead into lumbering Trolls and savage Orcs. But it is not enough, and the enemy keeps coming... With one last cry to battle, you ready your sword and charge into the fraya!\n\n-----------------------\n\nEnter Heroes and Castles 2, a 3rd person action-RPG, strategy, and castle defense mash-up! Choose from one of three powerful races, customize your hero, summon a massive army to fight beside you in battle, defend your castle, conquer lands, and ultimately destroy the enemy stronghold!\n\n\n[color=green][b]-----FEATURES-----[/b][/color]\n\n[b]CASTLE DEFENSE, STRATEGY, AND ACTION-RPG GAMEPLAY![/b]\nTake to the battlefield in an immersive 3rd person perspective, summon entire armies to fight beside you, and defend your castle to the death! Fight in the middle of a huge battle that you control!\n\n[b]CUSTOMIZE YOUR HEROES![/b]\nChoose one of three races, level up, learn new skills and abilities across 9 classes, forge weapons, armor, and shields, and destroy your enemies!\n\n[b]SUMMON HUGE ARMIES TO FIGHT BESIDE YOU![/b]\nSummon Dwarfs, Elves, Archers, Pikemen, Giants, Knights, Catapults, Mages and much more to aid you in your defense. Watch them battle the enemy right beside you in massive, epic battles!\n\n[b]BUILD AND UPGRADE YOUR CASTLE![/b]\nBuild Towers, upgrade your castle walls, and defend! Conquer new lands and build outposts to secure them.\n\n[b]EPIC SINGLE PLAYER CAMPAIGN![/b]\nDefend your castle through 30 waves, all while taking control of an enormous map by capturing and defending new outposts. Ultimately lay waste to the enemy castle in a final, glorious siege battle!\n\n[b]COOPERATIVE MULTIPLAYER![/b]\nTeam up with a random ally or one of your friends!\n\n[b]PVP COMPETITIVE MULTIPLAYER![/b]\nBattle against other players - defend your castle and destroy theirs!\n\n[b]TONS OF ENEMIES TO BATTLE![/b]\nFight against dozens of enemies on screen at once, from hordes of the Undead, to Orcs, Goblins, Ghouls, Spiders, Trolls, Catapults, Mummies, and more!\n\n[b]ADVANCED GRAPHICS AND TONS OF FEATURES![/b]\nIncredible mobile graphics and lighting, fight with dozens of units on screen at once, hi-resolution assets for top of the line devices, cloud saving, controller support (Shield, Moga Mode B ONLY, SteelSeries, etc), and more!\n[color=green]\n[b]What's New[/b][/color]\n- Fixed the map screen crash that some devices were having\n- Fixed some other random crashes\n- Fixed the bug where the game would freeze when trying to change controller mappings\n\n[color=red][b]This app has no advertisements[/b][/color]","torrent":{"xt":"urn:btih:141fc163db5f58a6c0d070a961fcc49ec1cb322b","amp;dn":"Heroes+and+Castles+2+v1.00.08.1%7E4+%2B+Mod+Money%2FSkill+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"141fc163db5f58a6c0d070a961fcc49ec1cb322b","infoHashBuffer":{"type":"Buffer","data":[20,31,193,99,219,95,88,166,192,208,112,169,97,252,196,158,193,203,50,43]},"announce":[],"urlList":[]}}