{"title":"Windows 8 Transformation Pack 7","uid":11839068,"size":62410752,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:14d42a94d86baa24758a4705e76951421f97766d&amp;dn=Windows+8+Transformation+Pack+7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jegr1","files":1,"time":1429811505,"description":"Windows 8 Transformation Pack give you the look and feel of Windows 8 on older \nWindows versions. The Metro design, themes, wallpapers, icons, sounds and other features can all be yours with this excellent free theme pack. \nFeatures\nWindows 8 Transformation Pack automatically installs several design changes and programs. The freeware comes with an imitation of the new Modern style and adjusts menus, cursors, screensavers and system sounds to emulate Windows' 8th version. You can also configure individual elements of Windows 8 Transformation Pack via the wizard. \nUsability\nWindows 8 Transformation Pack adds pizazz with its own Modern apps. By clicking on the tile store, you can manage programs and play mini updates or add extra apps. Standard elements include apps like Clock, Calendar, system settings, Gmail, Hotmail, Twitter, Facebook, Internet Explorer, Music and Photo Gallery. \nQuality\nWindows 8 Transformation Pack is a worthy successor to the popular Seven Transformation Pack. This early version of Windows 8 is a pretty impressive mimic. If Seven Translation Pack is anything to go by, as Windows 8 gets more advanced, so too will Windows 8 Transformation Pack, so keep an eye out for even more updates. \nConclusion\nIf you want a taste of Windows 8 on XP, Vista or Windows 7, download Windows 8 Transformation Pack asap!","torrent":{"xt":"urn:btih:14d42a94d86baa24758a4705e76951421f97766d","amp;dn":"Windows+8+Transformation+Pack+7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14d42a94d86baa24758a4705e76951421f97766d","infoHashBuffer":{"type":"Buffer","data":[20,212,42,148,216,107,170,36,117,138,71,5,231,105,81,66,31,151,118,109]},"announce":[],"urlList":[]}}