{"title":"MMA Manager Game v1.0.3","uid":12000862,"size":17993089,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:15759bce6f7f2431b68dcdb969bb5fbf40de649a&amp;dn=MMA+Manager+Game+v1.0.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"Androider","files":1,"time":1433777275,"description":"Have you ever wanted to run your own MMA federation? Well, now you can, with MMA Manager, the exciting sports strategy game.\n\nHire the best fighters, book the best matches, and become an MMA tycoon, as you take your federation to the top of the TV and PPV rankings.\n\nYou will compete against two other federations who are also trying to find the hottest talent, and draw the biggest crowds to their shows.\n\nNote: MMA Manager Game contains no annoying ads or pay-to-win elements to spoil your enjoyment. Just pay once and play... uninterrupted... forever!\n\nMMA Manager Game features:-\n\n--- 500 unique fighters, in three weight classes, who specialise in martial arts such as Karate, Brazilian Jiu-Jitsu, Muay Thai, Wrestling and more, as well as those trained in mixed martial arts.\n\n--- Every fighter is uniquely generated, so no two players will ever experience the same game world. Each fighter has numerous different attributes that determine how they'll perform in the cage.\n\n--- Each fighter ages, improves their skills (perhaps), gets old, and eventually retires, to be replaced by an enthusiastic new rookie.\n\n--- MMA Manager is never-ending. Fighters will come and go over the years, and the MMA landscape will keep changing. Champions will lose their edge, and young upstarts will climb the ranks.\n\n--- You can check out your scout's reports, to try to find good free-agent fighters to sign, but, of course, the only way to really know if a fighter is any good is to put them in the cage!\n\n--- You get to select the venue, set the ticket price, and the pay-per-view price, all in the hope of earning enough money to be able to hire the top MMA stars.\n\n--- You must then book the best matches to draw in the crowds, and take your shows up the TV ratings. Do you put a championship match on your TV show in order to boost ratings, or do you save it for the big PPV event?\n\n--- Book video and live promo spots on your TV shows, in order to increase the fan buzz for your fighters.\n\n--- When it's time to step in the cage to fight, MMA Manager gives you a play-by-play text commentary, so that you can watch the action unfold.\n\nSo, are you set to enter the brutal world of MMA, and build your federation in MMA Manager Game?\n\nNOTE: For licensing reasons, this game does not contain any fighter, company, or event names belonging to real-world MMA organisation like the UFC, or Bellator, nor will it in the future, so please don't ask. It's a fantasy sports game, containing computer-generated fighters.\n\nWhat's New:\n\nV1.0.3 7th June 2015\n-- FIXED: Bug that appeared after Update 1.0.2 that caused fighter to remain in free agent rankings, even after signing for your fed.\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.uk.jasonwebb.mmamanager&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.uk.jasonwebb.mmamanager&lt;/a&gt;","torrent":{"xt":"urn:btih:15759bce6f7f2431b68dcdb969bb5fbf40de649a","amp;dn":"MMA+Manager+Game+v1.0.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15759bce6f7f2431b68dcdb969bb5fbf40de649a","infoHashBuffer":{"type":"Buffer","data":[21,117,155,206,111,127,36,49,182,141,205,185,105,187,95,191,64,222,100,154]},"announce":[],"urlList":[]}}