{"title":"Soldiers at War [cd]- MADJACKTHEPISSEDPIRATE","uid":12049094,"size":808381849,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:175eb1820c0e6d9524b6fff96d2e847411cd48c8&amp;dn=Soldiers+at+War+%5Bcd%5D-+MADJACKTHEPISSEDPIRATE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MADJACKTHEPISSEDPIRATE","files":4,"time":1434963123,"description":"\n\n\nPLEASE SEED THIS TO AT LEAST A 1. SHARE SO THE PEOPLE WHO WANT THIS CAN GET IT FOR THE FIRST FEW DAYS AT LEAST. WIITHOUT A LONG WAIT BY MY 100KBPS UPLOAD RATE. THANK YOU FOR YOUR HELP ! you dont have to seed it all in one squirt...i can only seed 14 hrs max a day cause im not a network genius and my vpn kicks out yada yada. dont wanna get busted of course.[i fouled something up in network connections with an online guide and i cant figure it out...duh] least i got ivp 6 disaabled. read they can catch you if its running.\n\nLIKE CYBERMAGE IN 05 I ARCHIVED MY DISKS TO IMAGE FILE USING CLONE CD..SO YOU WILL PROLLY HAVE TO USE THAT TO BURN THE IMAGE TO A CD if power iso or daemon doesnt work  MADJACK IS NOT RESPONSIBLE FOR ANY PROBLEMS YOU MIGHT HAVE WITH THIS TORRENT. lol i just add that for fun.. WRITE A COMMENT IF THE CD IMAGE ISNT VALID...NO ONE HAS COMMENTED EITHER WAY.\n\nSoldiers at War is a turn-based tactics game set in World War II. You take control of eight-man squads through the campaign of fifteen historically based missions, starting in north Africa and ending in Germany. Your soldiers become more experienced and can take items with them onto the next mission. This allows you to build up powerfully well-equipped forces by the end of the war. The game also features a selection of single play stand-alone missions and a comprehensive scenario editor that improves the game's replayability. The multiplayer mode allows up to four people to participate in competitive games via LAN or online.\n\nYou select your squad from a group of 32 men, each with his own skills profile, and you must equip them to suit each mission and their role. The game's controls involve moving your soldiers around with the mouse and have some 40 different commands at your disposal. The game is played looking down on the maps with their 3D terrain. You can remove layers of terrain in order to see inside buildings or behind other objects and keep track of your soldiers. The campaign is played from the perspective of the Americans against the Germans and Italians; you will also encounter free French forces throughout some of the later missions","torrent":{"xt":"urn:btih:175eb1820c0e6d9524b6fff96d2e847411cd48c8","amp;dn":"Soldiers+at+War+%5Bcd%5D-+MADJACKTHEPISSEDPIRATE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"175eb1820c0e6d9524b6fff96d2e847411cd48c8","infoHashBuffer":{"type":"Buffer","data":[23,94,177,130,12,14,109,149,36,182,255,249,109,46,132,116,17,205,72,200]},"announce":[],"urlList":[]}}