{"title":"TeenPies - Kaylee Haze (Daddys Girl Gets Filled) NEW 18 August 2","uid":10815518,"size":2013247898,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:19a6b48fec5f24f73e995d275ea14c3a5551c6be&amp;dn=TeenPies+-+Kaylee+Haze+%28Daddys+Girl+Gets+Filled%29+NEW+18+August+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1408458879,"description":"Kaylee was visiting friends and family in L.A. and on a recent trip to the coffee shop she got her dads car towed - a Benz! She told her buddy about the situation and let him know its gonna take $500 to get the car out of impound. A friend of hers told her she would lend her the cash and pick her up but she sold her out and her pal offered her the cash for her car in exchange for busting his nut inside of her tight teen pussy! Since she didnt want to get in trouble with her pops she agreed to get filled up - SCORE! Kaylee was kinda reluctant to get it on with one of her best friends but once she saw his massive cock she opened up wide and rammed it down her throat. She never knew he could slang his rod like that and she was happy to take all of his man meat deep inside her young snatch and was upset it took her so long to get properly fucked. Little Kaylees first creampie was a thick and creamy one and our bet is that it wont be her last!\nTags:\n18, 18 Year, Adorable, Amateur, Babe, Big Dicks, BJ, Blowjob, Camel Toe, Casual, Caucasian, Completely Naked, Couch, Cowgirl, Crazy, Creampie, Creampie Internal Teen Hardcore, Cum, Cute, Deepthroat, Doggystyle, Dominance, Girl Next Door, Glasses, Hardcore, Home, Indoor, Internal, Jeans, Jizz, Living Room, Long Hair, Missionary, Natural Tits, No Condom, Nympho, Petite, Piercings, Redhead, Rough Sex, Sexy, Shaved Pussy, Short, Skinny, Slim, Straight, Teen, Thong, Tiny, Toned, White, Wild,\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=55638002127220553010.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=55638002127220553010.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=03682911024840601700.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=03682911024840601700.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:19a6b48fec5f24f73e995d275ea14c3a5551c6be","amp;dn":"TeenPies+-+Kaylee+Haze+%28Daddys+Girl+Gets+Filled%29+NEW+18+August+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19a6b48fec5f24f73e995d275ea14c3a5551c6be","infoHashBuffer":{"type":"Buffer","data":[25,166,180,143,236,95,36,247,62,153,93,39,94,161,76,58,85,81,198,190]},"announce":[],"urlList":[]}}