{"title":"Flying Bird","uid":12115907,"size":47922719,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:1cf0d579ec870ef68fa53ed870c82fd2c640d0c1&amp;dn=Flying+Bird&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"XandRafy","files":25,"time":1436659487,"description":"Flappy Bird is a side-scrolling mobile game featuring 2D retro style graphics. The objective is to direct a flying bird, named &quot;Faby&quot;,[10] which moves continuously to the right, between sets of Mario-like pipes. If the player touches the pipes, it ends the game. The bird briefly flaps upward each time the player taps the screen; if the screen is not tapped, the bird falls due to gravity. The player is scored based on the number of pipe sets that the bird successfully passes through, with medals awarded for the score at the end of the game.\n\nThis torrent contains both PC as well as Android versions of Flying Bird(a clone of Flappy Bird).\nIt has been developed using Unity 3d engine. The Android version DOES HAVE ADS. However, if anyone wants the ad free version let me know in the comments and I will upload it as soon as possible.\n\nThis game is still not completely ready, and there might be quite a few glitches. Let me know in the comment section so that I can fix them.\n\nThe Android version is bigger in size since some extra stuff has been added in the Android version. Also the unity engine itself takes up a lot of space.\n\nAlso, post your high scores in the comments! My high score till now is 12(I am pretty bad).\n\nNote if you download the PC version, you also have to download the Flying Bird PC_Data folder or else it won't work.\n\nFor the PC version, jump with Space and exit with ESC button\n\nMy net speed is really slow, so downloading initially might take some time till I get a few seeders","torrent":{"xt":"urn:btih:1cf0d579ec870ef68fa53ed870c82fd2c640d0c1","amp;dn":"Flying+Bird","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cf0d579ec870ef68fa53ed870c82fd2c640d0c1","infoHashBuffer":{"type":"Buffer","data":[28,240,213,121,236,135,14,246,143,165,62,216,112,200,47,210,198,64,208,193]},"announce":[],"urlList":[]}}