{"title":"UK Nympho Nurses **NEW 2014** WEB-DL 576p","uid":10965011,"size":1804762816,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:1da4bb2033f73997a6103a01e6476ea78c38e284&amp;dn=UK+Nympho+Nurses+%2A%2ANEW+2014%2A%2A+WEB-DL+576p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"TKTh3K1ng","files":1,"time":1409754764,"description":" &lt;a href=&quot;http://imgking.org/?g=628010&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://imgking.org/?g=628010&lt;/a&gt;\n\nUK Nympho Nurses\nUK Porn Kings  / Year : 2014\n\nCast :\nBonnie Rose, Chantelle Fox, Louise Jenson, Romana Ryder, Samantha Bentley \n\nSynopsis :\nou don't see naughty nurses like these in your run-of-the-mill NHS hospital - the nurses in UK Nympho Nurses 1 are unique in every way. They have a bedside manner that will make you feel so much better! Bonnie Rose is your porn star fantasy nurse. If you like your girls to know how to talk dirty and back it up with hard core fucking skills, then you'll simply love her's. Hot slut nurse Chatelle Fox gets to grips with a sex crazed patient on her rounds. After jerking him off into her pretty eager mouth, Chantelle bends over and is fucked bareback like a slut on heat before taking his heavy load. Amazing brunette babe Louise Jenson looks stunning in black latex as she offers up some unique sexual therapy to a willing big dicked stud. It's an oily tit job, followed by a deep and wet blowjob for starters before this kinky nurse is fucked hard. Exotic Romana Ryder looks amazing as she deals with her willing patient. The petite busty slut jerks off his hard cock before going down on him in a cock worship style. The final nurse in this sexy hospital is the super-hot Samantha Bentley. The stunning brunette starts off by sucking off a very well hung patient before sliding his fat cock into her soaking tight cunt and milking him to a facial frosting. These UK Nympho Nurses don't need a thermometer to check their temperature - they'll use yours! \n","torrent":{"xt":"urn:btih:1da4bb2033f73997a6103a01e6476ea78c38e284","amp;dn":"UK+Nympho+Nurses+%2A%2ANEW+2014%2A%2A+WEB-DL+576p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1da4bb2033f73997a6103a01e6476ea78c38e284","infoHashBuffer":{"type":"Buffer","data":[29,164,187,32,51,247,57,151,166,16,58,1,230,71,110,167,140,56,226,132]},"announce":[],"urlList":[]}}