{"title":"POtHS - Victory Over Sin Vol 28 - Prepare the Way Its Time To Pr","uid":12088379,"size":10649038919,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1f3a3973452b4c8b6c37cfbae461946519fd595c&amp;dn=POtHS+-+Victory+Over+Sin+Vol+28+-+Prepare+the+Way+Its+Time+To+Pr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":117,"time":1435962200,"description":"Mind Control America's Secret War:\nHear the chilling story of a woman whose entire past was erased by the CIA. \n---------------------------------------------------------------------------------------------------------\n\nWar is a racket - The Pathology of Power and American propensity for war:\nThis video gets off to a slow start, but give it a minute or two.  Interesting story about Cousins...  He wrote a massively important book in 1987 called &quot;The Pathology of Power.&quot; Interestingly, it fell off the map, but the news media went into overdrive promoting his less important books... (Maybe a buyoff?).  \n\nOne of the great lessons of this book references after World War I when the world was sick to death of war, the munitions makers got together to make sure that big wars continued. They organized to buy Congress and the media and they made sure that the war mentality was THE mentality.  It's well recorded that it was not necessary for the U.S. to have dropped the atomic bomb on Japan as they were already going to surrender.  Intentionally misleading the public, the U.S. had ulterior motives for blasting Japan with a nuke!\n\nSome gems:\n&quot;War is a double suicide.&quot;\n&quot;The fleecing of the American people in the name of security&quot;\n&quot;Under the name of security, our security is threatened.&quot;\n&quot;What makes you think that the people who can't be trusted with the wealth of the American people can be trusted with their security.&quot;\n-----------------------------------------------------------------------------------------------------------\n\nVictoria, Nigeria - IDOP 2013:\nThis 5-minute IDOP video focuses on Victoria and Rejoice, two teenage girls who live in Gombe, Nigeria. One day as the girls worshiped at the Deeper Life Church, they came under attack from radical Muslims. Both girls lost family members.\n\nBelievers like Victoria and Rejoice need our prayers. To encourage more prayer for the persecuted, this year VOM is offering our 2013 IDOP video for free. Please share the DVD with your pastor, and ask him to share it with your church on Nov. 3, the International Day of Prayer for the Persecuted Church. Please also share it with your family, friends and Sunday school class. We want believers to know what is happening to our brothers and sisters in Nigeria so they can join us in prayer for them.\n\nGo to http://www.icommittopray.com to show your commitment to pray for the persecuted church and begin to receive weekly prayer updates when the full site launches on Nov. 3.\n-----------------------------------------------------------------------------------------------------------\n\n'Monsanto wants total control, covers up grave GMO dangers':\nResearcher exposes Monsanto's GMO problem.  Supermarkets are flooded with GMO products, but how safe is it to eat them? Tasty and beautiful, they are produced with intervention unprecedented in history. Gene manipulation: how appropriate is it? Does it contribute to solving the food crisis on the planet? Or will humanity have to pay a costly price for meddling with what is not theirs. We talk to Jeffrey M. Smith, GMO researcher from the Institute for Responsible Technology.  A large number of case studies show that MD's who prescribe non-GMO products to patients' diets have documented a tremendous decrease in various diseases, cancers and etc.!  (That alone should be cause of concern.) \n\nMonsanto GMO uses the new and improved FAKE SCIENCE to intentionally mislead the public and achieve their goal of global dominance and servitude. Simply utilizing proven concepts in the deceptive tactics of corporate scientific authorship learned from the Drug and Tabacco (Cigarette) Companies of the past, Monsanto increases agricultural dependence and public indocrintation. Money buys Congress and the Court Legislative System to help impose and sustain their monopoly - just as Cigarette Companies did from the 40's, 50's, 60's, 70's and 80's. While other nations, like in the UK, have banned all GMO products, the United States remains obedient and submissive to the Corporate Giant and helps censor the devasting consequences of using GMO products form public awareness. \n\n--------------------------------\n\nOther Featured Videos include...\nHal Lindsey Report Faith in the Military 9-13-13\nHelen Kurdin -  Videotaped Statement asking Canadian Prime Minister to Stop Mind Control Weapons Use\nPresidential Commission for the Study of Bioethical Issues 2011-03-01\nPresidential Commission for the Study of Bioethical Issues May 18-19-2011","torrent":{"xt":"urn:btih:1f3a3973452b4c8b6c37cfbae461946519fd595c","amp;dn":"POtHS+-+Victory+Over+Sin+Vol+28+-+Prepare+the+Way+Its+Time+To+Pr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f3a3973452b4c8b6c37cfbae461946519fd595c","infoHashBuffer":{"type":"Buffer","data":[31,58,57,115,69,43,76,139,108,55,207,186,228,97,148,101,25,253,89,92]},"announce":[],"urlList":[]}}