{"title":"The Great Railway Bazaar by Paul Theroux (Retail .epub)","uid":10718222,"size":2249822,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1fe4b30440101c3ff353392486aead79a3176a75&amp;dn=The+Great+Railway+Bazaar+by+Paul+Theroux+%28Retail+.epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"poopsmigoops","files":-1,"time":1407440553,"description":"Synopsis:\nFirst published more than thirty years ago, Paul Theroux's strange, unique, and hugely entertaining railway odyssey has become a modern classic of travel literature. Here Theroux recounts his early adventures on an unusual grand continental tour. Asia's fabled trains -- the Orient Express, the Khyber Pass Local, the Frontier Mail, the Golden Arrow to Kuala Lumpur, the Mandalay Express, the Trans-Siberian Express -- are the stars of a journey that takes him on a loop eastbound from London's Victoria Station to Tokyo Central, then back from Japan on the Trans-Siberian. Brimming with Theroux's signature humor and wry observations, this engrossing chronicle is essential reading for both the ardent adventurer and the armchair traveler.\n\nInfo:\nThis is a retail epub that was created using obok 2.01 to remove the drm from a kepub in the Kobo PC program. Normally most publishers provide a separate Adobe Digital Edition epub download when purchasing an eBook through the Kobo store but it would appear as thought this publisher (Houghton Mifflin Harcourt) has some kind of agreement/deal with kobo to not do this. Since Houghton Mifflin Harcourt feels that they do not need to provide an adequate way to use our rightfully purchased property, this torrent has been created.","torrent":{"xt":"urn:btih:1fe4b30440101c3ff353392486aead79a3176a75","amp;dn":"The+Great+Railway+Bazaar+by+Paul+Theroux+%28Retail+.epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fe4b30440101c3ff353392486aead79a3176a75","infoHashBuffer":{"type":"Buffer","data":[31,228,179,4,64,16,28,63,243,83,57,36,134,174,173,121,163,23,106,117]},"announce":[],"urlList":[]}}