{"title":"Neighbor From Hell 1.8 FULL","uid":10861656,"size":19692340,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:219db1e6fde1cc6beb846abbd8eb76f00df57ef6&amp;dn=Neighbor+From+Hell+1.8+FULL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mibuffer","files":1,"time":1408888983,"description":"REAL notes and banners (in Spanish) left by neighbors in garages, apartment buildings, elevators and neighborhoods, all collected for you in one of the trendiest apps of the moment.\n\nIn this app from the successful subatomico saga, you will laugh with thousands of funny images and banners, randomly shown and periodically updated for your laughing pleasure. It's incredible what the neighbors write and how they behave. Typical Spanish. \n\nIf you are learning Spanish, it's the perfect way for you to learn the REAL thing.\nIf you like laughing, jokes, funny stories, memes, then this is your app. Works perfectly in your mobile phone or tablet. Daily laughs guaranteed!\n\nYou can share your favorite pictures in Facebook, Twitter, Whatsapp, email, Dropbox, store locally...\nThanks to all app supporters, you can now like the app in Facebook.\n\nTreat yourself with some daily laughs: laughs from the neighbor from hell!\n\nTags: neighbor, neighbour, nasty, laughs, smiles, neighborhood, jokes, fun, funny, infernal, hell, lift, elevator, memeces, garage.","torrent":{"xt":"urn:btih:219db1e6fde1cc6beb846abbd8eb76f00df57ef6","amp;dn":"Neighbor+From+Hell+1.8+FULL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"219db1e6fde1cc6beb846abbd8eb76f00df57ef6","infoHashBuffer":{"type":"Buffer","data":[33,157,177,230,253,225,204,107,235,132,106,187,216,235,118,240,13,245,126,246]},"announce":[],"urlList":[]}}