{"title":"No Middle Ground - Sanjeev Shetty","uid":10720015,"size":11307885,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:23e7d6e3f874f7ed9fffa94fa10f7d0992ba77d5&amp;dn=No+Middle+Ground+-+Sanjeev+Shetty&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1407468387,"description":"2014 marks the 25th anniversary of the first bout in the epic unforgettable battle between Nigel Benn, Michael Watson and Chris Eubank that would keep us entertained for five manic, magnificent and ultimately tragic years.\n\nThe fight took place a month after the Hillsborough disaster and was screened live on TV, in a slot now dominated by talent contests. It was a time when kids could stay up late to watch 12 rounds of madness. It was also the last Golden Era of British Boxing.\n\nWhile for us these greats of British boxing provided entertainment away from the hooliganism of football, for them it was much more personal. Rivalries exist in every sport, but their loathing was real and in the ring it nearly became deadly. But this is what the swaggering early-90's Britain tuned in for. These three fighters were Britain's alpha-ego. They made the country proud.\n\nNo Middle Ground takes us back to the years when these boxers pounded the heavy bags and tells their story as well as that of Britain's love affair with the sport, and how these fight came to define them and us. In tracing the boxers' journeys to centre-stage Sanjeev Shetty reveals the story of the dark side of Thatcher's nation - the blood, the sweat, the dangerous hatred that fuelled these men, and the ultimate price they would pay for their moment in the sun.","torrent":{"xt":"urn:btih:23e7d6e3f874f7ed9fffa94fa10f7d0992ba77d5","amp;dn":"No+Middle+Ground+-+Sanjeev+Shetty","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23e7d6e3f874f7ed9fffa94fa10f7d0992ba77d5","infoHashBuffer":{"type":"Buffer","data":[35,231,214,227,248,116,247,237,159,255,169,79,161,15,125,9,146,186,119,213]},"announce":[],"urlList":[]}}