{"title":"The Anthony Cumia Show 2015-04-28 Rick Shapiro","uid":11864922,"size":281281542,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:2636126c819f298d88aa5c618a40c749526392f8&amp;dn=The+Anthony+Cumia+Show+2015-04-28+Rick+Shapiro+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mothergoose58","files":2,"time":1430324907,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest: Rick Shapiro\n\nEpisode 153 - After some quick details on Rat's Apple Watch, Anthony gets into a bit of a recap on yesterday's super show, talks about the goings on in Baltimore overnight, changes in racism, accepting opportunity, sense of community, misplaced anger, childlike reactions to frustration, and government dependency. He then plays a passionate &quot;inspirational&quot; video, discusses latching onto causes because of race, the Baltimore mayor, and a beach ready Rick Shapiro joins TACS via Skype to talk about Maron, finding male friends, living in LA, escaping LA, existentialism, defining loneliness, NY versus LA comics, Rick's one-man show, and his paintings. Ant then talks about gay marriage, plays a clip from Pat Robertson with pointers on how to handle gays, calls hardcore religion camouflaged, reminisces about going to Nassau Coliseum, KtC reminisces about doing drugs, and we hear about &quot;inspector&quot; Anthony. We then see a high-tech movie trailer from Uganda, talk about the Adam Sandler Indian scandal, Adam Sandler's shitty movies, Anthony questions whether or not Adam Sandler is a hypnotist, we learn WTF a cultural advisor is, see the &quot;walk off&quot; from the Sandler movie, and Bobo calls in to talk Fan Duel, baseball, and his awful haircut.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:2636126c819f298d88aa5c618a40c749526392f8","amp;dn":"The+Anthony+Cumia+Show+2015-04-28+Rick+Shapiro+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2636126c819f298d88aa5c618a40c749526392f8","infoHashBuffer":{"type":"Buffer","data":[38,54,18,108,129,159,41,141,136,170,92,97,138,64,199,73,82,99,146,248]},"announce":[],"urlList":[]}}