{"title":"Prison Architect Alpha 36","uid":12313757,"size":164581079,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2652bbd76781f301e433713deb861617060f89aa&amp;dn=Prison+Architect+Alpha+36&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"der3313","files":1,"time":1440951689,"description":"Prison Architect Alpha 36:\n\nRandom event system\nRandom incidents, disasters and challenges will occur during your game, providing extra difficulty and unpredictability. This is an optional system, and is enabled from the &quot;Create new prison&quot; screen.\n\nEvents will not happen during riots, or if you have less than 50 prisoners on site\nEvents are less likely if there have been deaths and escapes recently.\nSometimes, rarely, several events may occur at once.\nAll events have an EXTREME version, which is very rare, and much more severe.\nPOWER STATION FIRE\nYour power station catches fire. Can only occur if your powerstation is overloaded.\nEXTREME version: Your power station explodes, damaging buildings/equipment/people nearby.\nKITCHEN FIRE\nA cooker in the kitchen catches fire. This can cause havok with your mealtime arrangements! We recommend you build sprinkler systems in key areas to mitigate this.\nBULK INTAKE\nA random number of prisoners will be transferred into your facility within the next hour.\nEXTREME version: All of the prisoners belong to the same gang, and you are probably fucked.\nWORKSHOP ACCIDENT\nA prisoner injures himself on the equipment in the workshop, and requires medical attention. Prisoners injured this way get the &quot;Bleeding&quot; status effect. Get them to a doctor quick!\nSUBSIDENCE\nA random section of your wall or fence collapses. Get it rebuilt before we have a mass escape! We always recommend double outer walls, and this gives yet another good reason.\nVIRUS\nA prisoner comes down with a highly contagious virus. The virus will spread to nearby inmates, so try to isolate them. Prisoners suffering from this virus will look sickly, move slowly, and vomit a lot. Some will fall unconcious. Your guards will try to take confirmed cases to the infirmary for cure. Some inmates will go to the infirmary themselves, but only when they are let out their cells.\nEXTREME version: Some prisoners will eventually die from the virus if left untreated.\nMASS ASSASÂ­SINÂ­ATÂ­ION\nYou discover that several inmates at your prison are federal witnesses in an upcoming prosecution. Unfortunately, somebody has put a price on their heads and they will all be assassinated in the next few hours. Find out who there are (using your Confidential Informants), and get them moved to Protected Custody. Once the timer hits zero, they will all leave the prison to attend the court hearing, and will not return. (Most likely living out their lives in federal witness protection, holding their breath every time they start their cars)\nCITY MAYOR DEMANDS\nThe Mayor is under political pressure to appear to be doing the right thing. He will from time to time phone you and demand certain changes to your prison, in the public interest. The demand is always temporary - after a few days, things return to normal. However Failure to comply will result in a heavy fine.\n\nTV Removal\nDue to public pressure, all TVs must be removed\nWeights Removal\nDue to public pressure, all Weights Benches must be removed\nLess Food\nProvide smaller meals with less variety, to try to save on costs\nRemove Visitation\nFor security reasons, all visitation must be halted\nPRISONER DEMANDS\nFrom time to time the prisoners in your facility become so frustrated that they demand changes. It's your choice to comply or not, but the prisoners will not be happy if you refuse.\n\nLess Work\nPrisoners wish to work for less hours during the day\nMore Sleep\nPrisoners want longer to sleep at night\nMore Free Time\nPrisoners want more free time during the day\nLogs will now be automatically exported, unless EITHER\nYou have at least one carpenters table\nOR You have a running carpentry program Nb. This obviously requires an Exports zone near the road.\nThe CEO's letter is now made of a graphic and a (localisable) string in the language file. This should make it much easier to translate into multiple languages.\n= Bug Fixes\n0009322: [AI &amp; Behaviour] The mere presence of a shop is stopping prisoners from wanting to do carpentry (Icepick) - resolved.\n0009713: [Other] Crash after Assertion failed : 'index &lt; m_numItems' (John) - resolved. /&gt;\n0009842: [Gameplay] CRASH: The attached savegame crashes within minutes (John) - resolved.\n0009701: [Gameplay] Fatal error with lots of dead bodys stuck. (John) - resolved.\n0009623: [Control &amp; User Interface] Weird Mini-Sectors in doorways (John) - resolved.\n0000515: [Graphics] Garbage bag sprite overlays garbage bin sprite (lim_ak) - resolved.\n0009806: [Mod System] Lua scripting: .GetNearbyObjects() range values are strings, not numbers (elDiablo) - resolved.\n0009716: [Mod System] Lua scripting: this.SubType is always type string, even if I specifically set it to a number (elDiablo) - resolved.\n0009499: [Graphics] Phone taps and Filling Cabinets bug (lim_ak) - resolved.\n0009559: [Graphics] Layering (z-index) issue with outdoor lights and trees (lim_ak) - resolved.\n0009543: [Graphics] Layering (z-index) issue with door control and filing cabinet against wall (lim_ak) - resolved.\n0009588: [Graphics] Layering (z-index): light vs. sprinkler flickering (lim_ak) - resolved.\n0009589: [Graphics] Layering (z-index): light vs. cctv camera (lim_ak) - resolved.\n0009709: [Graphics] Layering (z-index) issue: lights vs. road gate pillar (lim_ak) - resolved.\n0009647: [Save &amp; Load] Save crash! (John) - resolved.\n0009715: [Mod System] Lua scripting: this.SubType is -1 if accessed during Create() function (elDiablo) - resolved.\n0009585: [Other] Assertion failed : 'm_cellCache.ValidIndex( newCachedIndex )' (John) - resolved.\n0006776: [Save &amp; Load] Fatal error during load save file. (John) - resolved","torrent":{"xt":"urn:btih:2652bbd76781f301e433713deb861617060f89aa","amp;dn":"Prison+Architect+Alpha+36","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2652bbd76781f301e433713deb861617060f89aa","infoHashBuffer":{"type":"Buffer","data":[38,82,187,215,103,129,243,1,228,51,113,61,235,134,22,23,6,15,137,170]},"announce":[],"urlList":[]}}