{"title":"Dark Skies Invasion (2015) S04E01 Special Edition","uid":11942809,"size":1395816875,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2ade97e490669dcf3e6e3d27fec8b4459b5b57de&amp;dn=Dark+Skies+Invasion+%282015%29+S04E01+Special+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MovieMash","files":39,"time":1432005466,"description":"[b]TV : Sci-Fi : HD : English\nFAN EDIT - MASHUP - CROSSOVER\nSPECIAL EDITIONS VERSION 2.0 (New INTROs, New Credits, Higher Bitrates)\n\nSeason 4\nEpisode 1\nI did a mega mashup battle including some of the biggest action movies and combined them into a unique crossover called &quot;[b]INTO A MIRROR DARKLY&quot;\nIt is 58mins long and stars Rambo first blood and Aliens and the Predator movies. Follow John Rambo on the run from the police as he encounters whats waiting for him in the mountains. I'd say this is one fun mashup film that continues my series from before but manages to be a stand alone film.\nIt is in 720p Stereo with including credits and intros and added music. Flows really nicely to see Rambo battle it out with Scifis most feared enemies.\nGood editing and clean audio. I would say worth a download [/b]\n\nIf you missed out on the rest of my series hopefully you find time to\ndownload the daily episodes to catch up on this Mini series mashup.\n\n[size=200]Mr. MovieMashup Presents\nDark Skies Invasion: Battle for Earth (2015) TV movie mini series\nthat are also standalone fan edit films[/size]\nSeasons 1-6 Completed\nA 21 Part Mini Series Saga with all self contained themes and that are also standalone fan films on its own.\n\n[b]**1280x544 Resolution** 720p HD Quality\n**Dolby Pro Logic Stereo*\n\nSeries OUTLINE:[/b]\nSelf contained fan edit films that has a slight hint of a continual storyline that connects each episode, but each Episode is considered a separate fan film set in the same universe. It is a soap opera drama of movies connecting into a bigger storyline or self contained watchable fan edit films. The concept surrounds the Silence Aliens from Doctor Who who try to invade our history through any means possible be it Alien abductions, Alien take overs, spiritual possession, or Alien zombie parasites. As the series continues each episode brings us closer to the silence, but every episode always remains as a self contained fan film.\n\nSynopsis OUTLINE:\nHUMANITIES FINAL BATTLE AGAINST THE SILENCE.\n\nThis series in a sense is a sequel to the hit 1996 series called &quot;Dark Skies&quot; on NBC which inspired this project to begin with.\nDark Skies TV show was a weekly TV show based around historical events that had a Alien Twist intertwined into history.\nMy series is kinda similar to this concept: Example: Apollo 11 they find Aliens on the moon&quot;\n\nEventually the story in later episodes stray away from Dark skies, but I tried to keep this crossover to historical events and time periods. Series starts in the ancient past and works it way up to our current future and beyond.\n----------------------------------------------------------\nThe full length feature will be released soon as a 5 hour movie but for now enjoy how this plays out","torrent":{"xt":"urn:btih:2ade97e490669dcf3e6e3d27fec8b4459b5b57de","amp;dn":"Dark+Skies+Invasion+%282015%29+S04E01+Special+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ade97e490669dcf3e6e3d27fec8b4459b5b57de","infoHashBuffer":{"type":"Buffer","data":[42,222,151,228,144,102,157,207,62,110,61,39,254,200,180,69,155,91,87,222]},"announce":[],"urlList":[]}}