{"title":"MomsTeachSex - India Summer, Janice Griffith (Make It Sexy) NEW ","uid":10815370,"size":371302391,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:2c17d87f313bfa5ae15254e6f9afb46c6e700436&amp;dn=MomsTeachSex+-+India+Summer%2C+Janice+Griffith+%28Make+It+Sexy%29+NEW+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1408456740,"description":"As Janice Griffith takes a walk with her step mom India Summer they come across their neighbor Logan who has definitely caught Janice's eye. Like a wonderful stepmom, India offers to make sure that Janice and Logan get together by enticing him over to shoot a fitness video.\nThe girls warm up before Logan arrives, and when he shows up he cautiously agrees to shoot a sexy workout video. After a set of reps, India pulls Janice's shirt up to rub her perky little boobs and pinch her rock hard nipples. Janice's shirt is soon just a memory, as are her shorts.\nIndia loses her clothes next and proceeds to demonstrate her exercises with her landing strip twat fully open to the camera. She entices Logan closer so that Janice can play with his rock hard erection, and as soon as they pull his hard cock from his shorts the real fun can start.\nJanice kicks things off with an enthusiastic blowjob where she even shows off her deep throating skills. India joins in, leaving Janice free to take Logan's balls in her mouth to lick and to suck. As they continue to play, India teaches Janice how to use plenty of spit to make sure her blowjobs are always wet and wild.\nNext India sets up the exercise ball and instructs Janice to lay down on it so that Logan can press his erection deep into her landing strip twat and go to town delivering a proper pussy pounding. With India's help, Logan drives Janice to her first climax of the day although they all know it won't be her last.\nNow it's India's turn for some pleasure, so she climbs on top of Janice to create a pussy double stack that is straight out of Logan's dreams. Whichever snatch he isn't fucking, Logan pleasures with his tongue and fingers until the music of both girls' moans fills the air.\nNext Janice and India lay Logan down on the yoga mat so that India can mount his erection and ride him deep in her creamy fuck hole. Janice gets her ride next while Logan sits on the exercise ball to give added bounce to their lovemaking as wave after wave of pleasure courses through her.\nIndia decides to take a ride on Logan as he stays on the ball, enjoying her virile stud while Janice watches and brings herself to yet another climax with her talented fingers. Moments later, Janice rests her back against the exercise ball with her mouth open in anticipation while India works Logan to his ultimate ecstasy so that he releases his hot sticky load all over her face and then kisses India to share her prize.\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=35575326935892588945.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=35575326935892588945.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=52358335053911021400.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=52358335053911021400.jpg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:2c17d87f313bfa5ae15254e6f9afb46c6e700436","amp;dn":"MomsTeachSex+-+India+Summer%2C+Janice+Griffith+%28Make+It+Sexy%29+NEW+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c17d87f313bfa5ae15254e6f9afb46c6e700436","infoHashBuffer":{"type":"Buffer","data":[44,23,216,127,49,59,250,90,225,82,84,230,249,175,180,108,110,112,4,54]},"announce":[],"urlList":[]}}