{"title":"Prison Bad Girls (Penthouse) XXX WEB-DL (Split Scenes)","uid":10731972,"size":1871736878,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:301e7206db7dca448b0095b53b1d461f4af9f882&amp;dn=Prison+Bad+Girls+%28Penthouse%29+XXX+WEB-DL+%28Split+Scenes%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":null,"files":7,"time":1407638062,"description":"Year : 2013\n\nCountry : USA\n\nGenre : Lesbians, Toys, Big Tits, Natural Breast, Hairy Pussy, Shaved Pussy, Prison, Comedy, Feature, Latina, Asian, Tatoo\n\nDuration : 00: 22: 08 + 00: 24: 02 + 00 20 40 + 00: 25: 09 + 00: 20: 50 + 00: 22: 58\n\nLanguage : English\n\nStudio : Penthouse\n\nStarring : Andy San Dimas, Aiden Ashley, Nika Noire, Juelz Ventura, Kristina Rose, Daisy Cruz, Allie Haze, Katie Jordin, Misty Dawn, Lexi Belle, Ariella Ferrera, Sea J Raw\n\nDescription : Prison Bad Girls. Episode 1. Why Me? (Andy San Dimas, Aiden Ashley) Guard Dickinski laments over the abuse he has to endure from the Female inmates at work. They love to taunt HIM and he has few options When it comes to keeping in line Them. Then again, They are Pretty good at occupying Their time without the guard's intervention. Prison Bad Girls. Episode 2. Drop The Soap (Nika Noire, Juelz Ventura) The Girls are bad prison guard Dickinski Giving A hard time as Usual. It's shower time and he Knows the deal - all sex and No shower for the horny Girls of the Cellblock. He leaves Them to Their Business and goes on His Rounds. Perhaps he'll Give Them A little Extra time Today. Prison Bad Girls. Episode 3. Peeling Of A Different Kind (Kristina Rose, Daisy Cruz) Daisy and Kristina are on kitchen Detail as punishment. Peeling potatoes is far from the worst assignment They Could Get, But They'd much rather be off Peeling Those awful orange jumpsuits. Suddenly the guard is off doing Rounds and it's time for These Girls to Get off as well. Prison Bad Girls. Episode 4. Picture Book (Allie Haze, Katie Jordin) The Warden agrees to meet with inmates Allie and Katie to Discuss A Possible transfer.\n\nScreens:\n &lt;a href=&quot;\nhttp://imgfun.biz/img-53e6bdda87e27.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgfun.biz/img-53e6bdda87e27.html&lt;/a&gt;","torrent":{"xt":"urn:btih:301e7206db7dca448b0095b53b1d461f4af9f882","amp;dn":"Prison+Bad+Girls+%28Penthouse%29+XXX+WEB-DL+%28Split+Scenes%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"301e7206db7dca448b0095b53b1d461f4af9f882","infoHashBuffer":{"type":"Buffer","data":[48,30,114,6,219,125,202,68,139,0,149,181,59,29,70,31,74,249,248,130]},"announce":[],"urlList":[]}}