{"title":"Heat Transfers and Related Effects in Supercritical Fluids 2015","uid":12007388,"size":18735352,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:33dc0cf5cdcb4f1899d4541e065cd40d98b72982&amp;dn=Heat+Transfers+and+Related+Effects+in+Supercritical+Fluids+2015&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1433951579,"description":"ISBN 9789401791861\n\nThis book investigates the unique hydrodynamics and heat transfer problems that are encountered in the vicinity of the critical point of fluids. Emphasis is given on weightlessness conditions, gravity effects and thermovibrational phenomena. Near their critical point, fluids indeed obey universal behavior and become very compressible and expandable. Their comportment, when gravity effects are suppressed, becomes quite unusual.\n\nThe problems that are treated in this book are of interest to students and researchers interested in the original behavior of near-critical fluids as well as to engineers that have to manage supercritical fluids. A special chapter is dedicated to the present knowledge of critical point phenomena. Specific data for many fluids are provided, ranging from cryogenics (hydrogen) to high temperature (water). Basic information in statistical mechanics, mathematics and measurement techniques is also included. The basic concepts of fluid mechanics are given for the non-specialists to be able to read the parts he is interested in. Asymptotic theory of heat transfer by thermoacoustic processes is provided with enough details for PhD students or researchers and engineers to begin in the field. Key spaces are described in details, with many comparisons between theory and experiments to illustrate the topics","torrent":{"xt":"urn:btih:33dc0cf5cdcb4f1899d4541e065cd40d98b72982","amp;dn":"Heat+Transfers+and+Related+Effects+in+Supercritical+Fluids+2015","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33dc0cf5cdcb4f1899d4541e065cd40d98b72982","infoHashBuffer":{"type":"Buffer","data":[51,220,12,245,205,203,79,24,153,212,84,30,6,92,212,13,152,183,41,130]},"announce":[],"urlList":[]}}