{"title":"Confessions, Romances, Secrets, and Tempations, Archer St John","uid":11846426,"size":64435904,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:35116751c94c93dce1d4ce409607fb83f53acec8&amp;dn=Confessions%2C+Romances%2C+Secrets%2C+and+Tempations%2C+Archer+St+John&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LeonardTSpock","files":1,"time":1429958204,"description":"Confessions, Romances, Secrets, and Tempations - Archer St. John and the St. John Romance Comics\n\nFantagraphics, 2007, 115 pages\n\nA tour through the best of the romance genre of comics in the 1950s.\n\nConfessions, Romances, Secrets, and Temptations is the companion volume to John Benson's popular anthology of romance comics, Romance Without Tears. Published in the 1950s by Archer St. John, the stories in that volume were decidedly different from the typical romance comics, just as St. John was decidedly different from the typical comics publisher. This new book explores the background of these comics and their publisher, including a short biography, interviews with the editors and artists who worked for the company, and critical commentary.\n\nIn his research for Romance Without Tears, the author was left with a rich body of material about one of the few quality-driven 1950s comics publishers. St. John's reputation as a fair and honest publisher attracted many of the top artists of the day, including Matt Baker, Ric Estrada, Everett Raymond Kinstler, Joe Kubert, Bob Powell, Leonard Starr, and George Tuska. In addition to interviewing Estrada, Kubert, and Starr, Benson talks with several St. John staffers, including editor Irwin Stein, production man Warren Kremer, and editorial assistant Nadine King. Together they provide an engaging account of Archer St. John and the atmosphere he nourished to create these distinctive comics.\n\nConfessions contains a time chart of every title published by St. John (all genres), showing issue number and date, and a complete, detailed checklist of all the company's romance comics, giving story titles, artist credits, and cross-indexing the extensive reprints. The book is lavishly illustrated with examples of the comics, and includes rare photos and other visuals from the period.\n\nShould you ever feel like buying one of Fantagraphics super awesome books (and almost all of them are, imo), please visit their website http://www.fantagraphics.com/ (the 20/20 Club is a great deal), or ask your LCS guy to point you in the right direction (or get on the ball and order some stuff!)","torrent":{"xt":"urn:btih:35116751c94c93dce1d4ce409607fb83f53acec8","amp;dn":"Confessions%2C+Romances%2C+Secrets%2C+and+Tempations%2C+Archer+St+John","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35116751c94c93dce1d4ce409607fb83f53acec8","infoHashBuffer":{"type":"Buffer","data":[53,17,103,81,201,76,147,220,225,212,206,64,150,7,251,131,245,58,206,200]},"announce":[],"urlList":[]}}