{"title":"Theory Of A Deadman-FLAC-EAC-CUE","uid":12115428,"size":366934181,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3648a3f3b5185e71146b76505680453fa9c96751&amp;dn=Theory+Of+A+Deadman-FLAC-EAC-CUE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"z_DeadKings_z","files":14,"time":1436678874,"description":"A re-up of a torrent I had U/L'd a few years ago. I deleted the original but saw a few leechers looking to get it so I have decided to re-upload it again.\n\nTheory Of A DeadMan - Scars And Souvenirs\n\nSource - Retail CD\n\nRipper - EAC\n\nCompression - FLAC (via FlacFrontend)\n\nCUE - EAC Multiple Waves Non-Compliant with gaps. (use EAC or Imageburn to load cue and burn after decompressing FLAC files back to waves)\n\nTrack List\n\n1.  So Happy\n2.  By The Way\n3.  Got It Made\n4.  Not Meant To Be\n5.  Crutch\n6.  All or Nothing\n7.  Heaven (Little By Little)\n8.  Bad Girlfriend\n9.  Hate My Life\n10. Little Smirk\n11. End Of The Summer\n12. Wait For Me\n13. Sacrifice\n\nScars and Souvenirs is the third album by Canadian rock  band Theory of a Deadman, and was released on April 1, 2008. It has so far been the band's most successful album to date and has spawned many hit singles. The title of the album comes from a line in the song &quot;By the Way&quot;. The title refers to the &quot;scars and souvenirs,&quot; or the ups and downs of one's lifetime, as a large majority of the songs on the album deal with things like relationships and obstacles that one might encounter during his or her life. Robin Diaz (Closure; Trapt), Chris Daughtry (Daughtry), and Brent Smith (Shinedown) are guest stars on the album. The album debuted at Number 10 on Billboard Top Rock Albums, Number 8 on Billboard Top Modern Rock/Alternative Albums, Number 1 on Billboard Top Hard Rock albums, and Number 26 on the Billboard 200. The album has so far been more successful than the band's previous albums due to the popularity of some of its singles, including &quot;Bad Girlfriend&quot;, &quot;Hate My Life&quot;, &quot;Not Meant to Be&quot;, and All or Nothing. On April 9, 2009, Scars and Souvenirs was certified Gold by the RIAA with sales reaching 500,000 copies in the U.S. alone and on May 2009, it was certified Platinum by the CRIA.\n\n\n1 for the peeps that think MP3's are for previewing music but want the original (non-compressed) for listening on their high end systems. In other words peeps such as myself ;).\n\n                                              Play it Loud!\n\n                                                      Enjoy.\n\n                                                         Peace Out","torrent":{"xt":"urn:btih:3648a3f3b5185e71146b76505680453fa9c96751","amp;dn":"Theory+Of+A+Deadman-FLAC-EAC-CUE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3648a3f3b5185e71146b76505680453fa9c96751","infoHashBuffer":{"type":"Buffer","data":[54,72,163,243,181,24,94,113,20,107,118,80,86,128,69,63,169,201,103,81]},"announce":[],"urlList":[]}}