{"title":"Heather Hunted (1990) XXX Classic DVDRip","uid":11826239,"size":1150068024,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:3702e1717a0254f017c3fa49b6b814ae21d5b5ff&amp;dn=Heather+Hunted+%281990%29+XXX+Classic+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"B01010000","files":2,"time":1429506218,"description":"        ...::TORRENT NAME::...\nHeather Hunted (1990) XXX Classic DVDRip\n\n         ...::POSTER::... &lt;a href=&quot;\nhttp://adsreserve.com/?v=v8sp.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://adsreserve.com/?v=v8sp.jpg&lt;/a&gt;\n\n       ...::SCREENSHOTS::... &lt;a href=&quot;\nhttp://adsreserve.com/?v=Tp5SX.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://adsreserve.com/?v=Tp5SX.jpg&lt;/a&gt;\n\n        ...::DESCRIPTION::...\nFrom the original boxcover:\n\nA decent good guy, bad guy / cops and robbers yam with Heather Hunter coming across as extremely likeable and vulnerable, Heather Hunted features hot sex scenes and relatively new faces.\n\nWhen Madison arrives at Heather Hunter's stately home to the strains of creepy music, you just know she's trouble. Hunter takes her in as a roomie anyway. It is not long before they're enjoying a girl-girl gnasher on the staircase. Hunter strikes athletic poses and makes her trademark moan music. Madison emerges as a manipulative woman who has the knack of getting what she wants. Her mysterious &quot;friend&quot; Mike Horner suddenly appears asking about some film - evidence in Madison's blackmailing scheme of a senator which eventually lands her in the morgue. Good production all around.\n\nScenes:\n\nScene 1. Heather Hunter, Madison\n\nScene 2. Heather Hunter, Madison, Mike Horner\n\nScene 3. Sunny McKay, Jake Steed\n\nScene 4. Heather Sinclair, Sunny McKay, Lance Heywood\n\nScene 5. Heather Hunter, Jake Steed\n\nScene breakdowns by RAME's Joey Markham:\n\n\nHeather, Madison.  Stairwell.  These two start kissing then Madison goes up\nbehind Heather and reaches in front to unbutton her blouse, eventually\nsqueezing her breasts.  Heather has one of the most enticing natural bodies in\nporn.  Great natural breasts with tiny nipples that look like Hershey's Kisses\nand a very trim figure (some might think anorexic looking but her rib cage\nmanages to be kept tucked away for the most part) give way to making Miss\nHunter one of the sexiest black women in the industry.  (Ok, so it's all a\ncase of different strokes for different folks because I happen to find slim\nbodies with rib cages that aren't prominent to be extremely alluring).\nMadison's also cute here, pre-tongue and neck piercings (just a nose stud).\nShe doesn't have that usual goth look because her hair's curled and styled.\nAs for her boobs, they are medium sized but most likely a first set of\nimplants installed (not the huge balloons she opted for a year or two later).\nThey look a little too firm and from some angles you can tell they have that\npouchy look to them.  Anyhow, this scene is sensual at most.  There's brief\nfinger probing that doesn't get nasty and each girl brings the other to\norgasm, without loud fake moans.  They look sexy when they assume positions\nagainst the handrail (bringing a leg up and placing a [heeled] foot on it)\nbut there are some distracting shadows due to poor lighting","torrent":{"xt":"urn:btih:3702e1717a0254f017c3fa49b6b814ae21d5b5ff","amp;dn":"Heather+Hunted+%281990%29+XXX+Classic+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3702e1717a0254f017c3fa49b6b814ae21d5b5ff","infoHashBuffer":{"type":"Buffer","data":[55,2,225,113,122,2,84,240,23,195,250,73,182,184,20,174,33,213,181,255]},"announce":[],"urlList":[]}}