{"title":"Android Pack 16.08.14","uid":10824595,"size":1515946898,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:37a823c9476c3692e13309cfced55f7a522ccd5e&amp;dn=Android+Pack+16.08.14&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dougstamper","files":-1,"time":1408569798,"description":"List\n\nCamCard\nVersion: 5.3.0.20140813(updated)\nRequired: Android 2.0 and up\n\nCamCard, read your card, mind your business.\n\nCamCard reads business cards and save instantly to phone Contacts. It syncs all your cards across smartphones, tablets, computers and the web app.\nBrand new AR Card feature allows you to better demonstrate yourself, your products and company by adding various contents in text, graphic, video, audio or file formats. It keeps you posted with the latest updates of your partners and help you attract more business opportunities.\n\n*******************************************************************************\n\nPlex(updated)\nVersion: 3.4.10.181\nRequired: Android 1.6 and up\n\nYour media has never looked this good! Welcome to Plex!\nPlex in a nutshell is a media platform that runs on Macs, PCs and Linux that is capable of organizing your media so that it can be viewed by any Plex Client in a beautiful to see and easily navigable form. In addition to allowing you to view all of your music, photos and videos it allows you to get to online content from many of your favorite online providers from the comfort of your couch using just a remote control - no need to type all that &quot;www&quot; mumbo-jumbo...\n\n*******************************************************************************\n\nAdvanced Download Manager Pro (updated)\nVersion: 3.6.1\nRequired: Android 2.1 and up\n\n- parallel downloading three files simultaneously;\n- accelerated download by using multithreading (8 parts);\n- a widget on a home screen and a window over all windows with the list of running downloadings;\n- downloading using only the Wi-Fi and start/stop at on/off the Wi-Fi;\n- autoload of service of the program after the boot is completed\n\n*******************************************************************************\n\nMoon+ Reader Pro\nVersion: 2.6.1\nRequired: Android 2.2 and up\n\nYour finger ebook reader with fantastic reading experience. Professional book reader with powerful controls &amp; full functions.\n*Support online ebook libraries and personal calibre ebook server.\n*Read local books with smooth scroll and tons of innovation.\nSupport txt, html, epub, pdf, umd, fb2, chm, zip or OPDS,\n\n*******************************************************************************\n\nMinimalistic Text Widgets (pro)\nVersion: 3.5\nRequired: Android 2.1 and up\n\nMinimalistic Text is a widget app that displays information in a minimalistic way.\nIt can be configured to display time, date, battery and weather information. The layout of the widget is highly customizable through the layout editor.\n\nMinimalistic Text is heavily inspired by BattStat and Clockr but adds extreme flexibility.\n\n*******************************************************************************\n\nBackCountry Navigator TOPO GPS\nVersion: 5.4.5\nRequired: Android 2.1 and up\n\nPlay in the outdoors with GPS and offline topo maps! Use your phone or tablet as an offroad topo mapping GPS with the bestselling outdoor navigation app for Android! Explore beyond cell coverage for hiking, hunting and more.\n\nDownload topo maps for the US and some other countries in advance, so you won't need cell coverage when navigating.\nThis uses many publicly available map sources as free downloads\n\n*******************************************************************************\n\nFRONTLINE COMMANDO D-DAY for Android[Unlimited Money]\nVersion: 3.0.4[Unlimited Money]\nRequired: Android 2.1 and up\n\nHigh-end, immersive tablet gameplay!\n\nLead the charge on D-Day as the tip of the spear in the largest Allied invasion of WW2! Defeat the occupation forces and take back France; storm the beaches, clear the trenches and liberate towns as you battle through the countryside of Normandy.\n\n*******************************************************************************\n\nX Construction\nVersion: 1.55\nRequired: Android 2.1 and up\n\nBuild a bridge with the given amount of materials to let the train safely cross the valley.\nThe paid version has the following advantages:\n? no ads\n? free build mode\n? more levels (currently 26)\n? online highscore rankings\n\n*******************************************************************************\n\nPho.to Lab PRO\nVersion: 2.0.152\nRequired: Android 2.1 and up\n\nPhoto Fun Generator - create awesome effects and caricatures from your photos!\n\nPho.to Lab PRO - full-featured Photo Fun Generator in your pocket!\nWelcome the PRO version of Pho.to Lab app with almost unlimited abilities to create awesome effects from your photos!\n\n*******************************************************************************\n\nBattery Booster (Full)\nVersion: 7.2.3.4\nRequired: Android 2.1 and up\n\nBattery Booster - Boost Your Battery's Running Time and Max Battery Life! Battery Booster is an all-in-one battery boosting and power management tool for both Android smartphone and tablet. It provides the most accurate battery information, keeps track of the recent battery changes, monitors battery-draining processes, and helps you deal with various battery wasting situations at ease.\n\n*******************************************************************************\n\nJoe Dever's Lone Wolf(updated)\nVersion: 3.0.3\nRequired: Android 3.0 and up\n\nACT I - Blood On The Snow\nLone Wolf is back, as a video game and with a brand-new story, a new combat system, stunning graphics and much more!\n\nThe world-famous author Joe Dever has teamed up with Forge Reply and Atlantyca Entertainment to create a new adventure starring the legendary Kai Lord: a new gamebook experience for long-time enthusiasts and new fans alike.\nInstall APK\nCopy 'com.bulkypix.lonewolf' folder to 'sdcard/Android/Obb/'\nLaunch the game\n\n*******************************************************************************\n\n1Tap Cleaner Pro(updated)\n1-Tap to clean all cache, search histories and calls log. A default cleaner is also included.\n\nAre you running out of application storage?\nYou now can get more available storage space by clearing apps created cache/data files.\nAnd allot more!\n\n*******************************************************************************\n\nETERNITY WARRIORS 2\nVersion: 4.3.1[Unlimited Money]\nRequired: Android 2.1 and up\n\nYou've been tasked with defeating an even deadlier demon army than before...\nThe battle for Northern Udar rages on! It's been 100 years since the First Demon War tore the land apart. Thanks to the Eternity Warriors the demon threat was held at bay. However the demons have been consolidating their power in a series of Demon Towers built in locations throughout Northern Udar.\n\nhow to get coins\ncopy TitaniumBackup files to SDcard/TitaniumBackup\nInstall apk (must not run)\nOpen Titanium Backup ==&gt;Backup/Restore ==&gt;find game ==&gt;restore data\n\n*******************************************************************************\n\nReactable mobile\nVersion: 2.3.9\nRequired: Android 2.2 and up\n\nThe Reactable instrument now in your pocket! Create and improvise music in an intuitive and visual way. This app brings the full creative power of the internationally awarded interactive Reactable instrument used by renowned musicians like Bjork to your mobile device.\n\nAll Reactable mobile users get access to exclusive content.\n\n*******************************************************************************\n\nSnap Camera HDR\nVersion: 4.6.2\nRequired: Android 2.3.3 and up\n\nThe best possible camera experience with regular updates and new features added all the time.\n\nSnap Camera lets you take pictures and record video with a single click, no cluttered preview screen, just the two buttons you really need.\n\n*******************************************************************************\n\nLight Apprentice\nVersion: 1.0\nRequired: Android 2.3 and up\n\nWhen life in the world of Ethenia is threatened by the corruption of the Yhrosian Empire, a hero will rise to protect the Planet and its people.\nRISE OF A HERO\nMeet Nate, the Light Apprentice, and take part in his journey through a kind of &quot;Comic GameBook&quot; like you've never experienced before!\nAfter 300 years in a deep sleep, Nate wakes up to a world ravaged by war. The Planet's environment is damaged and on the course to destruction.\nOnly Nate and the 4 other last remaining Apprentices may have the key to restore balance to the Planet's environment, thus saving the world.\nYOUR GAME, YOUR CHOICES\nIn Light Apprentice, comic book and game are integrated in a brand new way.\nYour decisions and actions will determine what kind of characters Nate and his friends will become.\nGet collectibles and extras, customize and evolve your characters, fight or befriend monsters, and decide how Nate's story unfolds.\nAN EPIC SAGA IS COMING\nLight Apprentice is the first of 4 upcoming chapters that make the book.\n\nInstall APK\nCopy 'com.bulkypix.lightapprentice' folder to 'sdcard/Android/Obb/'\nLaunch the game\n\n\n\n\n\nBy Doug Stamper ","torrent":{"xt":"urn:btih:37a823c9476c3692e13309cfced55f7a522ccd5e","amp;dn":"Android+Pack+16.08.14","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37a823c9476c3692e13309cfced55f7a522ccd5e","infoHashBuffer":{"type":"Buffer","data":[55,168,35,201,71,108,54,146,225,51,9,207,206,213,95,122,82,44,205,94]},"announce":[],"urlList":[]}}