{"title":"PetiteHDPorn - Dakota Skye, Marry Lynn NEW 12 June 2015","uid":12010602,"size":315253772,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:39b909103c45a6542fdf318ae202c3740283f206&amp;dn=PetiteHDPorn+-+Dakota+Skye%2C+Marry+Lynn+NEW+12+June+2015&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"xxxlavalxxx","files":2,"time":1434103612,"description":"Juicy hotties Dakota Skye and Marry Lynn can't keep their hands and lips off of each other's stunning bodies! The girls aren't shy about peeling off each other's bras and underwear, and then Marry lays Dakota down on the tub so that she can help the blonde shave her pussy. Once Dakota has checked Marry's snatch and decided that it is nice and smooth, the girls take their smooth selves into the bedroom to greet Ryan McLane with a morning surprise.Pulling off Ryan's briefs, Dakota and Marry take turns worshipping his hard cock with their mouths. Then Marry climbs aboard for a stiffie ride in her slick snatch while Dakota gets her freshly-shaved fuck hole licked! When Marry is twitching and writhing with the force of her climax, Dakota gets on her hands and knees and offers her snatch to be fucked doggy style, which leaves her mouth free to eat Marry out.Soon Dakota is also moaning her orgasmic ecstasy. Now the girls are on a joint mission to help Ryan finish, so Marry climbs onto Dakota to present him with a double stack of pussies that he can fuck. He goes to town, pumping his hips until he's on the cusp of climax. Only then does he pull out so he can cover Marry's pussy and Dakota's mound in his hot sticky love.\nCategories:Small Boobs Puffy Nipples Shaved Pussy Short Girls Brunette Blonde Short hair Long hair Bras Panties Hardcore Lesbian Tan Thongs Petite Girl-Girl-Boy Blowjob Super Skinny Deep Throat Girls Finishing the Job Pussy Licking\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=46555638521335127260.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=46555638521335127260.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=71802229932728504760.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=71802229932728504760.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:39b909103c45a6542fdf318ae202c3740283f206","amp;dn":"PetiteHDPorn+-+Dakota+Skye%2C+Marry+Lynn+NEW+12+June+2015","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39b909103c45a6542fdf318ae202c3740283f206","infoHashBuffer":{"type":"Buffer","data":[57,185,9,16,60,69,166,84,47,223,49,138,226,2,195,116,2,131,242,6]},"announce":[],"urlList":[]}}