{"title":"Acme Bar Gig - Headcase -  Studio Devil","uid":10858819,"size":338648952,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3b3b8edafca271ac29d7c4d74f5b0ca4c0da1bab&amp;dn=Acme+Bar+Gig+-+Headcase+-++Studio+Devil&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"uraniumwilly","files":1,"time":1408870721,"description":"I tried to put together all the plugins I have that are related to Acme Bar Gig. Some of these are hard to get in one single torrent if you have not noticed so I put all I had into one. Headcase was hard to find online and I had to use a spooky Russian BT site to get it. It is out there if you're willing to dig, but Headcase is here now with all the other famous Acme Bar Gig plugins, including Shred and Dig. here is a basic run down of the folders:  \n\n20 Plugins\nAmp Simulations\nDIG\nHeadcase\niFace\nOther Plugins\nRed Shift\nShred\n\nAlso included in this package is the sometimes lesser known guitar plugin Studio Devil. There are a couple guitar VST collection out there lacking this one. It is a powerful amp with cool presets and also included is the Studio Devil bass amp which I have yet to play with. \n\nIf you are a guitarist and use plugins then you know Guitar Rig and Amplitube are more than suited for the job most of the time, but sometimes they just don't have that gritty, really vintage garage sound you might want at times. They try but it still comes off too polished. And that is where these guys come in. \n\nThe only issue seemed to be when installing Headcase I got a malware warning that AVAST would not let me ignore. I installed the rest of the plugin and it ran fine. I later reinstalled Headcase with AVAST disabled and there seemed to be no issues with malware when I ran a scan later. AVAST is very paranoid and you may or may not get the same warning, but I think it is safe to ignore it.  \n\nThe plugins are all 32 bit. \n\n\nAs usual I will let this seed until there a number of good seeders then I will have to let it go due to my connection issues from living inside China. Enjoy.\n\nUranium Willy\n","torrent":{"xt":"urn:btih:3b3b8edafca271ac29d7c4d74f5b0ca4c0da1bab","amp;dn":"Acme+Bar+Gig+-+Headcase+-++Studio+Devil","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b3b8edafca271ac29d7c4d74f5b0ca4c0da1bab","infoHashBuffer":{"type":"Buffer","data":[59,59,142,218,252,162,113,172,41,215,196,215,79,91,12,164,192,218,27,171]},"announce":[],"urlList":[]}}