{"title":"Structured Catalysts and Reactors 2nd ed","uid":12085964,"size":23371668,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3efca60b42f35a778126190f46700da49d8fe1b9&amp;dn=Structured+Catalysts+and+Reactors+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1435910580,"description":"Structured Catalysts and Reactors 2nd ed (Chemical Industries Volume 110) - Andrzej Cybulski and Jacob A. Moulijn (CRC, 2006).pdf\n\nISBN 978-0-8247-2343-9\n\nInterest in structured catalysts is steadily increasing due to the already proven, as well as potential, advantages of these catalysts. Updating the comprehensive coverage of the first edition published in 1998 with the latest science and applications, Structured Catalysts and Reactors, Second Edition gives detailed information on all aspects of structured catalysts and reactors, including: materials, mass transfer, selectivity, activity, and stability; catalyst preparation, design, and characterization; process development; modeling and optimization; reactor design; and operation costs and considerations. The book first examines how monolithic catalysts are used to clean exhaust gas from gasoline engines, treat industrial off-gases, burn fuels in commercial settings, and synthesize chemicals in two- and three-phase processes. It discusses configurations, microstructure, physical properties, and manufacture of ceramic and metallic monoliths before directing its focus to arranged catalysts and structured packings in terms of mass transfer. The book then explores catalytically active membranes and filters, featuring metallic membranes, permeation mechanisms, preparation and modeling, commercial membranes, and the latest applications, such as zeolitic membranes. Finally, several chapters present techniques for incorporating catalytic species into the structured catalyst support and controlling catalyst nanoporosity.\n\nThis book conveys the scientific as well as economic advantages of using these unconventional catalytic techniques. With over 1500 references, tables, drawings, and photographs, as well as in-depth discussions and a new approach to catalytic processes, Structured Catalysts and Reactors, Second Edition is an essential reference for anyone working with or studying catalysis","torrent":{"xt":"urn:btih:3efca60b42f35a778126190f46700da49d8fe1b9","amp;dn":"Structured+Catalysts+and+Reactors+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3efca60b42f35a778126190f46700da49d8fe1b9","infoHashBuffer":{"type":"Buffer","data":[62,252,166,11,66,243,90,119,129,38,25,15,70,112,13,164,157,143,225,185]},"announce":[],"urlList":[]}}