{"title":"WWE Hulk Hogan's Rock n Wrestling S01E04-S01E07 720p AVCHD-SC-SD","uid":12052960,"size":1933188309,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:3f80db0a93b9ff9e3a7acf910196f968e9d4d17e&amp;dn=WWE+Hulk+Hogan%27s+Rock+n+Wrestling+S01E04-S01E07+720p+AVCHD-SC-SD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SCSA420","files":7,"time":1435058138,"description":"StoneCold420 presents another High Quality 720p H264 release for the wrestling fans around the world here exclusively on KickAss Torrents and ThePirateBay!!!\n\n\n\nWWE Hulk Hogan's Rock n Wrestling S01E04-S01E07 720p AVCHD-SC-SDH\n\n\n\nWWE Hulk Hogan's Rock n Wrestling \nS01E04-S01E05-S01E06-S01E07\nAndre's Giant Problem Episode 04 \nOriginal broadcast date 09-21-1985\nClean Gene Episode 05\nOriginal broadcast date 09-21-1985\nDriving me Crazy Episode 06\nOriginal broadcast date 09-28-1985\nGorilla My Dreams Episode 07\nOriginal broadcast date 09-28-1985\nWWE Network Broadcast date June 22, 2015\n\n\n\nOn Episode 04 of Hulk Hogan's Rock 'n' Wrestling, Andre the Giant pretends to work at a French bakery to impress his mama on this episode of Hulk Hogan's Rock 'n' Wrestling!\n\nOn Episode 05 of Hulk Hogan's Rock 'n' Wrestling, Hulk and his friends look to do some housekeeping for their pal, Mean Gene.\n\nOn Episode 06 of Hulk Hogan's Rock 'n' Wrestling, The Iron Sheik learns there are no short cuts when it comes to road safety after Bobby 'The Brain' Heenan teaches him how to drive.\n\nOn Episode 07 of Hulk Hogan's Rock 'n' Wrestling, Hulk and the gang must prove Andre the Giant's innocence when he is accused of stealing at a costume party.\n\n\n\nThis is SDH release #1,811 for the wrestling fans from a wrestling fan. First aired and captured from HDMI in H264 AVCHD at 8,000 kbps from the 16:9 widescreen 1280 x 720p resolution HD source on 06/22/2015 on the WWE Network on PS4. Framerate is 29.970 with an average Video Bitrate of 4,500 kbps in a High Quality 1.79 GB 720p H264 AVCHD MP4 release with 48khz 384 kbps AAC 2 channel stereo audio total show runtime is 52:56 Episode 04 show runtime 8:46. Episode 05 runtime is 12:19 Episode 06 runtime is 10:18 Episode 07 runtime is 21:32\n\n\nThis is my 1,081st official 720p H264 AVCHD-SC-SDH release. Enjoy the show WWE fans. \n\nThis release is in H264 AVCHD MP4 format with AAC 2 channel stereo audio. This release is playable with Sony Playstation 3, Xbox 360, Samsung Galaxy S III smartphones, iPhone, iPad, VLC player as well as Media Player Classic, Windows Media Player, and any other devices capable of playing 720p HD MP4 video files with AAC 2 channel stereo audio.\n\nIf you want this show in MKV format it is easy to convert it from MP4 to MKV using MKVtoolnix 2.2.0(MKVmerge 2.2.0) which you can download from here: http://www.bunkus.org/videot...2/mkvtoolnix-2.2.0-setup.exe\n\nHere's how to do it: Download and install MKVMerge (Use link above). It is a free program that allows you to take video and audio files and convert them into MKV files on the fly, making it a very quick conversion.\n\nOpen MKVMerge on your computer, and you will be greeted by its home menu. Click the &quot;Add&quot; button that is near the top of the program, and a new window will appear giving you access to your computer's files. Locate your MP4 video and select it. Press &quot;Open,&quot; and it will load into MKVMerge.\n\nPress the &quot;Browse&quot; button at the bottom of the program, and a window will appear. Locate a place on your computer to save the new MKV file after it is created. Once you have found a place, click &quot;Save&quot; to save the location. Click the &quot;Start Muxing&quot; button at the bottom of the program and your MKV file will be created. Depending on the size of the file, it could take a few minutes. Once it is finished locate the MKV file after the program congratulates you on the conversion and play it as you would any other video file.\n\nTo ensure that you can get proper playback be sure you have installed the K-lite codec pack full version or mega version both of which comes with Media Player Classic Home Cinema and configure it properly for .mp4 and .mkv playback. If you do not have it you can get it here below: \n &lt;a href=&quot;\nhttp://www.free-codecs.com/download/K_Lite_Codec_Pack.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.free-codecs.com/download/K_Lite_Codec_Pack.htm&lt;/a&gt; \n\nOnce installed you can playback any .mp4 and .mkv files with the following players:\n\nMedia Player Classic or Windows Media Player. \n\nEnjoy the show wrestling fans and thanks for downloading my WWE Hulk Hogan's Rock n Wrestling S01E04-S01E07 720p AVCHD-SC-SDH release. \n\n\nUploaded by SCSA420 on KickAss Torrents and The Pirate Bay\n\n\nStoneCold420 \nSmackDownHotel\nJune 22, 2015\n\n\n@SCSA420 on Twitter\n\n\n\nFor SC-SDH releases find me on KAT at:\nand The Pirate Bay at: https://thepiratebay.se/user/SCSA420\n\n\nPlease check out the WrestleReaction show on http://WrestleReaction.net","torrent":{"xt":"urn:btih:3f80db0a93b9ff9e3a7acf910196f968e9d4d17e","amp;dn":"WWE+Hulk+Hogan%27s+Rock+n+Wrestling+S01E04-S01E07+720p+AVCHD-SC-SD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f80db0a93b9ff9e3a7acf910196f968e9d4d17e","infoHashBuffer":{"type":"Buffer","data":[63,128,219,10,147,185,255,158,58,122,207,145,1,150,249,104,233,212,209,126]},"announce":[],"urlList":[]}}