{"title":"Blood II:The Chosen Nightmare Levels[cd]- MADJACKTHEPISSEDPIRATE","uid":12025268,"size":673171465,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:406860f7f26f3c9bef0c4ef888760012e4b703fd&amp;dn=Blood+II%3AThe+Chosen+Nightmare+Levels%5Bcd%5D-+MADJACKTHEPISSEDPIRATE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MADJACKTHEPISSEDPIRATE","files":4,"time":1434510823,"description":"THIS IS AN OLD 1998 GAME.\n\nPLEASE SEED THIS AT LEAST 1. SHARE SO THE PEEPS WHO WANT THIS CAN GET IT FOR THE FIRST FEW DAYS AT LEAST. WIITHOUT A LONG WAIT BY MY 100KBPS UPLOAD RATE. THANK YOU FOR YOUR HELP, I APPRECIATE IT. you dont have to seed it all in one squirt...i can only seed 8 hrs max a day cause im not a network genius and my vpn kicks out yada yada. dont wanna get busted of course.[i fouled something up in network connections with an online guide and i cant figure it out...duh] least i got ivp 6 disaabled. read they can catch you if its running.\n\nLIKE CYBERMAGE IN 05 I ARCHIVED MY DISKS TO IMAGE FILE USING CLONE CD..SO YOU WILL PROLLY HAVE TO USE THAT TO BURN THE IMAGE TO A CD if power iso or daemon doesnt work  MADJACK IS NOT RESPONSIBLE FOR ANY PROBLEMS YOU MIGHT HAVE WITH THIS TORRENT. lol i just add that for fun..\n\n\n\n\n\nThe Nightmare Levels, released in August 1999, was an expansion pack for Blood II that provided background information on Caleb, Gabriella, Ishmael, and Ophelia, narrated by a deceased Gideon. As the Chosen continue to walk home to their world from the invading reality, they encounter a psychic beast known as the Nightmare that captures Caleb due to the Chosen attracting it by telling scary stories.[11]\n\nThe player then has to relive some of the most horrific moments of the Chosen's lives - Caleb fighting the Cabal in the frozen north (Blood, episode two), the Cabal attack on Ophelia's sorority which led her to join, Ishmael's escape from his life as a circus freak into the Cabal, and Gabriella's spooky night in a haunted mansion.\n\nCaleb pops in at the end of each of the other Chosen's stories, and tries to figure out what is going on. After Gabriella's nightmare, he is transported to a level resembling the old west, which he escapes back out into the otherworld. There he finds the Nightmare, surmises that it is the being responsible for his troubles, and slays it. Gideon finishes with an end narration, foretelling the Chosen's many adventures and conquests ahead of them.\n\nThe Nightmare Levels reintroduced the Robed Cultist enemies from the original game, added the Gremlins enemies and the Nightmare boss, CabalCo cultists re-skinned as killer clown guards, and two new weapons - the combat shotgun and the flayer. The game also added new multiplayer (BloodBath) models (CabalCo cultists, Soul Drudges, etc.) and modes (such as &quot;Zombie Head Soccer&quot;). Most of these features were created during the development of Blood II, but never made it into the final project until the release of the add-on.\nStory","torrent":{"xt":"urn:btih:406860f7f26f3c9bef0c4ef888760012e4b703fd","amp;dn":"Blood+II%3AThe+Chosen+Nightmare+Levels%5Bcd%5D-+MADJACKTHEPISSEDPIRATE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"406860f7f26f3c9bef0c4ef888760012e4b703fd","infoHashBuffer":{"type":"Buffer","data":[64,104,96,247,242,111,60,155,239,12,78,248,136,118,0,18,228,183,3,253]},"announce":[],"urlList":[]}}