{"title":"How to Program with Java Podcast","uid":11973167,"size":2626695638,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:420a4877f92cb237381dcee6faf4177d89823df7&amp;dn=How+to+Program+with+Java+Podcast&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"neane","files":65,"time":1432916031,"description":"&quot;Here's episode 1[-65 ((piratenotes))] of the How to Program with Java Podcast.  I'm very excited to kick off this podcast and can't wait to see where this journey takes me!&quot;\n\nJava is a set of several computer software and specifications developed by Sun Microsystems, later acquired by Oracle Corporation, that provides a system for developing application software and deploying it in a cross-platform computing environment. Java is used in a wide variety of computing platforms from embedded devices and mobile phones to enterprise servers and supercomputers. While less common, Java applets run in secure, sandboxed environments to provide many features of native applications and can be embedded in HTML pages.\nWriting in the Java programming language is the primary way to produce code that will be deployed as byte code in a Java Virtual Machine (JVM); byte code compilers are also available for other languages, including Ada, JavaScript, Python, and Ruby. In addition, several languages have been designed to run natively on the JVM, including Scala, Clojure and Groovy. Java syntax borrows heavily from C and C++, but object-oriented features are modeled after Smalltalk and Objective-C. Java eschews certain low-level constructs such as pointers and has a very simple memory model where every object is allocated on the heap and all variables of object types are references. Memory management is handled through integrated automatic garbage collection performed by the JVM","torrent":{"xt":"urn:btih:420a4877f92cb237381dcee6faf4177d89823df7","amp;dn":"How+to+Program+with+Java+Podcast","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"420a4877f92cb237381dcee6faf4177d89823df7","infoHashBuffer":{"type":"Buffer","data":[66,10,72,119,249,44,178,55,56,29,206,230,250,244,23,125,137,130,61,247]},"announce":[],"urlList":[]}}