{"title":"Introduction to Mobile Robot Control [2014] [PDF]","uid":12019266,"size":47483448,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:456485303b835f02be8a88dfc06ca856f2cf3363&amp;dn=Introduction+to+Mobile+Robot+Control+%5B2014%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"NoctDeath","files":3,"time":1434384703,"description":"Title: Introduction to Mobile Robot Control \nSeries: Elsevier Insights \nAuthor: Spyros G Tzafestas \nFormat: PDF \nHardcover: 750 pages \nPublisher: Elsevier; 1 edition (October 15, 2013) \nLanguage: English \nISBN: 9780124170490 \n\n\nIntroduction to Mobile Robot Control provides a complete and concise study of modeling, control, and navigation methods for wheeled non-holonomic and omnidirectional mobile robots and manipulators. The book begins with a study of mobile robot drives and corresponding kinematic and dynamic models, and discusses the sensors used in mobile robotics. It then examines a variety of model-based, model-free, and vision-based controllers with unified proof of their stabilization and tracking performance, also addressing the problems of path, motion, and task planning, along with localization and mapping topics. The book provides a host of experimental results, a conceptual overview of systemic and software mobile robot control architectures, and a tour of the use of wheeled mobile robots and manipulators in industry and society.\n\nIntroduction to Mobile Robot Control is an essential reference, and is also a textbook suitable as a supplement for many university robotics courses. It is accessible to all and can be used as a reference for professionals and researchers in the mobile robotics field.\n\n- Clearly and authoritatively presents mobile robot concepts\n- Richly illustrated throughout with figures and examples\n- Key concepts demonstrated with a host of experimental and simulation examples\n- No prior knowledge of the subject is required; each chapter commences with an introduction and background","torrent":{"xt":"urn:btih:456485303b835f02be8a88dfc06ca856f2cf3363","amp;dn":"Introduction+to+Mobile+Robot+Control+%5B2014%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"456485303b835f02be8a88dfc06ca856f2cf3363","infoHashBuffer":{"type":"Buffer","data":[69,100,133,48,59,131,95,2,190,138,136,223,192,108,168,86,242,207,51,99]},"announce":[],"urlList":[]}}