{"title":"Mary Berrys Absolute Favourites-S01E02-WebDL-SD-x264","uid":11954835,"size":176462403,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:46b2155df4dd07bd5239662b9c07f3c755ff1fc9&amp;dn=Mary+Berrys+Absolute+Favourites-S01E02-WebDL-SD-x264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"uggauga","files":2,"time":1432354590,"description":"\nMary Berry's Absolute Favourites - Episode 2\n\nIn this delightful six-part series, the nation's best-loved home cook draws on her wealth of cookery know-how to share a selection of her absolute favourite recipes. In each episode, Mary draws inspiration from a favourite place, one where she loves to spend time, and cooks up tried and tested crowd-pleasers as well as a bounty of new dishes that are easy to make, yet guaranteed to impress all your family and friends.\n\nIn this episode, Mary is inspired by her love of the great British countryside. Brought up in the country, Mary still loves to go walking with her dogs and family, as well as forage for wild ingredients. She begins by preparing some delicious mushroom Scotch eggs - perfect for a country picnic hamper. Mushrooms are one of Mary's all-time favourite ingredients and, assisted by expert advice, she goes foraging for wild varieties in the New Forest, before cooking her delicious garlic mushrooms on toasted brioche. To follow, Mary makes a simple game dish just perfect for a dinner party or family supper - paprika pheasant with mushroom sauce.\n\nGetting out and about in the British countryside is one of Mary's passions, and she tries her hand at fly-fishing on the River Test. As something she's never done before but always wanted to do, she enlists the help of expert angler Charles Jardine. After cooking up her catch on the riverbank, Mary returns to her kitchen to cook a no-fuss hearty sausage lasagne, followed by some easy and delicious mini apple cakes made out of windfall fruit. Delicious!","torrent":{"xt":"urn:btih:46b2155df4dd07bd5239662b9c07f3c755ff1fc9","amp;dn":"Mary+Berrys+Absolute+Favourites-S01E02-WebDL-SD-x264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46b2155df4dd07bd5239662b9c07f3c755ff1fc9","infoHashBuffer":{"type":"Buffer","data":[70,178,21,93,244,221,7,189,82,57,102,43,156,7,243,199,85,255,31,201]},"announce":[],"urlList":[]}}