{"title":"Snow Fun 2","uid":12009556,"size":1094855239,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:486bc1e5074ae09bbc3d2da0e0183ab8c08eb118&amp;dn=Snow+Fun+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Programsmith","files":4,"time":1434066513,"description":"Gallery and Description:\n &lt;a href=&quot;\nhttp://imageview.me/viewer.php?file=lwnl7zisik.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imageview.me/viewer.php?file=lwnl7zisik.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imageview.me/viewer.php?file=epl48at3fr.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imageview.me/viewer.php?file=epl48at3fr.jpg&lt;/a&gt;\n\n\nReleased: 2014\nCountry: USA\nDirected by: Andrej Lupin\nStudio: SexArt Films, MetArt Films\nGenre: Straight, Oral, Big Tits, Footjob, Solo, Lesbian, Toys\nDuration: 1:24:07\n\nStarring: Carla Cox, Emylia Argan, Gabi De Castello, Grace C., Terry Sullivan, Kristof Cale, Matt Ice, Will S.\n\nDescription: Take a cozy chalet at a ski resort in the mountains, add a group of vacationing friends, combine with ample servings of sex, and you've got all the ingredients of Andrej Lupin's &quot;Snow Fun.&quot; For starters the entire cast enjoy some sledding, clowning around, and even making a snowman. But it is cold out there, and Nordic beauty Grace C and Gabi de Castello return to the house. Sharing a cup of hot tea helps, but the tempting twosome have something far more heated in mind - by the time they're through they've kissed, licked, sucked, and fingered each other to several thrilling orgasms. Later that night, after a glass of two of wine, Grace C and Emylia Argan get the party started with a bit of kissing and caressing. Gabi de Castello then strips and masturbates as her friends urge her on approvingly. Terry Sullivan achieves a crowd-pleasing climax with a helping hand from Matt Ice. And Carla Cox gets banged at a furious pace by Will S. The next day on the slopes, when redhead Terry Sullivan takes a spill and strains her knee, Kristof Cale volunteers to take her home. The injury is not severe, and once her knee has been wrapped Sullivan requests treatment of a far more intimate variety. What follows is an athletic multi-position pleasure session punctuated by bouts of oralism. After a long day on the ski slopes Emylia Argan decides to take a leisurely bath. When she discovers a vibrating sex toy in the bathroom she experiments with the device and achieves some extremely pleasurable results. It's at this point that Kristof Cale enters the scene. The couple then proceed to steam up the bathroom in positions both on and in the bathtub. Even after Kristof has come and gone, Emylia can not resist finishing herself off - again - with the tingling jets of the showerhead, bringing &quot;Snow Fun&quot; to a final sizzling climax.\n\nQuality: WEB-DL\nFormat: MP4\nVideo: MPEG4 Video (H264) 640x360 25.00fps 1565kbps [Video]\nAudio: AAC 44100Hz stereo 151kbps [Audio]","torrent":{"xt":"urn:btih:486bc1e5074ae09bbc3d2da0e0183ab8c08eb118","amp;dn":"Snow+Fun+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"486bc1e5074ae09bbc3d2da0e0183ab8c08eb118","infoHashBuffer":{"type":"Buffer","data":[72,107,193,229,7,74,224,155,188,61,45,160,224,24,58,184,192,142,177,24]},"announce":[],"urlList":[]}}