{"title":"DOOM 3 &amp; ROE + Patch, Serials, Crack [PC]","uid":11968564,"size":2496762694,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:49fc29b9da42610334c54d430b175cf3062d49e1&amp;dn=DOOM+3+%26amp%3B+ROE+%2B+Patch%2C+Serials%2C+Crack+%5BPC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Big_dude","files":1,"time":1432759255,"description":"Doom 3 &amp; Resurrection of Evil Expansion for PC                    Rel. 2004 &amp; 2005\n\n\nFormat:\t       DVD/CD\nLang.:\t       English\nDiscs:         2\nImage:         ISO \nRequirements:  Pc with Windows XP, Vista, 7, 8 should work. \nProtection:    SafeDisc v3 + Custom Code + Serial. \n               Patch's, Serials, and working Crack Included.\n              \n\nBoth games were tested and work.\n\n          \n\nRelease Notes:\n\nI know there are several release's of Doom 3 &amp; Roe with cracks here on the pirate bay. But I wanted to upload my version which I found is easier and the least hassle free way to get both games working. I also included cheat info for you in download. \n\n\nThe reason I didn't go with a pre-cracked version was simple...\nyou wouldn't have been able to update with any newer patches, or cracks because you'd need the original file. Believe me this is the safest and smartest way to install, as you can still use the original in-case newer patches or a newer crack is needed in the future.\n\n\nMultiplayer should work as long as you allow internet connection your firewall will probably prompt you for when the app trys to connect to online and the port.\n\n\nNote: The crack file may be reported as a virus or Trojan but these are not and are\n      simply false positives, allow or make an exception thru your virus/firewall\n      software.\n\n\n\nDoom 3 &amp; Roe Minimum system requirements (PC).\n\n* A 1.5-gigahertz Intel Pentium 4 chip or AMD Athlon 1500.\n* 384 megabytes of memory.\n* An nVidia GeForce 3 graphics card or better; or an ATI Technologies 8500 or \n  better.\n* 2GB of free hard drive space.\n\nInstallation Notes: \n\n1. Install Doom 3 with Daemon or mount using ISO use serial\n   7PPG-TBR3-DWD3-HLGJ-32.\n\n2. Install DOOM 3: Resurrection of Evil by mounting the &quot;iso&quot;.\n   Use CD Key PSBC-TASC-33WB-PH7L-C0 for install. Allow the automatic patch\n   install for v1.2, resume install. \n\n3. After Install of ROE &amp; (Direct x) restart your computer, Then update with patch \n   DOOM 3 UPDATE v1.3 included in Doom3 + ROE Patch &amp; Crack (1.3 &amp; 1.3.1) folder, \n   and then run the next patch V1.3.1, don't run doom 3 yet.\n \n4. Backup the executable file &quot;Doom 3.exe&quot; located in the installed directory and\n   copy it to a folder named &quot;Backup D3&quot; for example in case you need the original \n   later.\n\n5. Copy the executable file &quot;Doom 3.exe&quot; located in the &quot;Crack&quot; folder to the\n   installed directory. If you are using Win 98 OS use the win98 crack, same thing\n   copy over original doom 3.exe and copy over Doom3ded.exe.\n\n6. Note if you use zonealarm or firewall allow doom3 to monitor user activities or\n   you won't be able to move your character. Don't worry its not a virus, spyware \n   or anything...this is for the controls, or keyboard commands in the game.\n\n7. You may need to block doom 3 from internet or block with firewall but you \n   shouldn't have to after you copy over the crack. The crack works and doesn't  \n   require you to enter a cd key or anything, and you can still play without \n   blocking with firewall or disconnecting from internet. If on a rare occasion \n   it asks you for a key when you start up the game exit disconnect from internet \n   retry game.\n\n8. Crack works for ROE to no cd checks, just play.\n\n\n**********************************************************************************\n                           Game Description Doom 3:\n**********************************************************************************\n\nDeveloped by id Software - Rated Mature\n \nComing nearly ten years after the groundbreaking original, Doom 3 continues id Software's first-person shooter series with a true 3D engine featuring bump-map texturing and enhanced lighting and shadow effects. Players will revisit the setting introduced in 1993's Doom but with a more involved storyline written by sci-fi scribe Matthew Costello (of 7th Guest and The 11th Hour fame). \n\nThe result is a more cinematic experience than in games past, with elements of horror interwoven with the action to create a sense of tension. Shadows sometimes appear a split second before enemies attack, creatures materialize in the reflections of mirrors, and monsters can break through walls. Certain classic enemies have also been upgraded, such as the imps, which now stare players down with glaring eyes before pouncing on them.\n\n**********************************************************************************\n          Game Description Doom 3 - Resurrection of Evil Expansion:\n**********************************************************************************\n\nExperience an all-new assault on humanity with Doom 3 - Resurrection of Evil, the official expansion pack for Doom 3! \n\nResurrection of Evil continues the terrifying and intense action of the already classic Doom 3, which Maxim and Computer Gaming World awarded &quot;five out of five stars&quot; and the Associated Press called &quot;one of the scariest games ever made.&quot;\n\nThrough the discovery of a timeless and evil artifact you now hold the powers of Hell in your hands, and the demons have come to hunt you down and take it back.\n\nFollowing the events of Doom 3 and featuring new locations, characters and weapons, including the return of the double-barreled shotgun, Doom 3 - Resurrection of Evil will expand your nightmare!\n\n\n\nGame Pics included.\n\n\nBurn the Iso's or mount and Install (Included is Imgburn and Daemon Tools).\n\n\nMake sure you follow the installation notes included &amp; info to properly play the games.\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working or not working for you let us know write a comment, \nIf there was a problem or anything with it, explain the problem so I can help.\n\n\n\nPlease Seed this when your done.\n\n\n\nEnjoy!","torrent":{"xt":"urn:btih:49fc29b9da42610334c54d430b175cf3062d49e1","amp;dn":"DOOM+3+%26amp%3B+ROE+%2B+Patch%2C+Serials%2C+Crack+%5BPC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49fc29b9da42610334c54d430b175cf3062d49e1","infoHashBuffer":{"type":"Buffer","data":[73,252,41,185,218,66,97,3,52,197,77,67,11,23,92,243,6,45,73,225]},"announce":[],"urlList":[]}}