{"title":"The Anthony Cumia Show 2015-04-21 Mike Ward MP4 MP3","uid":11835694,"size":292788674,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4aae2d477755da43ee4d5164e0c25de442d68ef2&amp;dn=The+Anthony+Cumia+Show+2015-04-21+Mike+Ward+MP4+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mothergoose58","files":2,"time":1429718993,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest: Mike Ward\n\nEpisode 149 - Dicis starts the show from ova here and then ova there and after that, Anthony talks about Dr. Oz being in the news, we see part of a throwback &quot;Monsanto&quot; Disney video, discuss the freakiness of things being &quot;coded&quot;, the irony of an agoraphobic granny falling down a hole, and Warren Sapp's hooker arrest video. The crew swaps drug testing stories, we hear the latest on Ben Affleck, see the time-lapse effects that will be in an elevator at One World Trade Center, talk about 9/11 commemorative items, look at a reckless driving WorldStarHipHop video, a Chris Hansen Kickstarter video, and Ant moves to the table of the stars to meet comedian Mike Ward. The guys chat about how strip clubs vary by locale, drug tolerance in Canada, Mike tells us about his grudge on hockey, how he got into the industry, opening for Bill Cosby, trying to clean up your act, and the power social media brings as well as its ability to ruin jokes. After a (non) floating beer delivery, they talk about To Catch a Predator versus Candid Camera, Mike's podcast, Ant's old Live from the Compound shows, the balls it takes to do stand-up, angry fans, switching content in different countries, frivolous lawsuits, and the commonality with the US and Canada's taste in comedy and music. Mike tells us he has no issues border crossing, they chat about black friends, abiding by the law, gun permits and stats, death threats, gun ranges, Canadian culture, the kindhearted folk in Germany, and Mike talks about his upcoming hosting gig during the Just for Laughs festival.\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:4aae2d477755da43ee4d5164e0c25de442d68ef2","amp;dn":"The+Anthony+Cumia+Show+2015-04-21+Mike+Ward+MP4+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4aae2d477755da43ee4d5164e0c25de442d68ef2","infoHashBuffer":{"type":"Buffer","data":[74,174,45,71,119,85,218,67,238,77,81,100,224,194,93,228,66,214,142,242]},"announce":[],"urlList":[]}}