{"title":"Urban Air Pollution in Asian Cities","uid":12013888,"size":3386292,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4c35bf35e52402c3797af9d1096f6e2c17a9ce20&amp;dn=Urban+Air+Pollution+in+Asian+Cities&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1434272744,"description":"ISBN 9781844073757\n\nAir pollution has become part of the daily existence of many people who work, live and use the streets in Asian cities. Each day millions of city dwellers breathe air polluted with concentrations of chemicals, smoke and particles that dramatically exceed World Health Organization guideline values. Deteriorating air quality has resulted in significant impacts on human health and environment in Asia. This book provides a comprehensive and comparative assessment of the current status and challenges in urban air pollution management in 20 cities in the Asian region. It examines the effects on human health and the environment and future implications for planning, transport and energy sectors. National and local governments have begun to develop air quality management strategies to address the deterioration in urban air quality; however, the scope and effectiveness of such strategies vary widely. This book benchmarks these air quality management strategies, examines successes and failures in these cities and presents strategies for improving air quality management in cities across Asia and the rest of our rapidly urbanizing world. Information on air quality in Asia is clearly presented with easy-to-read city profiles, tables and graphs. This is an essential resource for all those concerned with urban air quality management, not just in Asia but in cities across our rapidly urbanizing world. Cities covered Bangkok, Beijing, Busan, Colombo, Dhaka, Hanoi, Ho Chi Minh City, Hong Kong, Jakarta, Kathmandu, Kolkata, Metro Manila, Mumbai, New Delhi, Seoul, Shanghai, Singapore, Surabaya, Taipei and Tokyo","torrent":{"xt":"urn:btih:4c35bf35e52402c3797af9d1096f6e2c17a9ce20","amp;dn":"Urban+Air+Pollution+in+Asian+Cities","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c35bf35e52402c3797af9d1096f6e2c17a9ce20","infoHashBuffer":{"type":"Buffer","data":[76,53,191,53,229,36,2,195,121,122,249,209,9,111,110,44,23,169,206,32]},"announce":[],"urlList":[]}}