{"title":"Shadow - Shadow (2001)","uid":11982981,"size":81389888,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4e3d5cdf0fcbea8b204baf60dcf7f297a70ccf5a&amp;dn=Shadow+-+Shadow+%282001%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jeffabreu","files":10,"time":1433271830,"description":"In 1993, Yoshio Kubo started taking action in finding members for his melodic-death project, Shadow. Luckily he met Yuichi Sumimoto who joined Shadow as a guitarist. Yuichi then found a drummer, and got an old friend of his, Shinichiro Okada, to play second guitar. They now had a band, so then was the time to start rehearsing.\n\nAfter several months of rehearsing, the original drummer quit, and he was then temporarily replaced by Mitsuhiro Enomoto, who was made a permanent member of Shadow six months later. Shadow kept rehearsing and writing songs, but they could not find a vocalist. Even when they recorded their first demo during the winter of 1997, they had to use a session vocalist.\n\nThat demo however caught the eye and ear of Sami Tenetz of Spikefarm Records. Tenetz asked Shadow for another sample, so another demo was made. That demo led to a record deal with Spikefarm, and Shadow headed for a studio to record their debut album. The album was recorded during the autumn and winter of 2000 in Japan, and it was later mixed by Mikko Karmila at Finnvox studio, Finland. Shadow's self-titled debut was released in May 2001.\n\nTheir first album received high reaction from lot of media in the world. However,  one of the guitarists left in autumn of the same year. Afterwards, a new guitarist joined and the preparation and the recording for the second album started. But he left on the way of the recording. In addition, there were various circumstances and the production of the album was delayed very much. This &quot;Forever Chaos&quot; is finally completed and it has been released in November of 2008","torrent":{"xt":"urn:btih:4e3d5cdf0fcbea8b204baf60dcf7f297a70ccf5a","amp;dn":"Shadow+-+Shadow+%282001%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e3d5cdf0fcbea8b204baf60dcf7f297a70ccf5a","infoHashBuffer":{"type":"Buffer","data":[78,61,92,223,15,203,234,139,32,75,175,96,220,247,242,151,167,12,207,90]},"announce":[],"urlList":[]}}