{"title":"We Are Your Leafs: The Toronto Maple Leafs Book of Greats","uid":11951511,"size":44180036,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4fc258a8e427d30f05990485a661f09d9559cda3&amp;dn=We+Are+Your+Leafs%3A+The+Toronto+Maple+Leafs+Book+of+Greats&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1432170982,"description":"The Toronto Maple Leafs official book of the greatest players and coaches from yesterday and today! We Are Your Leafs is the first book in an eight-book partnership between Fenn/Random House and the Toronto Maple Leafs as part of the team's forthcoming centennial celebration plans. It is the absolute must-have for Leaf fans far and wide! \n     The Toronto Maple Leafs have 61 players and fifteen builders inducted in the Hockey Hall of Fame, more than any other NHL franchise. Their list of team captains from the past century of hockey reads like an All-Star roster and the names of each net-minder who have stood between the Leafs' pipes include some of the game's most brilliant goalies. \n     In hockey, there is no other club as recognized and as widely admired as the Leafs. They are baseball's New York Yankees and the NFL's Dallas Cowboys -- a team that defines the sport, is an iconic ingredient in the culture and traditions of its city, and enjoys fan support well beyond their own market.\n     As the Toronto Maple Leafs approach their centennial season, historians, hockey analysts, and fans alike will examine this club's contribution to the game and the athletes who have given the fans so much to cheer for. In We Are Your Leafs, veteran sports writer Mike Ulmer, in partnership with the Toronto Maple Leafs, selects and profiles more than 80 of the greatest Leafs of all time. This unique and fully illustrated official publication recognizes the team's greatest captains, goalies, defencemen, enforcers, coaches, and more. The profiles -- of legends like Johnny Bower, snipers like Phil Kessel, and recent fan favorites such as Doug Gilmour -- are accompanied by entertaining stories, quotes, stats, and a wealth of Leafs memorabilia and photographs","torrent":{"xt":"urn:btih:4fc258a8e427d30f05990485a661f09d9559cda3","amp;dn":"We+Are+Your+Leafs%3A+The+Toronto+Maple+Leafs+Book+of+Greats","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fc258a8e427d30f05990485a661f09d9559cda3","infoHashBuffer":{"type":"Buffer","data":[79,194,88,168,228,39,211,15,5,153,4,133,166,97,240,157,149,89,205,163]},"announce":[],"urlList":[]}}