{"title":"The Anthony Cumia Show 2015-06-03 Tallywackers MP4 MP3","uid":11988684,"size":295100939,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5778387cf43c8496742996e6135f46a3013f940b&amp;dn=The+Anthony+Cumia+Show+2015-06-03+Tallywackers+MP4+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mothergoose58","files":2,"time":1433436293,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\n\nEpisode 173 &quot;Tallywackers&quot; -  TACS begins with feedback on last night's Legion of Skanks, a driveway update, Ant shows us a video of a real life stunt car, Beavis makes a long overdue appearance, we learn what &quot;rollin' coal&quot; is, and see a dashcam car bomb. Anthony discusses a news story about a possible Casey Anthony interview on NBC, talks about the monitoring of search history, pissing while carrying, carrying at baseball games, a terrorist beheading plot in Boston, a story involving dog vs. gangsta, and gives his opinion on social media's involvement with &quot;homegrown&quot; terrorists. Ant brings up his disappointment with Larry Wilmore and people's one sided views regarding the police in Baltimore, a few lovely callers chime in, we get schooled on non-compliance with cops, watch a video of a loud mouth be-otch that shockingly (not) ends up not complying, Ant begs for better behavior, reads about NASA visiting Pluto, questions the importance of diversity, and KtC calls in to give a big FU to American Airlines and to pitch the next hot tub episode of TACS. We then watch a kid get pissy-eyed after eating a ghost pepper, a caller tells us about a woman dying after getting ass injections, and Wednesday wraps with news stories about Huckabee, &quot;Tallywackers&quot;, senior swindlers, God-zi-raahh (almond eye glasses accent), and Ant letting us know about an upcoming compound fieldtrip.\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:5778387cf43c8496742996e6135f46a3013f940b","amp;dn":"The+Anthony+Cumia+Show+2015-06-03+Tallywackers+MP4+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5778387cf43c8496742996e6135f46a3013f940b","infoHashBuffer":{"type":"Buffer","data":[87,120,56,124,244,60,132,150,116,41,150,230,19,95,70,163,1,63,148,11]},"announce":[],"urlList":[]}}