{"title":"Grand.Theft.Auto.V+DLC-RELOADED","uid":11946700,"size":65083646973,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:58359b0e5443d3ac9acce06225b9729371ed33ef&amp;dn=Grand.Theft.Auto.V%2BDLC-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mireia78","files":2,"time":1432094040,"description":"ABOUT THE GAME\n\nWhen a young street hustler, a retired bank robber and a terrifying psychopath find themselves entangled with some of the most frightening and deranged elements of the criminal underworld, the U.S. government and the entertainment industry, they must pull off a series of dangerous heists to survive in a ruthless city in which they can trust nobody, least of all each other.\n\nGrand Theft Auto V for PC features a range of major visual and technical upgrades to make Los Santos and Blaine County more immersive than ever. In addition to vastly increased draw distances, Grand Theft Auto V for PC runs at 60FPS in 1080p, with the ability to display visuals in 4K resolution. Players will experience a range of additions and improvements including:\n\nNew weapons, vehicles and activities\nAdditional wildlife\nDenser traffic\nNew foliage system\nEnhanced damage and weather effects, and much more\n\nAll these features are enhanced by stunning resolution, dramatic improvements to lighting, shadows, and textures, and a smooth frame-rate.\n\nThe PC versions of Grand Theft Auto V and Grand Theft Auto Online will also feature First Person Mode, giving players the chance to explore the incredibly detailed world of Los Santos and Blaine County in an entirely new way.\n\nGrand Theft Auto V for PC also includes the new Rockstar Editor, which gives players a full suite of editing tools to create and publish gameplay clips direct to both Social Club and YouTube.\n\nGrand Theft Auto V also comes with Grand Theft Auto Online, the dynamic and ever-evolving Grand Theft Auto universe. Enhancements to Grand Theft Auto Online for PC will include an increased player count, with online play for up to 30 players. All existing gameplay upgrades and Rockstar-developed content created since the original release of Grand Theft Auto Online will also be available for PC, with much more to come.\n\nTitle: Grand Theft Auto V\nGenre: Action, Adventure\nDeveloper: Rockstar North\nPublisher: Rockstar Games\nRelease Date: April 14, 2015\n\n\nDLC:\n\nGTA 5: Holiday Surprise\nThe eighth addition to the game, added four new cars and two new weapons.\n\nGTA 5: Team Survivors\nThe seventh addition to the game, added two new types of weapons and three vehicles.\n\nGTA 5: Flying School San Andreas\nThe sixth addition to the game, adding three air vehicles and one ground.\n\nGTA 5: Independence Day\nThe fifth update and new content available in the game to version 1.15, released in honor of the national holiday of America.\n\nGTA 5: I do not hipster\nThe fourth update for GTA 5 Online, and with the new transport (7 cars), a pistol, a knife, clothing and animations.\n\nGTA 5: High society\nA third update for GTA 5 Online, and with the new transport (4 pieces) rifle, real estate and animations.\n\nGTA 5: Business\nThe second DLC, adding three new machines, two arms and a lot of clothes.\n\nGTA 5 Beach Bum: Beach slacker\nThe first DLC, designed more for GTA Online, but for GTA 5 perepalo content.\n\n\n\nMinimum:\nOS: Windows 8.1 64 Bit, Windows 8 64 Bit, Windows 7 64 Bit Service Pack 1, Windows Vista 64 Bit Service Pack 2* (*NVIDIA video card recommended if running Vista OS)\nProcessor: Intel Core 2 Quad CPU Q6600 @ 2.40GHz (4 CPUs) / AMD Phenom 9850 Quad-Core Processor (4 CPUs) @ 2.5GHz\nMemory: 4 GB RAM\nGraphics: NVIDIA 9800 GT 1GB / AMD HD 4870 1GB (DX 10, 10.1, 11)\nHard Drive: 65 GB available space\nSound Card: 100% DirectX 10 compatible\n\nRecommended:\nOS: Windows 8.1 64 Bit, Windows 8 64 Bit, Windows 7 64 Bit Service Pack 1\nProcessor: Intel Core i5 3470 @ 3.2GHz (4 CPUs) / AMD X8 FX-8350 @ 4GHz (8 CPUs)\nMemory: 8 GB RAM\nGraphics: NVIDIA GTX 660 2GB / AMD HD 7870 2GB\nHard Drive: 65 GB available space\nSound Card: 100% DirectX 10 compatible\n\n1. Unrar\n2. Burn or mount the image\n3. Install the game.\n4. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory\n5. Play the game. We recommend using a firewall as usual\n6. Support the software developers. If you like this game, BUY IT\n\n\n\nGeneral Notes:\n\nBlock the game's exe in your firewall to prevent the game from\ntrying to go online\nIf you install games to your systemdrive, it may be necessary\nto run this game with admin privileges instead","torrent":{"xt":"urn:btih:58359b0e5443d3ac9acce06225b9729371ed33ef","amp;dn":"Grand.Theft.Auto.V%2BDLC-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58359b0e5443d3ac9acce06225b9729371ed33ef","infoHashBuffer":{"type":"Buffer","data":[88,53,155,14,84,67,211,172,154,204,224,98,37,185,114,147,113,237,51,239]},"announce":[],"urlList":[]}}