{"title":"The Anthony Cumia Show 2015-06-02 Call Me Cumia MP4 MP3","uid":11985959,"size":326483997,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5a4b97b768dbde54402c1b4b1092171573a63dcc&amp;dn=The+Anthony+Cumia+Show+2015-06-02+Call+Me+Cumia+MP4+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mothergoose58","files":2,"time":1433351606,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\n\nEpisode 171 &quot;Call Me Cumia&quot; - Today's episode starts with Caitlyn chat, Ant discusses tolerance, acceptance, the media's constant game of spinning news, he reads an article regarding Joe DeRosa's lack of support and gives his take on the situation, and reminds everyone that Legion of Skanks will be live at 10pm tonight. Anthony accepts an invite to Greg Gutfeld's new show which means the extortion worked, he talks about his issues with the iPhone 6, goes through TACS mail, expresses utter disinterest for a FIFA/Qatar/World Cup news story, we watch a video about Somali Muslims in Minneapolis, and hear from the callers. Ant briefly talks about Ann Coulter's book &quot;Adios America&quot;, we see a new interview with Tracy Morgan, read Vince Vaughn's take on guns, find out that Chet Hanks enjoys n-bombs, watch some videos from &quot;broadcaster&quot; Wayne Dupree, and get happy with an adorable kitty vid. We hear about William Shatner riding a motorcycle cross-country, discuss the Montreal Comedy Festival, Fox News Corp's intent to build a skyscraper, a St. Paul school district's &quot;white privilege&quot; training, see a clip from Hannity debating Muslims demanding crosses be removed from a Catholic school, and finish up with horse racing predictions.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:5a4b97b768dbde54402c1b4b1092171573a63dcc","amp;dn":"The+Anthony+Cumia+Show+2015-06-02+Call+Me+Cumia+MP4+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a4b97b768dbde54402c1b4b1092171573a63dcc","infoHashBuffer":{"type":"Buffer","data":[90,75,151,183,104,219,222,84,64,44,27,75,16,146,23,21,115,166,61,204]},"announce":[],"urlList":[]}}