{"title":"The Anthony Cumia Show 2015-04-13 Sig Hansen, Jake Anderson","uid":11814707,"size":285409110,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5ea0c3a6e4d3781c97e336cb2b412548374c045d&amp;dn=The+Anthony+Cumia+Show+2015-04-13+Sig+Hansen%2C+Jake+Anderson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mothergoose58","files":2,"time":1429033001,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest(s): Sig Hansen, Jake Anderson\n\nEpisode 144 - Monday begins finding out that SiriusXM wants Ant back, we briefly hear about his gig with Brother Joe in Patchogue, and get a few movie recommendations from Anthony's weekend watching. Captain Sig and Jake from the Northwestern on Deadliest Catch join TACS via Skype to talk about their crabbing season, the dangers of ice, possible mutiny, what it takes to be a fisherman, the celebrity status the show has brought, tragedy on the seas, and how the show has changed the way people view crab. Ant then gets into Amy Schumer hosting the MTV Movie Awards, we see some nudes of Emily Ratajkowski, discuss Rat's incredibly boring Periscope videos, talk about Hillary Clinton's &quot;big&quot; announcement that she'll be running for president, Ant expresses his thoughts on it, and Lady Di calls in to push her GoFundMe and drone on about other useless drivel. We hear a news story about a death at Disney, look at a few other injuries that have gone down at &quot;the happiest place on earth&quot;, see a gas station shit kicking video, a &quot;mob attack&quot; at another gas station, a brawl in a Walmart parking lot, and hear about a woman getting jumped for shushing bitches in a movie. Ant shows us a deja vu baseball clip, talks about Dan Mason's retirement from CBS, waxes about the old Opie and Anthony bit &quot;slave girl&quot;, reads a news story about a man blaming his doomed marriage on her shitty titties, we get an update on Jodi Arias, learn the three categories Anthony has for gal pals, his cell phone mishaps, and he pleads to J.J. Abrams to make everyone forget about prequels.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:5ea0c3a6e4d3781c97e336cb2b412548374c045d","amp;dn":"The+Anthony+Cumia+Show+2015-04-13+Sig+Hansen%2C+Jake+Anderson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ea0c3a6e4d3781c97e336cb2b412548374c045d","infoHashBuffer":{"type":"Buffer","data":[94,160,195,166,228,211,120,28,151,227,54,203,43,65,37,72,55,76,4,93]},"announce":[],"urlList":[]}}