{"title":"Impact of Mineral Impurities in Solid Fuel Combustion","uid":11971288,"size":24657504,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5ec7ee8911f90be64612d1bc2c9a6a8136668242&amp;dn=Impact+of+Mineral+Impurities+in+Solid+Fuel+Combustion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ferdgust","files":1,"time":1432824344,"description":"This book contains papers presented at the Engineering Foundation Conference on mineral matter in fuels held on November 2-7, 1997 in Kona, Hawaii. The conference is one of a continuing series that was initiated by the CEGB Mar- wood Engineering Laboratories in 1963. The conference was to be eventually organised by the Engineering Foundation as the need for multi-disciplinary work related to c- trolling ash effects in combustors became apparent. The conference covers both the science and the applications. The papers also present case histories, particularly for current fuel technologies, developments in advanced technologies for power generation and mathematical modelling of these processes. Developments since 1963 have been slow, but steady, due to the complexity of the chemical and physical processes involved. However, the research presented here displays great improvement in our understanding of the mechanisms by which mineral matter will influence fuel use. Steve Benson from EERC presented a review and current status of issues related to ash deposition in coal combustion and gasification. The application of new analytical tools, which have been detailed in the previous conferences, is presented. These include CCSEM, as well as new techniques for char- terising sintering of ash, such as TMA, image analysis, X-ray diffraction crystallography and thermal analysis. The new analytical techniques were extended to encompass widely differing fuels such as biomass. Ole H Larsen from ELSAM Denmark presented a review of these advanced techniques","torrent":{"xt":"urn:btih:5ec7ee8911f90be64612d1bc2c9a6a8136668242","amp;dn":"Impact+of+Mineral+Impurities+in+Solid+Fuel+Combustion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ec7ee8911f90be64612d1bc2c9a6a8136668242","infoHashBuffer":{"type":"Buffer","data":[94,199,238,137,17,249,11,230,70,18,209,188,44,154,106,129,54,102,130,66]},"announce":[],"urlList":[]}}