{"title":"ExploitedCollegeGirls - Brittney [.mp4]","uid":10807925,"size":713164787,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:611a299d8cea137eb5f7a18994c38294294d48d8&amp;dn=ExploitedCollegeGirls+-+Brittney+%5B.mp4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"-MosT-WanteD-","files":1,"time":1408396852,"description":"This week, our tallest Ex Co Gi girl ever. At 6'1&quot; we present long legged, hourglass figured, 19 year old sex fiend Brittney. Jay almost had to break out the wide-angle lens for this update. During the interview Brittney regales Jay with a few of her more odd sexual adventures including the time she used a strap on on a boyfriend (yikes.) It seems like quite a sexual resume for a young lady, but when a girl is as hot as Brittney, she's not going through a lot of dry spells.\nAfter getting settled on the bed, Jay has her strip and we are treated to quite the view. Brit is tall and lean, but not so skinny that she lacks curves. She's got great hips, a nice bouncy rack and is all around amazing. She gets settled at the edge of the bed as Jay grabs the Rabbit and spreads her legs wide for him revealing a cute pussy surrounded by more stubble than you'd see in Little Armenia after 5 o'clock.\nAs Jay applies the Rabbit to her, we finally learn how to silence that ice pick to the ear drum laugh - get her panting in pleasure. As Jay explores her pussy, clit and ass with the Rabbit, we barely hear anything from Brittney beyond moans of encouragement. After a nice blowjob with a little face fucking, Jay finally applies his cock to her pussy and elicits more moans and panting as Brittney grinds and writhes in pleasure.\nAfter some amazing hip work on Brittney's part in cowgirl, Jay is ready to fire away and has Brit get to her knees for her very first facial, which she turns out to enjoy a great deal. As she says goodbye and towels jizz off her face, she talks to Jay about a possible future in the adult biz, so watch this space.\n\n============================================\n &lt;a href=&quot;\nhttp://imgruby.com/?v=700094&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgruby.com/?v=700094&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgruby.com/?v=630630&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgruby.com/?v=630630&lt;/a&gt;","torrent":{"xt":"urn:btih:611a299d8cea137eb5f7a18994c38294294d48d8","amp;dn":"ExploitedCollegeGirls+-+Brittney+%5B.mp4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"611a299d8cea137eb5f7a18994c38294294d48d8","infoHashBuffer":{"type":"Buffer","data":[97,26,41,157,140,234,19,126,181,247,161,137,148,195,130,148,41,77,72,216]},"announce":[],"urlList":[]}}