{"title":"Fart Sound Board Funny Sounds 4.22.0","uid":12021508,"size":32428469,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:614dc62dc25fa0d5daf7c3670242e4087983454e&amp;dn=Fart+Sound+Board+Funny+Sounds+4.22.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bitter48","files":6,"time":1434449302,"description":"Top free fun fart app!\n+++ 20 Apps in 1! +++\nFeatures:\n\n- The automatic Pocket Fart Machine Extreme FX:\nA fart will play when a voice or a noise is too loud. You can set up the sensitivity with one simple slide and choose the trigger modus, sound movement and touch. Extremely funny when the phone is hidden somewhere\n\n- The mega Fart Sound Board:\nWith this crazy and vulgar soundboard blaster you can play easily by pressing different buttons.\n\n- The piano:\nPlay the piano with tons of great inverted burp notes.\n\n- The whoopee cushion:\nWarning: Do not sit or think about letting somebody do it as the phone will not carry the weight of a human being.\n\n- The explosive fart grenade:\nLet the brown thunder grenade explode in the time you define! You can set the seconds of the deflate alarm timer and hide the device and let it explode\n\n- Pull my finger 3D:\nPull the 3D finger and hear the different farts - from wet to atomic. This is a great functionality for kidding friends.\n\n- Stinky A** Detector:\nFind out if your friends are stinky. Great FUN at parties!\nAdvice: By using this tool, do not let you friend discover that you move your finger on the secret slide bar.\n\n- The talking fart:\nTalk to the elephant and he answers with his funny voice and reacts to what you say or your touch.\n\n- The fart shaker:\nShake your phone! The one who shakes the phone the most will be elected as Flatulence Mega Man!\n\n- The fart games:\nCollect points by quickly touching the right butts. Pay attention to the wrong ones which are red.\n\n- Remote Gas Blaster:\nPrank your friends. Connect 2 phones together and then use the remote fart soundboard on one phone to play the sound on the other phone.\n\n- A?Lighter\n\n- Funny Jokes Collection\n\n- Image Faker:\nA tool to create new fantastic fake pictures that you will be able to share with friends.\n\n- Stickers:\nGive your pictures a personal touch. Select either a photo from your gallery or an image which is already faked. Take the selected pic and start personalizing by choosing between numerous stickers.\n\n- Comics &amp; Cartoons\n\n- Fart lie detector:\nDid one of your friends drop a bomb? Find out the truth!\n\n- Match pairs:\nFind the same looking images on the board and train your memory with this cool match 2 game.\n\n- Fart wheel:\nTurn the wheel clock and anti clock wise to listen to the different sounds.\n\n- Gift Prank:\nGive a wonderful presents to your friends and let them open the mysterious box.\n\nRecent Changes\n\n- Tuning","torrent":{"xt":"urn:btih:614dc62dc25fa0d5daf7c3670242e4087983454e","amp;dn":"Fart+Sound+Board+Funny+Sounds+4.22.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"614dc62dc25fa0d5daf7c3670242e4087983454e","infoHashBuffer":{"type":"Buffer","data":[97,77,198,45,194,95,160,213,218,247,195,103,2,66,228,8,121,131,69,78]},"announce":[],"urlList":[]}}