{"title":"Fake or Fortune S04E01","uid":12096323,"size":654313772,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:61e720ab833651880352957bcfc4384ae5c3e10b&amp;dn=Fake+or+Fortune+S04E01&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xela_5","files":1,"time":1436158303,"description":"The new season of FAKE OR FORTUNE - Series 4 Episode 1\n\nLOWRY ...\n\nArt detectives Fiona Bruce and Philip Mould return for a brand new series, starting with an investigation into three small pictures by one of Britain's best-loved modern artists - LS Lowry.\n\nStephen Ames, a Cheshire property developer, has a problem - he's inherited three small oil paintings believed to be by Laurence Stephen Lowry, an artist renowned for his scenes of northern life, but he doesn't have any proof. All he knows is that they were bought by his father Gerald, a self-made businessman with a passion for art, in the early 70s.\n\nThe trouble for Stephen is that LS Lowry is probably the most faked British artist, his deceptively simple style of painting making him a soft target for forgers. As a result, the art market has become very wary of newly discovered Lowry works. If he can't find evidence in favour of the pictures, they are worthless. \n\nAs they hunt for proof with the assistance of specialist art researcher Dr Bendor Grosvenor, the team encounter unexpected obstacles and extraordinary coincidences, culminating in a groundbreaking scientific discovery that challenges everything we thought we knew about Lowry the artist. But is it enough to prove that the pictures are genuine?","torrent":{"xt":"urn:btih:61e720ab833651880352957bcfc4384ae5c3e10b","amp;dn":"Fake+or+Fortune+S04E01","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61e720ab833651880352957bcfc4384ae5c3e10b","infoHashBuffer":{"type":"Buffer","data":[97,231,32,171,131,54,81,136,3,82,149,123,207,196,56,74,229,195,225,11]},"announce":[],"urlList":[]}}