{"title":"Far Cry 4.PC.Game.Repack-R.G.Mechanics","uid":12091452,"size":14168080798,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:62a3f7da3223be2191e91eb83af51c3df0ed227b&amp;dn=Far+Cry+4.PC.Game.Repack-R.G.Mechanics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"maximus_bar","files":15,"time":1436063051,"description":"Far Cry 4 is another version of extremely popular first-person sandbox shooting game. The first part of the series was produced by Crytek in 2004. A year later, French concern Ubisoft took over the responsibility for creating sequels to games and its spin-offs for the consoles. The fourth part of Far Cry was created mainly in the Ubisoft Montreal development studio, but in the production were involved in a lesser and greater extent practically all other departments of the company. Far Cry 4 is the first part in the series which is available on Xbox One and PlayStation 4.\nThe action of Far Cry 4 takes us to Kyrat. It is a small fictional country situated in the Himalayas, where the inhabitants live according to traditions and simple way of life. However, the country is involved in civil war between an eccentric military warlord Pagan Min and self-proclaimed ruler Kyrat. He introduces the rule of an iron fist together with his supporters, ignoring the civilian victims of the conflict. Pagan Min who has a rampant lust for power is stopped by the rebels, who try to remove him and stop the escalation of violence. The main protagonist of the game is called Ajay Ghale. He travels to Kyrat to fulfill the wish of his dying mother. When he arrives, he becomes involved in a struggle between the supporters of the dictator and the guerrillas fighters.\nDuring the game, the players progressively get to know the secrets of Kyrat. Thanks to its specific situation, a fictional country offers varied and interesting locations - from the snowy mountain routes to the thick forests as well as the cities, old ruins and so on. While the game, the players can move freely on the territory of the Himalayan country that is a large and open map. The players can also make a use of various means of transport. Moreover, the protagonist can take part in meditations which can move him to a fantastic land of Shangri-La.\nWhile taking part in the campaign, the players complete story missions as well as various side quests and optional tasks such as frees checkpoints, time trial or hunting wild animals. It is the FPS genre production so the players can make a use of a rich arsenal of weapons from simple pistols to heavy machine guns. There are also different types of daggers, knives and arches. For the first time in the history of the series, there is an opportunity to use a crossbow.\nApart the single game, the creators have prepared a possibility to take part in multiplayer which is available in many variations. In the new co-op mode, the players can call friends, who can help them in completing side missions or in exploring the open world","torrent":{"xt":"urn:btih:62a3f7da3223be2191e91eb83af51c3df0ed227b","amp;dn":"Far+Cry+4.PC.Game.Repack-R.G.Mechanics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62a3f7da3223be2191e91eb83af51c3df0ed227b","infoHashBuffer":{"type":"Buffer","data":[98,163,247,218,50,35,190,33,145,233,30,184,58,245,28,61,240,237,34,123]},"announce":[],"urlList":[]}}