{"title":"Undercover: The True Story of Britain's Secret Police","uid":10824601,"size":5278976,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:676f0686ae0295266a71e15c4dc6760d94b15c30&amp;dn=Undercover%3A+The+True+Story+of+Britain%27s+Secret+Police&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":16,"uploader":"tmPhoneix","files":1,"time":1408570076,"description":"Undercover lays bare the deceit, betrayal and cold-blooded violation practised again and again by undercover police officers - troubling, timely and brilliantly executed.' Henry Porter\n\nThe gripping stories of a group of police spies - written by the award-winning investigative journalists who exposed the Mark Kennedy scandal - and the uncovering of forty years of state espionage.\n\nThis was an undercover operation so secret that some of our most senior police officers had no idea it existed. The job of the clandestine unit was to monitor British 'subversives' - environmental activists, anti-racist groups, animal rights campaigners.\n\nPolice stole the identities of dead people to create fake passports, driving licences and bank accounts. They then went deep undercover for years, inventing whole new lives so that they could live incognito among the people they were spying on.\n\nThey used sex, intimate relationships and drugs to build their credibility. They betrayed friends, deceived lovers, even fathered children. And their operations continue today.\n\nUndercover reveals the truth about secret police operations - the emotional turmoil, the psychological challenges and the human cost of a lifetime of deception - and asks whether such tactics can ever be justified.","torrent":{"xt":"urn:btih:676f0686ae0295266a71e15c4dc6760d94b15c30","amp;dn":"Undercover%3A+The+True+Story+of+Britain%27s+Secret+Police","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"676f0686ae0295266a71e15c4dc6760d94b15c30","infoHashBuffer":{"type":"Buffer","data":[103,111,6,134,174,2,149,38,106,113,225,92,77,198,118,13,148,177,92,48]},"announce":[],"urlList":[]}}