{"title":"Sun Tzu - The Art of War (11 editions)","uid":12111168,"size":17494897,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:67b6de1e148acab73383711001c7511a19739b46&amp;dn=Sun+Tzu+-+The+Art+of+War+%2811+editions%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"workerbee","files":22,"time":1436577846,"description":"\nTHE ART OF WAR is an ancient Chinese military treatise traditionally attributed to SUN TZU, a high-ranking military general, strategist and tactician.  It is commonly thought to be the definitive work on military strategy and tactics of its time, and for the last two thousand years remained the most important military treatise in Asia, where even the common people knew it by name.  \n\nComposed of 13 chapters, each of which is devoted to one aspect of warfare, it addresses strategy in a broad fashion, touching upon public administration and planning.  The text outlines theories of battle, but also advocates diplomacy and cultivating relationships with other nations as essential to the health of a state.  It has therefore had an enduring influence not only on Eastern and Western military thinking, but also on business management, political and legal strategy, and beyond.\n\nThere are numerous theories concerning when the text was completed and concerning the identity of the author or authors, but archeological recoveries have proven that THE ART OF WAR had achieved roughly its current form by at least the early Han.  Because it is impossible to prove definitively when the book was completed before this date, the differing theories concerning the work's author or authors and date of completion are unlikely to ever be completely resolved.\n\nThe first annotated English language translation was completed and published by Lionel Giles in 1910.  Serious readers of the text will be particularly interested in the translations and commentary offered by Roger Ames, Thomas Cleary, Thomas Huynh, and Ralph Sawyer.\n\n\nThe following books are in ePUB format unless otherwise indicated:\n\n* THE ART OF WAR (Delacorte, 1983).  Edited and with an Foreword by James Clavell.\n\n* THE ART OF WAR (Pax Librorum, 2009).  Translated by Lionel Giles. -- PDF\n\n* THE ART OF WAR (Barnes &amp; Noble Classics, 2003).  Translated by Lionel Giles; edited with an Introduction by Dallas Galvin.\n\n* THE ART OF WAR: Bilingual Chinese-English Edition (Tuttle, 2008).  Translated by Lionel Giles; edited with a new Foreword by John Minford.\n\n* THE ART OF WAR (Oxford UP, 1963).  Translated by Samuel B. Griffith with a Foreword by B.H. Liddell Hart.  Please note this is a reprocessed version of an older scan that has many missing pages.  While Sun Tzu's text is complete, the original scan does not include the Introduction, Appendices, Bibliography, or Index. -- PDF\n\n* THE ART OF WAR (Tuttle, 1996).  Translated by Stephen F. Kaufman.\n\n* THE ART OF WAR (Penguin Great Ideas, 2005).  Translated by John Minford.\n\n* THE ART OF WAR (Westview, 1994).  Translated with Introductions and Commentary by Ralph D. Sawyer.\n\n* THE ART OF WAR: Complete Texts and Commentaries (Shambhala, 2011).  Translated by Thomas Cleary.\n\n* THE ART OF WAR -- Spirituality for Conflict: Annotated &amp; Explained (Skylight Paths, 2008).  Translated with Annotations by Thomas Huynh.\n\n* THE ART OF WARFARE: The First English Translation Incorporating the Recently Discovered Yin-ch'ueh-shan Texts (Ballantine, 1993).  Translated with Introduction and Commentary by Roger Ames. -- PDF\n\n\nMany thanks to @anmisto for your kind help!\n\n_____________________________________________________________________________\n\n\n&gt;&gt; CONTACT ME\nYou may reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\n             &lt;a href=&quot;\nhttps://pirates-forum.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/User-workerbee&lt;/a&gt;  \n\n&gt;&gt; PLEASE HELP TO SEED!\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:67b6de1e148acab73383711001c7511a19739b46","amp;dn":"Sun+Tzu+-+The+Art+of+War+%2811+editions%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67b6de1e148acab73383711001c7511a19739b46","infoHashBuffer":{"type":"Buffer","data":[103,182,222,30,20,138,202,183,51,131,113,16,1,199,81,26,25,115,155,70]},"announce":[],"urlList":[]}}