{"title":"Three Books by Ishmael Reed in EPUB format","uid":10718858,"size":3754922,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6920811332da97a982ab43a78567c8c8c3e34be4&amp;dn=Three+Books+by+Ishmael+Reed+in+EPUB+format&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gratefuldawg77","files":3,"time":1407448525,"description":"Ishmael Scott Reed is an American poet, essayist, and novelist. A prominent African-American literary figure, Reed is known for his satirical works challenging American political culture, and highlighting political and cultural oppression.\n\nReed has been described as one of the most controversial writers. While his work has often sought to represent neglected African and African-American perspectives, his energy and advocacy have centered more broadly on neglected peoples and perspectives irrespective of their cultural origins.\n\n\n\nMumbo Jumbo is Ishmael Reed's brilliantly satiric deconstruction of Western civilization, a racy and uproarious commentary on our society. In it, Reed, one of our preeminent African-American authors, mixes portraits of historical figures and fictional characters with sound bites on subjects ranging from ragtime to Greek philosophy. Cited by literary critic Harold Bloom as one of the five hundred most significant books in the Western canon, Mumbo Jumbo is a trenchant and often biting look at black-white relations throughout history, from a keen observer of our culture.\n\n\n\nMasochism is out and feminism is in, Jews are out and Germans are in, race is out and gender is in, and everyone's fighting (and rewriting) for a piece of the pie. Jewish director Jim Minsk disappears during a trip to the South. Black playwright Ian Ball writes the all-female play Reckless Eyeballing in hopes of getting off the &quot;sex-list.&quot; Preeminent playwright Jack Brashford, claiming the Jews stole all his black material, decides to write about Armenians. In the background, an unknown assailant dubbed the &quot;Flower Phantom&quot; runs loose through the city shaving heads of prominent black feminists (to the secret delight of black men).\n\nIn this hilarious, devastating, but also deeply sympathetic novel, Ishmael Reed turns characters on the backs, sides, tops and bottoms to expose the multiple hypocrisies at the heart of American culture.\n\n\n\nIshmael Reed's electrifying first novel zooms readers off to the crazy, ominous kingdom of HARRY SAM a miserable and dangerous place ruled for thirty years by Harry Sam, a former used car salesman who wields his power from his bathroom throne. In a land of a thousand contradictions peopled by cops and beatniks, black nationalists and white liberals, the crusading Bukka Doopeyduk leads a rebellion against the corrupt Sam in a wildly uproarious and scathing satire, earning the author the right to be dubbed the brightest contributor to American satire since Mark Twain (The Nation).","torrent":{"xt":"urn:btih:6920811332da97a982ab43a78567c8c8c3e34be4","amp;dn":"Three+Books+by+Ishmael+Reed+in+EPUB+format","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6920811332da97a982ab43a78567c8c8c3e34be4","infoHashBuffer":{"type":"Buffer","data":[105,32,129,19,50,218,151,169,130,171,67,167,133,103,200,200,195,227,75,228]},"announce":[],"urlList":[]}}