{"title":"ROKOS OS Integrated with Bitcoin Client, Daemon and other alt Pi","uid":12079973,"size":1715263160,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:69fc4677ace208d8936248b2405e6b6f10a7c007&amp;dn=ROKOS+OS+Integrated+with+Bitcoin+Client%2C+Daemon+and+other+alt+Pi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bitcoin_pi","files":1,"time":1435736662,"description":"Cryptocurrency and the Internet of Things Raspbian based OK OS with integrated Cryptocurrency wallets\n\nWe've seen new services selling &quot;stake miners&quot; for different currencies, we support the new technology and uses for cryptocurrencies in the Rapberry Pi environments, hence we came up with a Free solution for every Pi enthusiast, developer, user, service that want to try their first cryptocurrencies on their Pi systems, or that would like to turn their Pi into a Staking device, It already includes a synched and fully functional wallet for OKCash to provide them with the best and easier Out of the Box experience.\n\nv2 Update: Based on feedback and more research we find out that a lot of new crypto users have issues for getting Bitcoin, Litecoin and Dogecoin wallets to work in their Pi, and some people complain about the long time it takes to compile the wallets and get them running, so BTC, LTC, and DOGE wallets and daemons are included in ROKOS since the v2 release and forward.\n\nThe First OS image release that merges the full power of Raspbian and Cryptocurrencies: - ROKOS v1 comes with an integrated OKCash wallet and Synched Chain. Released on Jun 9 2015. - ROKOS v2 and forward includes the Bitcoin, OK, Litecoin and Dogecoin Wallets. (OK Chain Synched) Released on Jun 30 2015.\n\nImage\n\nDistribution aimed at New Pi Users, Medium grade users and Advanced Pi Users. Download &amp; Burn, Ready for use. Jun 6 2015 - ROKOS v1 (OK) - DOWNLOAD Jun 30 2015 - ROKOS v2 (BTC OK LTC DOGE) - DOWNLOAD Official Download Links - Do Not Download from other sources, posts, links to ensure the security of your downloads\n\nSpecs:\n\nv1 Release Jun 9 2015 - Full burnable OS Compatible with the Raspberry Pi systems. - Raspbian based. - Active Firewall out of the box. - Dev tools (makes it easier to compile Bitcoin and other cryptocurrencies wallets into the system) - Works with other cryptocurrencies. - 1024 swap. - Updated OKCash wallet with full Stake functionality, encrypted messages and a Synched OKchain. - Disabled SSH (can enable if required) - Direct access to the wallet Via: Desktop shortcut, Menu &gt; Internet. - ZIP file - Compression: Only 1.6Gb image to download, 4.4GB uncompressed to burn.\n\nv2 Release: Jun 30 2015 - Includes qt 4 and most developer tools to compile almost any other cryptocurrency wallet if required. - Interface and Logos Redesign. - Official ROKOS logo Redesigned and added to start menu. - Latest Bitcoin Core QT wallet v0.11.99 with direct links. (includes daemon) - Latest OKCash Core QT wallet v2.0.0 with direct links, Full Stake functionality, encrypted messages and Synched Chain till June 30 2015. (includes daemon) - Latest Litecoin Core QT wallet v0.10.2 with direct links. (includes daemon) - Latest Dogecoin Core QT wallet v1.8.2 with direct links. (includes daemon) - Disabled SSH (can enable if required) - Security and System Updated. - 1024 Swap mod. - Updated Out of the box Firewall already configd only for wallets and web access. (and ssh IF you enable it) - RAR file - High Compression: Only 1.6Gb image to download, 5.5GB uncompressed to burn.\n\nRequirements: Any ROKOS version: - Raspberry Pi B or 2 (v1 Should work for A but further testing is required, hence not officially supported yet)\n\nROKOS v1: - Min 6gb SD card. (Class 10 for optimal performance)\n\nROKOS v2: - If you will use ALL the wallets: Min 8gb SD card and an External device (usb or hdd). To synch the chains on the external device instead of the SD card, BTC chain alone is around 40gb.\n\n    If using OKCash, Litecoin and Dogecoin: Min 32gb SD card. they fit together in the card for now, external device recommended.\n    If using only OKCash and Litecoin OR Dogecoin (2 wallets): Min 16gb SD card.\n    If only using OKCash: Min 8gb SD card.\n\nFuture Versions: - Security updates. - Chain Updates. - More Cryptocurrencies will be integrated for an Out of the Box experience in different versions called FLAVORS. - Designs Updates. - More wallets, programs or features, based on users feedback and cross collaborations","torrent":{"xt":"urn:btih:69fc4677ace208d8936248b2405e6b6f10a7c007","amp;dn":"ROKOS+OS+Integrated+with+Bitcoin+Client%2C+Daemon+and+other+alt+Pi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69fc4677ace208d8936248b2405e6b6f10a7c007","infoHashBuffer":{"type":"Buffer","data":[105,252,70,119,172,226,8,216,147,98,72,178,64,94,107,111,16,167,192,7]},"announce":[],"urlList":[]}}