{"title":"Desiccant-Assisted Cooling - Fundamentals and Applications","uid":12059622,"size":9821006,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6b29d97a486c609c5671c758e288f01d4e656aba&amp;dn=Desiccant-Assisted+Cooling+-+Fundamentals+and+Applications&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1435221990,"description":"ISBN 9781447155645\n\nThe increasing concern with indoor air quality has led to air-quality standards with increased ventilation rates. Although increasing the volume flow rate of outside air is advisable from the perspective of air-quality, it is detrimental to energy consumption, since the outside air has to be brought to the comfort condition before it is insufflated to the conditioned ambient. Moreover, the humidity load carried within outside air has challenging HVAC engineers to design cooling units which are able to satisfactorily handle both sensible and latent contributions to the thermal load. This constitutes a favorable scenario for the use of solid desiccants to assist the cooling units. In fact, desiccant wheels have been increasingly applied by HVAC designers, allowing distinct processes for the air cooling and dehumidification. In fact, the ability of solid desiccants in moisture removal is effective enough to allow the use of evaporative coolers, in opposition to the traditional vapor-compression cycle, resulting in an ecologically sound system which uses only water as the refrigerant.\n\nDesiccant Assisted Cooling: Fundamentals and Applications presents different approaches to the mathematical modeling and simulation of desiccant wheels, as well as applications in thermal comfort and humidity controlled environments. Experts in the field discuss topics from enthalpy, lumped models for heat and mass transfer, and desiccant assisted radiant cooling systems, among others.\n\nAimed at air-conditioning engineers and thermal engineering researchers, this book can also be used by graduate level students and lecturers in the field","torrent":{"xt":"urn:btih:6b29d97a486c609c5671c758e288f01d4e656aba","amp;dn":"Desiccant-Assisted+Cooling+-+Fundamentals+and+Applications","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b29d97a486c609c5671c758e288f01d4e656aba","infoHashBuffer":{"type":"Buffer","data":[107,41,217,122,72,108,96,156,86,113,199,88,226,136,240,29,78,101,106,186]},"announce":[],"urlList":[]}}