{"title":"Z-Detective - John Stockmyer","uid":12081776,"size":795571,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6be37f8cb89d557793836bc7f057429f21a94d1a&amp;dn=Z-Detective+-+John+Stockmyer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ZamKhan","files":3,"time":1435790450,"description":"Of Mice and Murderers:\nMeet Big Bob Zapolska (Z for short), an unlicensed private eye who reads detective fiction for self improvement. \nLow-rent private eye that he is, Z does not usually get cases that turn into murder, to say nothing of multiple murder. Nor is he often called upon to help solve &quot;classy&quot; cases like the theft of a painting from Kansas City's Nelson Art Gallery. And never before has he run into something as spooky as the Bateman College &quot;ghost light,' the light seeming, in some way, to be the key to these other crimes. \nBig Bob Zapolska may be a loner. He may be a loser. He may, in fact, be a dangerous pyromaniac. But if someone has cheated you --- if someone is crowding you --- it's good to have the Z-man on your side! \nOf further help to him are his personal beliefs: \n- Never break the law --- unless you have to. \n- Tell the truth when possible --- it's hard to remember lies. \n- If you blackjack a man correctly, he will rarely suffer permanent brain damage. \n- In the right hands [Z's], fire is an excellent motivator. \n- To avoid temptation --- give in to it immediately. \n\nGood Lord, Deliver Us: \nHow lowly P.I. Bob Zapolska came to be chaperoning a girl ghost hunter, was difficult to figure. How he got himself into &quot;haunting&quot; a ghost house, was impossible to explain. As for avoiding the charms of &quot;frolicsome&quot; ghost hunter, Jamie Stewart, Z could only follow one of his own rules: &quot;To avoid temptation, give in to it immediately!&quot;\n\nMurder by Candlelight: \nHow does Z handle it when casual contact with a sleazy radio personality gets Z into trouble with the police, the Department of Building Codes, the IRS, and someone who attempts to frame Z for drug possession? Not to worry! If Big Bob Zapolska can't outwit, or out trick his many &quot;opponents,&quot; nobody can!","torrent":{"xt":"urn:btih:6be37f8cb89d557793836bc7f057429f21a94d1a","amp;dn":"Z-Detective+-+John+Stockmyer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6be37f8cb89d557793836bc7f057429f21a94d1a","infoHashBuffer":{"type":"Buffer","data":[107,227,127,140,184,157,85,119,147,131,107,199,240,87,66,159,33,169,77,26]},"announce":[],"urlList":[]}}