{"title":"Ian Thomas - The Runner [1981][2013][320 KBPS][RMSTD]","uid":12006768,"size":94738070,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6bee02debfd4dbefccbc9f212fb6dc30c418b2d4&amp;dn=Ian+Thomas+-+The+Runner+%5B1981%5D%5B2013%5D%5B320+KBPS%5D%5BRMSTD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"LameDuck69","files":14,"time":1433912990,"description":"------------------------------------\nIan Thomas - The Runner [1981][2013]\n------------------------------------\n\n\n01 Hold On\n02 Stringin' A Line\n03 Chains\n04 Embers From The Fire\n05 When I Need Someone\n06 Borrowed Time\n07 I Am The One\n08 Goner\n09 Freefall In Stardust\n10 The Runner\n-----------------------\n**320 KBPS CBR\n**Cover Art\n-----------------------\nIan Campbell Thomas (born 23 July 1950) is a singer, songwriter, actor and author. He is the younger brother of comedian and actor Dave Thomas. He was born in Hamilton, Ontario, Canada.\n\nThomas is a successful rock and roll musician in Canada, at the height of his solo career during the 1970s, with his most memorable hit being 1973's &quot;Painted Ladies&quot;. Success in the American market, however, has proven to be elusive with the possible exception of &quot;Painted Ladies&quot;, which remains his only U.S. Top 40 hit, and the song &quot;Runner&quot; which was recorded by Manfred Mann's Earth Band. He has also done musical composition for about a dozen films and television shows. Before breaking through with &quot;Painted Ladies&quot;, he was a producer at the CBC. Before that, he was part of the folk music group Tranquility Base.\n\nIn 1974 he won a Juno Award for &quot;Most Promising Male Vocalist of the Year&quot;.\n\nIn 1981, Thomas made a cameo appearance on SCTV with his real life older brother Dave Thomas during a sketch of &quot;The Great White North&quot;. He played himself and performed the songs, &quot;Pilot&quot; and &quot;Hold On&quot;. He also wrote and recorded the theme song for his brother's film Strange Brew. As well, Thomas was a musical guest on the CTV children's show Whatever Turns You On (a short-lived spinoff of You Can't Do That on Television) in 1979.\n\nMany of his songs have been covered by popular artists, including &quot;Hold On&quot; (Santana, 1982), &quot;The Runner&quot; (Manfred Mann's Earth Band, 1984), &quot;Right Before Your Eyes&quot; (America, 1983), and &quot;Chains&quot; (Chicago). In 1988, Daryl Braithwaite had hits in Australia with two Thomas compositions: &quot;As the Days Go By&quot; (which peaked at #10), and &quot;All I Do&quot; (a #12 chart hit). Bette Midler also covered his song &quot;To Comfort You&quot; on her Bette of Roses CD.\n\nHe is also known for the portrayal of the character &quot;Dougie Franklin&quot; on the Canadian comedy series The Red Green Show.\n\nFrom 1991 through 2002, Thomas released four albums with The Boomers.\n\nCurrently, he performs with Murray McLauchlan, Cindy Church, and Marc Jordan in the group Lunch At Allen's.\n\nIn 2009, Thomas provided the music for the animated series Bob &amp; Doug, based on the SCTV characters of the same name.\n\nHe has written two books, Bequest (2006), Canadian Best Seller, and The Lost Chord (2008), both through Manor House Publishing.\n\nIn 2010, Wounded Bird Records re-issued &quot;Still Here&quot; on CD.\n\nHe continues to make appearances to perform songs old and new, and to tell stories of these songs","torrent":{"xt":"urn:btih:6bee02debfd4dbefccbc9f212fb6dc30c418b2d4","amp;dn":"Ian+Thomas+-+The+Runner+%5B1981%5D%5B2013%5D%5B320+KBPS%5D%5BRMSTD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bee02debfd4dbefccbc9f212fb6dc30c418b2d4","infoHashBuffer":{"type":"Buffer","data":[107,238,2,222,191,212,219,239,204,188,159,33,47,182,220,48,196,24,178,212]},"announce":[],"urlList":[]}}