{"title":"Plants.vs.Zombies.Garden.Warfare.Repack-R.G.Mechanics","uid":12101483,"size":5831899551,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6c42d379d22bb7a7c7bee8cd57c52653d89b6a57&amp;dn=Plants.vs.Zombies.Garden.Warfare.Repack-R.G.Mechanics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"max_ebers","files":18,"time":1436329627,"description":"Plants Vs. Zombies: Garden Warfare is a spin-off of the hit series of tower defense games which are most popular among customers from the casual market. This time, the developers from PopCap Games addressed their product to the players who prefer gameplay focused on more dynamic action.\nAs in previous games in the series, the main theme of Plants vs. Zombies: Garden Warfare is a battle between plants and hordes of zombies that threaten the world. Various species of flora join forces to deal with the undead.\nIn contrast to the main games of the cycle, the gameplay in Plants Vs. Zombies: Garden Warfare combines elements of tower defense games, action games, and TPP shooters. The player takes control over the actions of a selected plant, and his task is to build defense turrets (in the form of slightly smaller plants) and fighting off enemies advancing from different directions, among which there are also bosses which are particularly difficult to eliminate, such as disco-zombies or gargantua- zombies.\nThe gameplay is focused on dynamic battles and cooperation, in which at the same time four players can participate. The key to winning often is using special skills of each plant, for example, garlic can float over the board, and sunflower can heal other plants.\nAs far as technical side of the game is concerned, it is powered by the Frostbite 3 engine, used in such productions as Battlefield 4 and Star Wars: Battlefront. It provides a high-quality three-dimensional graphic design, which in the case of Plants vs. Zombies: Garden Warfare is maintained in a cartoonish style","torrent":{"xt":"urn:btih:6c42d379d22bb7a7c7bee8cd57c52653d89b6a57","amp;dn":"Plants.vs.Zombies.Garden.Warfare.Repack-R.G.Mechanics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c42d379d22bb7a7c7bee8cd57c52653d89b6a57","infoHashBuffer":{"type":"Buffer","data":[108,66,211,121,210,43,183,167,199,190,232,205,87,197,38,83,216,155,106,87]},"announce":[],"urlList":[]}}