{"title":"Trim &amp; Toned in 20 with Tonya Larson DVDRip x264 aac [MP4]","uid":12102841,"size":1770410077,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:6c85f3700ee31a434574320afe57d9838481b9ff&amp;dn=Trim+%26amp%3B+Toned+in+20+with+Tonya+Larson+DVDRip+x264+aac+%5BMP4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"elessedilgirl","files":9,"time":1436364575,"description":"Tonya Larson created Trim &amp; Toned in 20 to be an incredibly creative and versatile workout DVD that delivers 3 different 20-minute action packed segments: Upper Body, Lower Body, Abs &amp; Core &amp; Stretch. These segments provide body-sculpting on a stability ball, fun fat burning cardio combinations, and targeted abdominal and core work. They can be done individually or combined to create a more intense workout.\n\nTonya specifically designed Trim &amp; Tone in 20 to be an interval-training workout because studies show that this type of exercise offers the most results, in relation to caloric burn and cardiovascular health, in the shortest period of time. All three workout segments provide the intensity necessary to see real results workout out for only 20-minutes by increasing and decreasing your heart rate and focusing on multiple muscle groups at once. Tonya utilizes the stability ball as a tool to add creativity to this workout with the goal of targeting the core, resulting in stronger leaner abs.\n\nTrim &amp; Toned in 20 was also developed to meet the needs of all exercise levels from beginner to advanced. There is a modifier present throughout the workout showing lower-impact, less challenging versions of each exercise. In addition, this DVD offers premixes in which the cardio segments are divided out from the strength-training segments so that this one DVD can provide a multitude of different types of workouts.\n\nTonya has included a bonus segment with this workout called the spiritual Warm-Up Stretch. Proverbs 14:30 says that &quot;A heart at peace gives life to the body&quot;. With this in mind, Tonya developed a relaxing stretch segment including scripture meditation that focuses on peace with our circumstances, peace with others, peace with ourselves, and peace with God.\n\nEquipment Needed: Hand Weights, Stability Ball, Mat\n\nVideo; x264; 720*480 (4:3); 1827 kbps; 23.976 fps\nAudio; aac; 160 kbps; 2 ch; 48.0 Khz","torrent":{"xt":"urn:btih:6c85f3700ee31a434574320afe57d9838481b9ff","amp;dn":"Trim+%26amp%3B+Toned+in+20+with+Tonya+Larson+DVDRip+x264+aac+%5BMP4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c85f3700ee31a434574320afe57d9838481b9ff","infoHashBuffer":{"type":"Buffer","data":[108,133,243,112,14,227,26,67,69,116,50,10,254,87,217,131,132,129,185,255]},"announce":[],"urlList":[]}}