{"title":"[PS3] CellFactor: Psychokinetic Wars","uid":10943122,"size":235837044,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:6c85b7081f2f6054256cd2c7e99fae325b14d59e&amp;dn=%5BPS3%5D+CellFactor%3A+Psychokinetic+Wars&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fuckface69","files":-1,"time":1409531873,"description":"CellFactor: Psychokinetic Wars is a fast-paced first-person multiplayer shooter where you choose your side in the battle of technology vs. humanity. Manipulate your environment and kill your enemies with your choice of gunfire and/or telekinetic superpowers. Use your mind to rip objects from the environment and smash them in any direction or use your powers to create a bullet-proof energy shield. Flying, teleporting and accelerated speed give you countless ways to kill or be killed. Take on the three single-player challenge modes (one mode for each character) or battle live enemies throughout the world in one of four multiplayer modes.\n\nKey Features\n\n* Countless ways to kill your enemies: Guns, telekinesis and superpowers combine to offer you unparalleled battle options.\n* Use your environment as a weapon: All maps contain objects to hurl at your enemies, including pipes that can be ripped off of walls, rocks, concrete blocks and many more.\n* Massive online battles in four multiplayer modes: Death Match, Capture the Flag, Team Death Match, and Assault.\n* 30 single player challenges: 10 for each character.\n* 7 unique environments: From lava pools to ice storms, the environments impact the gameplay and give the warrior exciting options.\n* Weapons: Pistols, sniper rifles, shotguns, assault rifles, small bombs, and rocket launchers.\n* Powers: Telekinesis (summoning objects from the environment and chucking them at enemies), shooting lightning rods and energy beams (can kill in one shot), ability to blind your enemy, bullet-proof shields, teleporting, super jumping, flying, and accelerated running speed.\n* Unlock rewards as you progress: As your score increases you gain access to rewards such as faster stamina regeneration, increased fire power, invisible to radar, longer super run, enhanced teleporting and more.\n* Customize your character: Choose your armor and customize your look with a range of color schemes.\n____________________________________________\n\nYOU HAVE TO USE WINRAR 5 TO EXTRACT ARCHIVE!","torrent":{"xt":"urn:btih:6c85b7081f2f6054256cd2c7e99fae325b14d59e","amp;dn":"%5BPS3%5D+CellFactor%3A+Psychokinetic+Wars","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c85b7081f2f6054256cd2c7e99fae325b14d59e","infoHashBuffer":{"type":"Buffer","data":[108,133,183,8,31,47,96,84,37,108,210,199,233,159,174,50,91,20,213,158]},"announce":[],"urlList":[]}}