{"title":"The Chans Great Continent-China in Western Minds.pdf","uid":12095460,"size":27042964,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6c99b89e1e7cb3f15d7a0f8d4b245fb28ad43896&amp;dn=The+Chans+Great+Continent-China+in+Western+Minds.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"STBGD","files":1,"time":1436133975,"description":"The Chan's Great Continent: China in Western Minds\nNorton &amp; Company | 1998 | ISBN: 0393027473 | English | 310 pages | PDF | 25.8 MB\n\nChina has transfixed the West since the earliest contacts between these civilizations. Now Jonathan Spence, our foremost historian of Chinese politics and culture, tells us, in his elegant new book, how the West has understood China over seven centuries. Ranging from Marco Polo's own depiction of China and the mighty Kublai in the 1270s to the China sightings of three twentieth-century writers of acknowledged genius -- Kafka, Borges, and Calvino -- Spence explores Western thought on China through a remarkable array of expression. Peopling Spence's account are Iberian adventurers, Jesuit missionaries, Enlightenment synthesizers, spinners of the dreamy cult of Chinoiserie, American observers such as Bret Harte and Mark Twain, and diplomats from Lord Macartney to Henry Kissinger. Their visions, alternately coarse and subtle, generous and vicious, outline the West's image as readily as they do China's.China has commanded the attention of the West for seven centuries, and here Spence once again compels our attention with his new history of China's presence in Western minds","torrent":{"xt":"urn:btih:6c99b89e1e7cb3f15d7a0f8d4b245fb28ad43896","amp;dn":"The+Chans+Great+Continent-China+in+Western+Minds.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c99b89e1e7cb3f15d7a0f8d4b245fb28ad43896","infoHashBuffer":{"type":"Buffer","data":[108,153,184,158,30,124,179,241,93,122,15,141,75,36,95,178,138,212,56,150]},"announce":[],"urlList":[]}}