{"title":"Contested Lands - Sumatra Bose","uid":11997298,"size":3471230,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6d170f50fb687e8aa387c9fac1dfb8d7dd421dee&amp;dn=Contested+Lands+-+Sumatra+Bose&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1433695758,"description":"The search for durable peace in lands torn by ethno-national conflict is among the most urgent issues shaping our global future. Looking at the recent and current peace processes in Israel-Palestine, Kashmir, Bosnia, Cyprus, and Sri Lanka Bose addresses the question of how peace can be made, and kept, between warring groups with seemingly incompatible claims.\n\nReview\n\nIn a bold and valuable book, Sumantra Bose defines the new frontiers of peacemaking in contested lands. \n--Thomas Boudreau, American University\n\n[Bose's] disciplined comparative approach yields sensible conclusions and recommendations regarding durable peace processes.\n--J. P. Smaldone (Choice 2007-10-01)\n\nSumantra Bose's book Contested Lands is about battles for political sovereignty in some territories around the world that have proved especially intractable. A scholar who has already written books on the Kashmir dispute and the war in Bosnia in the 1990s, Bose has now put together a highly readable account of what is at stake in these lands--Israel and Palestine, Sri Lanka, Kashmir, Bosnia, and Cyprus. The most stimulating aspect of Bose's approach is that he takes the long historical view of these struggles, devoting a healthy 50-page section to each. By doing so, he reverses the built-in iniquities of both newspaper journalism, which because of its attention to the present moment can be superficial, and of op-eds and other polemical writing, which--for reasons of space or ideological perspective--often simplify matters. Yet, it is through these distorting and perishable forms that most of us put together an understanding of the situation in Israel or Palestine or Kashmir. To read Bose's book is to understand (with some dismay) that our responses to these issues are usually more rhetoric than reason. Bose also supplies a wealth of closely argued insights that open up the complexities of these contested lands in productive ways...The exceptional breadth of his book, the insights he generates through his comparative approach, and the lucidity and cogency of his style mark out Contested Lands as a work of unusual distinction.\n--Chandrahas Choudhury (livemint.com 2007-12-08)\n\nDevotion to positive change stands as the hallmark of Contested Lands. Bose is neither an idealist nor a partisan nor a cynical realist. He does not purport to possess the panacea for disputed territories. But, throughout this precarious moral terrain, his intellectual honesty and sense of evenhanded purpose admirably hold steadfast.\n--Barry Lenser (PopMatters.com 2007-10-24)","torrent":{"xt":"urn:btih:6d170f50fb687e8aa387c9fac1dfb8d7dd421dee","amp;dn":"Contested+Lands+-+Sumatra+Bose","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d170f50fb687e8aa387c9fac1dfb8d7dd421dee","infoHashBuffer":{"type":"Buffer","data":[109,23,15,80,251,104,126,138,163,135,201,250,193,223,184,215,221,66,29,238]},"announce":[],"urlList":[]}}