{"title":"Microsoft Visual Studio Community 2015 RC 23/04/2015  - AppzDam","uid":12074558,"size":3891251200,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6d17dc1e31a16fd634e2f689c1d4058e937fde1e&amp;dn=Microsoft+Visual+Studio+Community+2015+RC+23%2F04%2F2015++-+AppzDam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"AppzDam","files":1,"time":1435602053,"description":"For more info visit : appzdam.net\n\nRelease Candidate Visual Studio Community in 2015 - a free full-featured integrated development environment that provides effective opportunities to increase productivity when creating code, development tools, cross-platform mobile applications for Windows, iOS and Android, as well as access to thousands of extensions. This release of Visual Studio is free for unincorporated application development. After installation, review the collection of Visual Studio. It provides quick access to tools, controls and templates that will help maximize the opportunities Visual Studio.\n\nNotes :\n\nVisual C ++ for cross-platform development for mobile devices\n\nNow you can easily share, create, deploy, and reuse virtually any platform-specific code for multiple platforms, applications, and perform debugging it with a single solution in Visual Studio. Here is an incomplete list of its features:\n\nCreate projects from templates for Android Native Activity or common code libraries that you can use across multiple platforms and applications Xamarin, for devices Android.\nUse IntelliSense technology for the platforms to learn API and create the correct code for the target making Android or Windows.\nCustomize your assembly for 32-bit (x86) platforms or platform-based architecture ARM.\nDeploy the code on the connected Android device, or use a high-performance Android emulator from Microsoft for testing.\nSet breakpoints, monitor variables through the stack, and follow step by step verification code with a debugger Visual Studio.\nBrowse log messages from your Android device using the viewer LogCat. (LogCat - a convenient diagnostic tool for editing&gt; assembly&gt; debugging).\nLogCat allows you to:\nsearch for specific log messages with the help of the search string;\nuse functions enable automatic scrolling for easy viewing log messages;\nto clear the previous log outgoing messages;\nchoose various logging levels.\nWrite code C ++, aimed at the platform iOS, and use the advantages of our advanced features generate code, including code sharing, cross-platform JavaScript IntelliSense, refactoring, mapping definitions and more. We are still working on support for iOS, so stay tuned for news about it (and be sure to send us feedback and suggestions as follows: for error messages, use the Connect, to transmit the recommendations using UserVoice, and submit any suggestions using the Send-a-Smile in the Visual Studio IDE).\nThere were also the following new or updated features:\n\n21 support level API platform Android (Lollipop);\na new template based on the support of make-files for Android, which allows you to use an external build system (including NDK-BUILD);\nprecompiled headers for all patterns (including templates for the dynamic shared library, a static library and cross-platform mobile applications).\nVisual Studio Tools for Apache Cordova\n\nPreviously known as hybrid applications for multiple devices for Visual Studio, Visual Studio Tools for Apache Cordova make it easy to assemble, debug and test cross-platform applications for devices Android, iOS, Windows and Windows Phone, from one simple project Visual Studio.\n\nAll of the features available in the previous CTP-version is now also available in the Release Candidate Visual Studio 2015 includes the following enhancements:\n\nUpdate when saving for Ripple - no need to repeat the assembly!\nDebug version of its iOS application from Visual Studio when deploying iOS Simulator or on a device connected Mac.\nImproved security and simplified procedure for setting the remote agent build iOS.\nImproved management plug-in that includes the ability to add to your project is custom plugins from Git, or the file system.\nChoose the configuration settings for specific platforms, using an advanced designer of config.xml.\nSupport for Apache Cordova 4.0.0.\n\nMore info on : appzdam.net\n\nSystem Requirements :\n\nSupported operating systems\n\nWindows 7 Service Pack 1\nWindows 8.1\nWindows 8\nWindows Server 2008 R2 Service Pack 1 (SP1)\nWindows Server 2012:\nWindows Server 2012 R2\nWindows 10 Technical Preview\nHardware Requirements\n\nProcesor 1,6 GHz lub szybszy\n1 GB pamiÄ™ci RAM (1,5 GB w przypadku uruchamiania na maszynie wirtualnej)\n4 GB dostÄ™pnego miejsca na dysku twardym\nHard disk drive (5400 rev / min)\nVideo card with support for DirectX 9; minimum acceptable display resolution - 1024 x 768\nAdditional requirements\n\nTo develop applications for the Windows Store and universal application for Windows\n\nWindows 8.1 and Windows Phone 8.1, and for the development - Windows 8.1 update or later.\nFor application development Windows Phone 8.0 requires Windows 8.1 (x64) update or later.\nFor emulators Windows requires Windows 8.1 (x64) Professional edition or later, and a processor that supports Hyper-V client and technology second level address translation (SLAT).\nNote: Release Candidate Visual Studio 2015 is not supported in a production environment to create a universal Windows applications and software for the desktop designed for Windows 10","torrent":{"xt":"urn:btih:6d17dc1e31a16fd634e2f689c1d4058e937fde1e","amp;dn":"Microsoft+Visual+Studio+Community+2015+RC+23%2F04%2F2015++-+AppzDam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d17dc1e31a16fd634e2f689c1d4058e937fde1e","infoHashBuffer":{"type":"Buffer","data":[109,23,220,30,49,161,111,214,52,226,246,137,193,212,5,142,147,127,222,30]},"announce":[],"urlList":[]}}