{"title":"Star Wars Trilogy Bonus Disc [Eps 4-6] .x264, Eng Subs [2004]","uid":10772039,"size":2125494929,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6e0c9bb51aeec4006469f5656e6079ee972deccd&amp;dn=Star+Wars+Trilogy+Bonus+Disc+%5BEps+4-6%5D+.x264%2C+Eng+Subs+%5B2004%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rambam1776","files":-1,"time":1408090577,"description":"Star Wars Trilogy Bonus Disc [Eps 4-6] .x264, Eng Subs [2004] - Empire of Dreams - The Story of the Star Wars Trilogy\n\nFormat                                   : Matroska\nFormat version                           : Version 2\nFile size                                : 1.23 GiB\nDuration                                 : 2h 30mn\nOverall bit rate                         : 1 167 Kbps\nWidth                                    : 716 pixels\nHeight                                   : 480 pixels\nDisplay aspect ratio                     : 16:9\nFrame rate mode                          : Variable\nBit depth                                : 8 bits\nScan type                                : Progressive\nWriting library                          : x264 core 120\nENGLISH SUBTITLES\n\nEmpire of Dreams - The Story of the Star Wars Trilogy.mkv\nReturn of the Jedi Original Movie Trailer 1983.mkv\nRevenge of the Jedi Original Movie Trailer 1983 [Changed quickly by Lucas].mkv\nStar Wars [ep 4 - ANH] Original TV Commercial 01.mkv\nStar Wars [ep 4 - ANH] Original TV Commercial 02.mkv\nStar Wars [ep 4 - ANH] Original TV Commercial 03.mkv\nStar Wars [ep 4 - ANH] Original TV Commercials Compilation.mkv\nStar Wars [ep 5 - TESB] Original TV Commercial 01.mkv\nStar Wars [ep 5 - TESB] Original TV Commercial 02.mkv\nStar Wars [ep 5 - TESB] Original TV Commercial 03.mkv\nStar Wars [ep 5 - TESB] Original TV Commercial 04.mkv\nStar Wars [ep 6 - ROTJ] Original TV Commercial 01.mkv\nStar Wars [ep 6 - ROTJ] Original TV Commercial 02.mkv\nStar Wars [ep 6 - ROTJ] Original TV Commercial 03.mkv\nStar Wars [ep 6 - ROTJ] Original TV Commercials.mkv\nStar Wars Battlefront game trailer.mkv\nStar Wars Episode 03 Documentary [ROTS].mkv\nStar Wars Episode 03 Making the Game.mkv\nStar Wars Original Movie Trailer 1977.mkv\nStar Wars Trilogy Special Edition Movie Trailer 1997.mkv\nThe Birth of the Lightsaber.mkv\nThe Characters of Star Wars.mkv\nThe Empire Strikes Back Original 2nd Release Movie Trailer\nThe Empire Strikes Back Original Movie Trailer\nThe Empire Strikes Back Story Board Art Concept Movie Trailer\nThe Force is With Them - The Legacy of Star Wars.mkv\n\nAll titles ripped to above specs by Handbrake.\n\nThe following review comes from an Amazon customer, who went to great lengths in description:\n\nBack in 2004, this disc was included as the only &quot;bonus&quot; extra in the Original Trilogy's first DVD release. Sadly, that release was not only a tampered with set (modified even more than the 1997 Special Editions), but it was poorly restored, featuring odd colors and sound gaffes on the English and Spanish tracks of A New Hope. The 2004 box set was also packaged in a rather flimsy cardboard case that was easily damaged, leaving piles of dented and wrinkled cases on store shelves.\n\nDespite these flaws, the highlight of the set for most was the &quot;Bonus Materials&quot; disc, which became a sought after item after it was nixed for inclusion in subsequent sets (the 2005 &quot;Limited Edition&quot; rehash and the 2006 2 disc sets). For folks who wisely waited, now you can avoid any of the awful box sets and buy this disc seperately. To long-time fans, this set contains some things of interest including the longer version of the &quot;Empire of Dreams&quot; documentary, which, despite including many &quot;revisionist&quot; statements by Lucas and his crew, is quite informative. It spends most of its time on the events leading up to the success of the first movie, and speeds quickly through the rest of the trilogy and the phenomenon that would become the Star Wars franchise to the present day. The other docos are interesting as well.\n\nThe disc features extensive picture galleries and nearly every trailer of the three original films ever released (though the quality varies widely). It's great to see these unaltered. The menus are pretty and show us some effects inconsistent with the 2004 versions, indicating that more care was taken with this release or else a very different team handled it than handled the &quot;restoration&quot; of the special editions mark II.\n\nThe rest of the material is rather dated now, and may be of lesser interest to Original Trilogy fans: \n\nAn Xbox only demo of &quot;Star Wars Battlefront&quot; a mediocre &quot;Battlefield 1942&quot; imitator. If you've already played the game on some other format, this version actually features some things that were cut from the final version of the game on Xbox and PC: the Bothan Spy and the Imperial Officer class (these two were modified and added in the sequel, SWBF2). This is a one level demo, the Battle of Endor, one of the better scenarios out of the video game. There's also a trailer for the aforementioned game. Needless to say this game fell far short of my expectations. There's a promotional teaser for Episode III, full of gushing and showing us the creation of the &quot;new and improved&quot; Vader helmet and Hayden Christiansen trying it on. I once avoided seeing this for fear of spoilers, but it turned out to just be mostly green/blue screen stuff and fluff.\n\nThere's a promotional video for the &quot;Episode III: Revenge of the Sith&quot; Xbox game, showing early gameplay and more fluff. I never played this game but apparently it was largely overhyped, and while decent by console standards of the day, hasn't held up well over time, much like the &quot;Enter the Matrix&quot; game. And finally there's a hidden &quot;blooper reel&quot; done in the same style as the hidden blooper reels for the Prequel dvd's. Not hilarious by any stretch, but as entertaining as blooper reels tend to be. It's nice to see more vintage Star Wars footage, at any rate.","torrent":{"xt":"urn:btih:6e0c9bb51aeec4006469f5656e6079ee972deccd","amp;dn":"Star+Wars+Trilogy+Bonus+Disc+%5BEps+4-6%5D+.x264%2C+Eng+Subs+%5B2004%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e0c9bb51aeec4006469f5656e6079ee972deccd","infoHashBuffer":{"type":"Buffer","data":[110,12,155,181,26,238,196,0,100,105,245,101,110,96,121,238,151,45,236,205]},"announce":[],"urlList":[]}}