{"title":"Andrew Grey - Bronco Boys Books 1 - 3","uid":11990078,"size":579320211,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6f99faa5012e210bb443bf4ba584a171c8d139a8&amp;dn=Andrew+Grey+-+Bronco+Boys+Books+1+-+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"katelynor","files":4,"time":1433482889,"description":"Written by: Andrew Grey\nNarrated by: John Solo \nRipped at 64 kbps\n\n1. Inside Out  6 hrs and 35 mins\n\nFormer mercenary Bull Krebbs now heads up security at his nightclub in Harrisburg, PA. Working the door night after night, he's seen it all. Though tough on the outside, he's a little hurt that people find him unapproachable. Then he pulls a cute twink out of line to perform a random search, and he's surprised when the guy giggles and squirms. Zach Spencer, graphic artist, twink, and seriously ticklish, isn't intimidated by Bull. He's in awe, and when Bull saves Zach from being trampled on the dance floor, Zach finds his inspiration for the superhero in his graphic novel. \n\n\n2. Upside Down - 6 hrs and 47 mins\n\n\nLowell Cartwright's life as a mercenary problem solver has taken its toll, and after one more difficult job, he wants out. For help, he turns to Bull, a soldier of fortune turned club owner - not exactly a friend, but the best chance Lowell has. He visits Bull's club to scope it out and meets Jeremy Hodgson. The twink captures his attention in a big way. Bull tells Lowell to stay away from the club until he decides whether he can help, so Lowell stays in town. \n\n\n3.  Backward - 6 hrs and 42 mins\n\nClub owner Harry Klinger has had his eye on Tristan Martin for months, but never had the nerve to approach him. He's watched as Tristan dated Eddie and then reluctantly sat on the sidelines during the emotional breakup when Tristan discovered Eddie was dealing drugs. Now that Tristan seems to be healing, Harry hopes to get his chance. \n\n\n\nPlease seed and enjoy","torrent":{"xt":"urn:btih:6f99faa5012e210bb443bf4ba584a171c8d139a8","amp;dn":"Andrew+Grey+-+Bronco+Boys+Books+1+-+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f99faa5012e210bb443bf4ba584a171c8d139a8","infoHashBuffer":{"type":"Buffer","data":[111,153,250,165,1,46,33,11,180,67,191,75,165,132,161,113,200,209,57,168]},"announce":[],"urlList":[]}}