{"title":"Dark Skies Invasion (2015) S06E01 Special Edition 720p","uid":11937591,"size":738802989,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:70405cf7d60ac61e81761c584dd3de0373b924c1&amp;dn=Dark+Skies+Invasion+%282015%29+S06E01+Special+Edition+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MovieMash","files":38,"time":1431920634,"description":"When Universes Collide The UNTOLD STORY is now ONLINE\nFAN EDIT - MASHUP - CROSSOVER\n\nThe ending of Season 5 was an official ending but I had so much overflow footage that did'nt make the final cut. I decided to put together one final episode of all the scifi franchises I had not used throughout the series because it was either DVD quality or lower then standard definition which I felt didn't need to be in the other episodes which were all HD. Tonight I bring you the finale to the Entire series which Started last Aug 2014. I may continue the series when Star Wars Episode 7 is finished along with Star Trek 3, EndersGame 2, Terminator 5, Doctor Who season 9, and much more to continue the series. Let me know your thoughts on a direction I could take the Dark Skies series now that its basically over. I did leave some cliffhangers. Anyways see you all again someday and thank you for your support.\n\nIf you missed out on the rest of my series hopefully you find time to download Season 1-4 to catch up on this Mini series mashup.\n\nMr. MovieMashup Presents\nDark Skies Invasion: Battle for Earth (2015) TV movie mini series\nthat are also standalone fan edit films\nSeasons 1-6 Completed\nA 21 Part Mini Series Saga with all self contained themes and that are also standalone fan films on its own.\n\n**1280x544 Resolution** 720p HD Quality\n**Dolby Pro Logic Stereo*\n\nSeries OUTLINE:\nSelf contained fan edit films that has a slight hint of a continual storyline that connects each episode, but each Episode is considered a separate fan film set in the same universe. It is a soap opera drama of movies connecting into a bigger storyline or self contained watchable fan edit films. The concept surrounds the Silence Aliens from Doctor Who who try to invade our history through any means possible be it Alien abductions, Alien take overs, spiritual possession, or Alien zombie parasites. As the series continues each episode brings us closer to the silence, but every episode always remains as a self contained fan film.\n\nSynopsis OUTLINE:\nHUMANITIES FINAL BATTLE AGAINST THE SILENCE.\n\nThis series in a sense is a sequel to the hit 1996 series called &quot;Dark Skies&quot; on NBC which inspired this project to begin with.\nDark Skies TV show was a weekly TV show based around historical events that had a Alien Twist intertwined into history.\nMy series is kinda similar to this concept: Example: Apollo 11 they find Aliens on the moon&quot;\n\nEventually the story in later episodes stray away from Dark skies, but I tried to keep this crossover to historical events and time periods. Series starts in the ancient past and works it way up to our current future and beyond","torrent":{"xt":"urn:btih:70405cf7d60ac61e81761c584dd3de0373b924c1","amp;dn":"Dark+Skies+Invasion+%282015%29+S06E01+Special+Edition+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70405cf7d60ac61e81761c584dd3de0373b924c1","infoHashBuffer":{"type":"Buffer","data":[112,64,92,247,214,10,198,30,129,118,28,88,77,211,222,3,115,185,36,193]},"announce":[],"urlList":[]}}