{"title":"Acelogix System TuneUp 4.8.0.470+Serial","uid":12006916,"size":8656798,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:71a37200a9582e7c942e433232353780e8fe59eb&amp;dn=Acelogix+System+TuneUp+4.8.0.470%2BSerial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"glaresc","files":2,"time":1433926080,"description":"System TuneUp is a modified version of our product - &quot;Ace Utilities&quot; - with a different user interface. It's a collection of tools to optimize your Windows PC's performance. It has two modes - 'Normal' and 'Expert' so both novice and experienced users can use it accordingly.\n\nFeatures in System TuneUp\n\nClean up your PC\n- Cleans junk, temporary and obsolete files from your disks using a swift disk cleaning tool.\n- Built-in steps ensure safer cleaning process.\n- Correct shortcut errors in your Start Menu and desktop.\n\nFix errors in Windows Registry\n- Remove invalid entries from Windows registry.\n- Can easily reverse changes made to the registry.\n- Can create System Restore Point before deleting entries.\n- Windows boots up quickly.\n- Reduces application crashes.\n- Built-in steps ensure safer cleaning process.\n\nEnsure Your Privacy\n- Removes internet browser history and cache.\n- Supports IE, Chrome, Firefox, Opera, Safari and many other browsers.\n- Cleans Cookies and HTML5 data stored by all browsers and Flash.\n- Cleans usage tracks kept by Windows like the media you play, files you open, programs your run etc.\n- Erase the usage-history for over 300 third-party applications.\n- You can create custom plug-ins to delete files of your choice.\n- Supports multiple user accounts.\n- Can 'analyse' your PC and inform you how many files you can delete and how much space can be recovered.\n\nSecure your PC by making data recovery impossible\n- Securely delete files and folders and make them unrecoverable.\n- Wipe your disk free space and remove all traces of data that previously existed.\n- Shred the contents of the Recycle Bin.\n- Four efficient and customizable data wipe methods.\n- Ensures that the deleted information does not fall in to prying eyes.\n\nEliminate duplicate files and folders\n- Helps you locate true duplicates of your files and folders in your disk\n- You can search based on file type, category or size range.\n- Built-in support to check for duplicate music/video files.\n- Can exclude important folders from scanning.\n- Can ignore files below certain size to find space-consuming larger files.\n\nControl the items that start with Windows\n- Easily manage programs and services that start with Windows.\n- Alerts you when a previously disabled program gets enabled.\n- Prevent malicious programs from running at start-up.\n- Your PC will boot up faster and use fewer resources.\n\nAutomate the clean-up process\n- Run multiple tools in one go with 'Quick Cleanup'.\n- Schedule cleanup to run at your convenience.\n\nDisk Analysis\n- Gives you detailed analysis of your disk or drive contents.\n- Graphical pie chart representation; easy to understand.\n- Shows space usage by files and folders; lists the top 100 files by size.\n\nRegistry Backup and Restore\n- Easy backup and restore of Windows Registry.\n- Restore ability from Windows Recovery Console.\n- Fully customizable.\n- Backup and restore from Command Prompt.\n- Can save space by keeping the backup files in compressed format.\n\nRegistry Compactor\n- Compacts and rebuilds Windows registry.\n- Removes registry fragmentation.\n- Improves system performance.\n- Manage Windows System Restore Points\n- Easily manage system restore points by removing the ones you don't need.\n\nUninstall programs properly\n- Uninstall applications easily and quickly.\n\nScreenshots\nAcelogix System TuneUp 4.8.0.470\n\nChanges in v4.8.0 - Jan 13, 2015\n- 'Erase Your History' default settings now includes option to clear the Chrome browser history.\n- Fixed an issue in the Cookie Manager where user was not able to delete ALL cookies.\n- Fixed an issue in the Cookie Manager where user was not able to uncheck some cookies like &quot;google.com&quot;.\n- Removed au32.exe file.\n- Modified the cleaning process for Firefox to include session backups.\n- Added progress indicator for 'Maintenance Wizard' and 'Erase Your History'.\n- Updated history cleaning for Opera browser v26","torrent":{"xt":"urn:btih:71a37200a9582e7c942e433232353780e8fe59eb","amp;dn":"Acelogix+System+TuneUp+4.8.0.470%2BSerial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71a37200a9582e7c942e433232353780e8fe59eb","infoHashBuffer":{"type":"Buffer","data":[113,163,114,0,169,88,46,124,148,46,67,50,50,53,55,128,232,254,89,235]},"announce":[],"urlList":[]}}