{"title":"The Edge of the World by Michael Pye","uid":11954508,"size":1444564,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:72898a3ba43f94bd6a781b5a6ce1b2c383cd37a0&amp;dn=The+Edge+of+the+World+by+Michael+Pye&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"PirateBook","files":2,"time":1432338106,"description":"The Edge of the World: A Cultural History of the North Sea and the Transformation of Europe by Michael Pye\n\n\nAn epic adventure ranging from the terror of the Vikings to the golden age of cities: Michael Pye tells the amazing story of how modernity emerged on the shores of the North Sea.\n\nSaints and spies, pirates and philosophers, artists and intellectuals: they all criss-crossed the grey North Sea in the so-called &quot;dark ages,&quot; the years between the fall of the Roman Empire and the beginning of Europe's mastery over the oceans. \n\nNow the critically acclaimed Michael Pye reveals the cultural transformation sparked by those men and women: the ideas, technology, science, law, and moral codes that helped create our modern world.\n\nThis is the magnificent lost history of a thousand years. It was on the shores of the North Sea where experimental science was born, where women first had the right to choose whom they married; there was the beginning of contemporary business transactions and the advent of the printed book. \n\nIn The Edge of the World, Michael Pye draws on an astounding breadth of original source material to illuminate this fascinating region during a pivotal era in world history.\n\nGenre: Non-Fiction, General","torrent":{"xt":"urn:btih:72898a3ba43f94bd6a781b5a6ce1b2c383cd37a0","amp;dn":"The+Edge+of+the+World+by+Michael+Pye","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72898a3ba43f94bd6a781b5a6ce1b2c383cd37a0","infoHashBuffer":{"type":"Buffer","data":[114,137,138,59,164,63,148,189,106,120,27,90,108,225,178,195,131,205,55,160]},"announce":[],"urlList":[]}}