{"title":"Villas and Palaces of Europe (Art Ebook).pdf","uid":12081390,"size":15841478,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:73371e89058e93af5dfb341c0d1a2c8e17695023&amp;dn=Villas+and+Palaces+of+Europe+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"STBGD","files":1,"time":1435780057,"description":"Villas and Palaces of Europe\nPaul Hamlyn | 1969 | ISBN: 0600012352 | English | 168 pages | PDF | 15 MB\n\nThe social background of an age had an important influence on the design of its great houses: thus the elegant but comparatively small Palladian villas of the Veneto were as much a product of 16th-century Venetian society as the grand chateaux of the Loire were a reflection of the elaborate French court. In selecting examples of villas and palaces for this book, the author, Adalbert Dal Lago, has naturally made a very personal choice, yet each example has a place in one of the currents of European architecture which makes it particularly interesting or significant. The author also takes advantage of the detailed captions which accompany the plates in order to describe the architectural details and to point out the sources and influences of each house. Palladio was the first European architect to seek and achieve an intimate relationship between a building and its landscape, conceived as integrated elements, and it is thÂ« evolution of this idea which links and yet contrasts the magnificent villas and palaces described here. The superb illustrations enable us to compare the Villa Rotonda, Chenonceaux, Fontainebleau, Longleat and the Schonbrunn, with many other less well known but equally elegant houses which grace Europe's countryside","torrent":{"xt":"urn:btih:73371e89058e93af5dfb341c0d1a2c8e17695023","amp;dn":"Villas+and+Palaces+of+Europe+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73371e89058e93af5dfb341c0d1a2c8e17695023","infoHashBuffer":{"type":"Buffer","data":[115,55,30,137,5,142,147,175,93,251,52,28,13,26,44,142,23,105,80,35]},"announce":[],"urlList":[]}}