{"title":"Antiques Roadshow S37E25","uid":12017340,"size":644829179,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7408417e71e91227cafa79d324b5ffa8a9bc9dd3&amp;dn=Antiques+Roadshow+S37E25&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xela_5","files":1,"time":1434335288,"description":"\nThe Scottish National Gallery of Modern Art 3\n\nAntiques Roadshow, Series 37 Episode 25 of 26\n \n\nThe Antiques Roadshow is back at the Scottish National Gallery of Modern Art, where discoveries include a stunning piece of Swedish glass, an invitation to Sir Walter Scott's funeral, a stuffed toy called Little Jack Rabbit and one of the rarest money boxes ever found on the Antiques Roadshow. \n\nGlass specialist Andy McConnell is very excited to see the best piece of Swedish glass that he thinks has ever appeared on the show, while Fiona Bruce receives a crash course in the art of playing the bagpipes from a young boy.\n\nOther eye-catching finds include a watch from a prestigious Edwardian motor race, an invitation to Sir Walter Scott's funeral and a traditional paisley shawl. \n\nCeramics specialist Lars Tharp reveals the secrets of an unusual ceramic jug and gives a colourful demonstration of its use, while the golden age of Edinburgh trade is celebrated with a rare chain of office steeped in history.\n\nAnd Little Jack Rabbit, a character made famous in American children's stories, also makes a special guest appearance, much to the delight of Hilary Kay","torrent":{"xt":"urn:btih:7408417e71e91227cafa79d324b5ffa8a9bc9dd3","amp;dn":"Antiques+Roadshow+S37E25","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7408417e71e91227cafa79d324b5ffa8a9bc9dd3","infoHashBuffer":{"type":"Buffer","data":[116,8,65,126,113,233,18,39,202,250,121,211,36,181,255,168,169,188,157,211]},"announce":[],"urlList":[]}}