{"title":"Egypt Visual Sourcebook (Art Ebook)","uid":12112300,"size":259874915,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:744ed2bb109e11b45088a14ddc9ab08a64759c00&amp;dn=Egypt+Visual+Sourcebook+%28Art+Ebook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"STBGD","files":1,"time":1436606623,"description":"Egypt Visual Sourcebook: For Artists, Architects, and Designers by Jim Hewitt\nEnglish | 2011 | ISBN: 9774164334 | 392 pages | PDF | 247 MB\n\nAn essential reference to Egypt's architectural heritage.\n\nThis unique visual reference guide will be an invaluable resource to professional designers-from architects to illustrators, production designers, art directors, decorators, film concept artists, sculptors, and painters. It utilizes color photographs to illustrate a wide range of locations and styles of architecture throughout Egypt, particularly highlighting universal architectural elements that may be incorporated into a variety of designs and styles including arches, doorways, windows, balconies, wall finishes, and more.\n\nPhotographic plates of modern and ancient Egypt, showing markets, buildings, temples, tombs, and daily life are cross-referenced with enlarged details and grouped for functional comparisons to cater to the various approaches a designer may take from conception to completion.\n\nWith some 1,000 color illustrations, thorough referencing, and detailed observation, this book will serve a very specific need while also appealing to a wider audience as a visual celebration of many aspects of Egypt, familiar and unfamiliar","torrent":{"xt":"urn:btih:744ed2bb109e11b45088a14ddc9ab08a64759c00","amp;dn":"Egypt+Visual+Sourcebook+%28Art+Ebook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"744ed2bb109e11b45088a14ddc9ab08a64759c00","infoHashBuffer":{"type":"Buffer","data":[116,78,210,187,16,158,17,180,80,136,161,77,220,154,176,138,100,117,156,0]},"announce":[],"urlList":[]}}