{"title":"Age of Empires III: The WarChiefs Expansion + Wallpaper Set","uid":12045738,"size":770963667,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:74d0c040db51551f6888fb6b8499c2a945344a21&amp;dn=Age+of+Empires+III%3A+The+WarChiefs+Expansion+%2B+Wallpaper+Set&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makierd","files":9,"time":1434893947,"description":"There are no major changes to the mechanics to Age of Empires III - players are still expected to gather resources, build armies and send them to attack opponents. Instead, there are a number of new concepts introduced, whilst existing concepts have been expanded. On some maps, copper and tin mines have been added, but these generally do not produce as much coin as the gold and silver mines. Sometimes the copper mines can produce 2000 coin, the same as silver, whereas gold mines produce 5000 coin.\n\nHome City shipments have been slightly reworked. Decks can now go over 20 cards by allowing one extra card for every ten levels of the Home City currently in use, up to a maximum of 25. There are new cards and a new Level 40 Home City tier of cards are available for all civilizations.\n\nWhile the Aztecs have a home city, the Iroquois and Sioux have five members of the Tribal Council: the Chief, the War Leader, the Shaman, the Wise Woman, and the Messenger. They all offer different units, supports, and improvements. The tribal council is present in the game when a native civilization advances in age (replacing the politician system of the European civilizations), the player can select to promote a candidate to the Tribal Council and this confers a bonus on the player. The candidates offer higher bonuses at later ages. Typically the type of bonus remains the same (extra units, bonus resources) and new candidates become available at higher home city levels.\n\nNew content[edit]\nPlayers must have the original Age of Empires III installed to make use of this expansion pack. The WarChiefs offers several enhancements on Age of Empires III. The enhancements include three new playable Native civilizations, new Home City cards, new buildings, a new single player campaign, additional units, additional minor civilizations and additional game concepts.\n\nEuropean civilizations can construct a new building called a Saloon to hire randomly available mercenaries as well as map specific human treasure guardian units. These units have a high price and a higher population count but are typically stronger than existing available units. The Saloon can be upgraded to a Dance Hall where Ronin Samurai can be recruited. All civilizations can build a Native Embassy. This building allows the training of allied minor civilization units at the embassy rather than at the trading post. Some tribes have the ability to allow Medicine Men to be trained from the Embassy which heal wounded units.\n\nA new victory condition has been added - the economic victory known as a monopoly. If a player or team controls the (majority) of trading posts on the map, whether on trade routes or at minor tribes, they have the option to purchase a monopoly. This begins a five-minute countdown that must be stopped by the opposing player or team by reducing the number of trade posts owned to below half. If the countdown completes, the player or team that purchased the monopoly wins the game. New trading posts cannot be constructed by the player/team attempting economic victory but damaged ones can be repaired. This option can be enabled or disabled before a game begins","torrent":{"xt":"urn:btih:74d0c040db51551f6888fb6b8499c2a945344a21","amp;dn":"Age+of+Empires+III%3A+The+WarChiefs+Expansion+%2B+Wallpaper+Set","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74d0c040db51551f6888fb6b8499c2a945344a21","infoHashBuffer":{"type":"Buffer","data":[116,208,192,64,219,81,85,31,104,136,251,107,132,153,194,169,69,52,74,33]},"announce":[],"urlList":[]}}