{"title":"Rachel Khoo's Kitchen Notebook - Rachel Khoo (epub) [MentalZero]","uid":12063688,"size":18752017,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:75ca3bfb1e1e6689e311d8ac0bc9f51e1d6c855f&amp;dn=Rachel+Khoo%27s+Kitchen+Notebook+-+Rachel+Khoo+%28epub%29+%5BMentalZero%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MentalZero","files":1,"time":1435345399,"description":"Bestselling author Rachel Khoo is on the go once again with her latest cookbook, Rachel Khoo's Kitchen Notebook. \n Her latest cookbook is packed to the brim with 100 standout recipes, full-colour photography and Rachel's very own sketches of the food and places she encounters. \n Out and about, she finds the most delicious fare, recording it all in her kitchen notebook. From a Ham Hock Tiffin Box to Slow Roasted Pork Belly with Sloe Gin, and Rhubarb and Custard Millefeuille, Rachel Khoo's Kitchen Notebook will inspire even the most jaded cook to try something new. \n After graduating from Central Saint Martin's College with a degree in Art and Design, British food writer Rachel was lured to Paris to study patisserie at Le Cordon Bleu. Rachel shot to fame when her TV series, The Little Paris Kitchen, was broadcast by the BBC. Her beautiful tie-in cookbook and the follow-up, My Little French Kitchen, have been published around the globe. Rachel now travels the world working on a variety of projects, including a weekly recipe column for the Evening Standard. \n &quot;Rachel Khoo is the queen of creating culinary masterpieces&quot;","torrent":{"xt":"urn:btih:75ca3bfb1e1e6689e311d8ac0bc9f51e1d6c855f","amp;dn":"Rachel+Khoo%27s+Kitchen+Notebook+-+Rachel+Khoo+%28epub%29+%5BMentalZero%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75ca3bfb1e1e6689e311d8ac0bc9f51e1d6c855f","infoHashBuffer":{"type":"Buffer","data":[117,202,59,251,30,30,102,137,227,17,216,172,11,201,245,30,29,108,133,95]},"announce":[],"urlList":[]}}