{"title":"DeathSmiles (Deluxe Edition) [Region: NTSC-U]","uid":10978105,"size":7838695473,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:75ccc0e4d753453802002fc03bddefb56866de7e&amp;dn=DeathSmiles+%28Deluxe+Edition%29+%5BRegion%3A+NTSC-U%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"zerodayz","files":-1,"time":1409843298,"description":" &lt;a href=&quot;http://image.bayimg.com/8510f252f090be8f35b6d26a2d6a24642305a8ac.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://image.bayimg.com/8510f252f090be8f35b6d26a2d6a24642305a8ac.jpg&lt;/a&gt;\n\nDeathSmiles is a 2D shooter in which hyper-sexualised 13-year-old gothic lolitas zip around the screen shooting sentient pumpkins and giant pig's heads.\n\nErrr.... (Checks the back of the box.) What country did you say this was from again? A free CRB check goes to anyone who correctly guessed 'Japan'.\n\nThis cutesy offering comes from Tokyo-based shoot-'em-up experts Cave, who have a small but devout following in the west. DeathSmiles isn't your typical Cave offering though.\n\nNot only is it that most unfashionable of beasts - a horizontally-scrolling shooter - but the action is positively sedate compared to intense 'bullet hell' Cave stablemates such as Mushihime-sama and Espgaluda II.\n\nIf you're looking for an accessible 'in' into the world of hardcore Japanese shoot-'em-ups, this is your calling.\n\nCAULDRON BENNETT\nDeathSmiles' main contribution to the genre is multi-way fire; your witch can fire both left and right, and the enemies too can emerge from either side of the screen.\n\nAlthough the game always gives you fair warning when and where incoming waves are coming from, it's still easy to get caught out if you spend too much time on the edge of the screen.\n\nAs such, if you want to trouble the business end of the leaderboards, you'll find that DeathSmiles tests your spatial skills more than your shooting skills, particularly as the autofire function slows down your, erm, 'craft'.\n\nAs with all good shooters, there are plenty of subtle nuances that encourage risk-taking to maximise your score (for instance, beaten foes drop lucrative 'counter-items', which force you to get close to your targets so you can pick them up on the first bounce).\n\nThe addition of the premium Black Label content (including a hellish 'Level 999' mode, for those who want to see their witch burn at the stake) will ensure that even the most skilled players are tested.\n\nBut buyers beware: the vast majority of you will struggle to see what the fuss is about. With infinite continues set up as default, the entire game can easily be completed in about half an hour.\n\nIf you're not the kind of person likely to retread trodden turf just for the sake of squeezing out a few extra zeros on the end of your score, DeathSmiles will feel like a complete rip-off.\n\nBut if you are score crazy, then it goes without saying that these witches will soon have you under your spell.\n &lt;a href=&quot;\nhttp://image.bayimg.com/c6949e14bc7d058004f01e4567665462340ca615.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/c6949e14bc7d058004f01e4567665462340ca615.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/3690d254faf95a09edfd1d404c5a190f0498f6ba.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/3690d254faf95a09edfd1d404c5a190f0498f6ba.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:75ccc0e4d753453802002fc03bddefb56866de7e","amp;dn":"DeathSmiles+%28Deluxe+Edition%29+%5BRegion%3A+NTSC-U%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75ccc0e4d753453802002fc03bddefb56866de7e","infoHashBuffer":{"type":"Buffer","data":[117,204,192,228,215,83,69,56,2,0,47,192,59,221,239,181,104,102,222,126]},"announce":[],"urlList":[]}}