{"title":"Antiques Roadshow S37E22","uid":11962318,"size":655991573,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7645c4bb56aecf86059d84fc24c87298c77ca165&amp;dn=Antiques+Roadshow+S37E22&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xela_5","files":1,"time":1432585244,"description":"Antiques Roadshow UK - S37E22\n\nThe Antiques Roadshow team visit Barrington Court in Somerset, where choice finds include a toy Noah's ark, an Elizabethan wine jug found in a car boot sale and a collection of ceramic brewery figures that are somewhat the worse for wear.\n\nIt's a busy late summer's day at Barrington Court, a Tudor manor house which has the distinction of being the first grand property bought by the National Trust. \n\nHilary Kay is enchanted by a toy model of Noah's ark from the 1920s, complete with pairs of animals, while pictures specialist Dendy Easton spots a valuable Flemish Old Master painted on copper.\n\nA boot-sale bargain turns out to be an Elizabethan wine jug decorated with the face of a bearded man, while a Â£12 charity shop bracelet dates back to the Victorian era. This episode's showstopper, though, is a 16th-century silver cup constructed around a carved coconut, complete with handles for greasy fingers.\n\nGlass specialist Andy McConnell puzzles over a vial of smelling salts with a mystery compartment, and Fiona Bruce commiserates with the owner of a collection of ceramic figures advertising a brewery company that met a sorry end after they first appeared on the Roadshow in 1993","torrent":{"xt":"urn:btih:7645c4bb56aecf86059d84fc24c87298c77ca165","amp;dn":"Antiques+Roadshow+S37E22","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7645c4bb56aecf86059d84fc24c87298c77ca165","infoHashBuffer":{"type":"Buffer","data":[118,69,196,187,86,174,207,134,5,157,132,252,36,200,114,152,199,124,161,101]},"announce":[],"urlList":[]}}