{"title":"Cross Ange - Tenshi to Ryuu no Rondo [480p batch]","uid":12099467,"size":1691542795,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:7653d90983c4a6ce9d5f8fe35a095c39d5b76d3e&amp;dn=Cross+Ange+-+Tenshi+to+Ryuu+no+Rondo+%5B480p+batch%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tim-ole","files":25,"time":1436261769,"description":"Cross Ange - Tenshi to Ryuu no Rondo, is an anime series... published from 2014 to 2015.\n\nthese videos haven't been encoded by me... i just put them together.\ncredits to encoder is included in the videos.\nthey are pretty good for their size ;-)\n\n\n\nplot:\n\nDue to humanity obtaining the data technology that has evolved to a great amount (called &quot;Mana&quot;) the human race is able to subjugate all wars, starvation, pollution, and other problems on Earth by using its power, which is similar to magic. Earth has obtained the utopia of complete peace and no wants.\n\nFirst princess of the Misurugi Empire, Angelize. As with everyone else, she also had no wants or worries. She was celebrated by the people of the empire, and was supposed to wear the crown. However, she realizes the shocking truth that she is a Norma. &quot;Norma&quot;: An irregular existence that cannot use Mana, and are treated as heretics and as &quot;things&quot; rather than people. Having everything stolen from her, she was thrown away on a remote island where she endured living a life in hell .\n\n\nP.S : that &quot;rape&quot; scene in episode 1 everybody is talking about... it's just a cavity search","torrent":{"xt":"urn:btih:7653d90983c4a6ce9d5f8fe35a095c39d5b76d3e","amp;dn":"Cross+Ange+-+Tenshi+to+Ryuu+no+Rondo+%5B480p+batch%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7653d90983c4a6ce9d5f8fe35a095c39d5b76d3e","infoHashBuffer":{"type":"Buffer","data":[118,83,217,9,131,196,166,206,157,95,143,227,90,9,92,57,213,183,109,62]},"announce":[],"urlList":[]}}