{"title":"Fifa Buggers Deightful Asian Film Star","uid":12013295,"size":906977290,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:7709feb66727d7bd26731105f7442602afa379ce&amp;dn=Fifa+Buggers+Deightful+Asian+Film+Star&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sarah.jensen","files":1,"time":1434259170,"description":"Manee shows all the contestants how to do it, how to look perfect. But she certainly don't want a bunch of cheap tarts showing her up. So Manee is showing everyone how to look fucking gorgeous and dignified with a cock ramming up her asshole. All the TV contestants should watch this, all the useless reality stars that she coaches. Manee shows everyone how to look good, all the paid off TV judges, all the rich young stars, and all the dirty street slappers that you enjoy here. Manee shows the lot, how to have the adorable face, a fit fuck off figure, and clean round and accessible genitals, and still face the camera looking good, using her eyes to smile, the inner fierceness (that should really be inner ferocity but who gives a shyte). This is it, this is how to do it, how to receive penis and ejaculate in her rectum and mouth. This is how to get buggered up the ass live on television in front of a world wife audience, and still look like butter don't melt. Semen don't melt. Some of the girls I get you do it for money, many do it because they enjoy and are addicted to sex. Manee does it because she is better than all the other girl. She can teach you, she can coach you, that is her job. Look at the camera and smile with your eyes, no matter who has got their penis up whatever hole. Anal sex is a medium showing off. Sperm dripping from her anal sphincter and piercing Asian blue eyes, high definition reality up her ass and down her throat","torrent":{"xt":"urn:btih:7709feb66727d7bd26731105f7442602afa379ce","amp;dn":"Fifa+Buggers+Deightful+Asian+Film+Star","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7709feb66727d7bd26731105f7442602afa379ce","infoHashBuffer":{"type":"Buffer","data":[119,9,254,182,103,39,215,189,38,115,17,5,247,68,38,2,175,163,121,206]},"announce":[],"urlList":[]}}