{"title":"Criticism of the Western Civilization - Collection 57 (Racism 3)","uid":12073108,"size":145024708,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:775c4e1c4dd837c237979a613d15a464a32d1157&amp;dn=Criticism+of+the+Western+Civilization+-+Collection+57+%28Racism+3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"moman73","files":35,"time":1435574644,"description":"Criticism of the Western Civilization - Collection 57 (Racism 3):\n\nWe have 35 titles here:\n\n-  Anderson - Benign Bigotry; the Psychology of Subtle Prejudice (2010)\n\n-  Birzer - Racial Profiling; They Stopped Me Because I'm --! (2013)\n\n-  Byfield - Savage Portrayals; Race, Media, &amp; the Central Park Jogger Story (2014)\n\n-  Collins - All Hell Broke Loose; American Race Riots from the Progressive Era through World War II (2012)\n\n-  Collins - Black Sexual Politics; African American, Gender, and the New Racism (2004)\n\n-  Deggans - Race-Baiter; How the Media Wields Dangerous Words to Divide a Nation (2012)\n\n-  Faux - The Servant Economy; Where America's Elite Is Sending the Middle Class (2012)\n\n-  Gordon - From Power to Prejudice; the Rise of Racial Individualism in Midcentury America (2015)\n\n-  Gotkowitz (Ed.) - Histories or Race and Racism; the Andes and Mesoamerica from Colonial Times to the Present (2011)\n\n-  Greene &amp; Gabbidon (Eds.) - Encyclopedia of Race and Crime (2009)\n\n-  Hall - An Historical Analysis of Skin Color Discrimination in America (2010)\n\n-  Holt - The Problem of Race in the 21st Century (2000)\n\n-  Horowitz - Inside the Klavern; the Secret History of a Ku Klux Klan of the 1920s (1999)\n\n-  Jackson (Ed.) - Race &amp; Racism; Essays in Social Geography (1987)\n\n-  Kennedy - The Klan Unmasked (1990)\n\n-  King &amp; Leonard - Beyond Hate; White Power and Popular Culture (2014)\n\n-  Kotkin - The New Class Conflict (2014)\n\n-  Lavalette &amp; Penketh (Eds.) - Race, Racism and Social Work; Contemporary Issues and Debates (2014)\n\n-  Loewen - Sundown Towns; a Hidden Dimension of American Racism (2005)\n\n-  Moore - Encyclopedia of Race and Racism, Vol. 1,a-f (2008)\n\n-  Moore - Encyclopedia of Race and Racism, Vol. 2, g-r (2008)\n\n-  Moore - Encyclopedia of Race and Racism, Vol. 3, s-z (2008)\n\n-  Nelson (Ed.) - Handbook of Prejudice, Stereotyping, and Discrimination (2009)\n\n-  Powell - Tree of Hate; Propaganda and Prejudices Affecting United States Relations with the Hispanic World (1971)\n\n-  Roediger - The Wages of Whiteness; Race and the Making of the American Working Class (2007)\n\n-  Slavet - Racial Fever; Freud and the Racial Question (2009)\n\n-  Tamura (Ed.) - The History of Discrimination in U.S. Education; Marginality, Agency, and Power (2008)\n\n-  Thane (Ed.) - Unequal Britain; Equalities in Britain Since 1945 (2010)\n\n-  Wallenstein - Tell the Court I Love my Wife; Race, Marriage, and Law - an American History (2002)\n\n-  Wang - Discrimination by Default; How Racism Becomes Routine (2006)\n\n-  Washington - Medical Apartheid; the Dark History of Medical Experimentation on Black Americans (2006)\n\n-  Weir - Class in America; An Encyclopedia (2007)\n\n-  Welshman - Underclass; a History of the Excluded Since 1880, 2e (2013)\n\n-  Wilson - Race, Racism and Development; Interrogating History, Discourse and Practice (2012)\n\n-  Winter - Dangerous Frames; How Ideas About Race &amp; Gender Shape Public Opinion (2008)","torrent":{"xt":"urn:btih:775c4e1c4dd837c237979a613d15a464a32d1157","amp;dn":"Criticism+of+the+Western+Civilization+-+Collection+57+%28Racism+3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"775c4e1c4dd837c237979a613d15a464a32d1157","infoHashBuffer":{"type":"Buffer","data":[119,92,78,28,77,216,55,194,55,151,154,97,61,21,164,100,163,45,17,87]},"announce":[],"urlList":[]}}