{"title":"Nuclear Security Culture","uid":12059563,"size":1541673,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:77b38a59ea1f0ca3850a9391fdb61b0396856203&amp;dn=Nuclear+Security+Culture&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1435217098,"description":"Nuclear Security Culture - From National Best Practices to International Standards -  I. Khripunov, N. Ischenko, J. Holmes (IOS Press, 2007).pdf\n\nISBN 9781586037864\n\nOver the past several years, the International Atomic Energy Agency (IAEA) has been working on a definition of nuclear security culture so that it can be used as a tool to improve the physical protection of nuclear materials and facilities. A 2001 IAEA report titled Fundamental Principles of Physical Protection of Nuclear Materials and Nuclear Facilities identified security culture as one of the twelve principles underlying fissile-material security. In February 2005, at a summit in Bratislava, President Bush and President Putin vowed to step up joint efforts to bolster nuclear security, pairing disciplined, well-trained, responsible custodians and protective forces with well-maintained security systems. In July 2005, a series of amendments to the Physical Protection Convention was approved elevating the status of security culture to that of a treaty obligation. Since that time, IAEA member states worked on a concept, definition and guidelines for developing and implementing a robust security culture at nuclear facilities worldwide. This NATO workshop presents the views of experts with the hope to contribute to the IAEAs work and facilitate nuclear security culture worldwide better. Issues include: Universality of nuclear security cultures; Nuclear security in a nations culture; Differences and similarities between regions such as US, European Union, Japan, etc.; and The advantages of similarities between the regions","torrent":{"xt":"urn:btih:77b38a59ea1f0ca3850a9391fdb61b0396856203","amp;dn":"Nuclear+Security+Culture","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77b38a59ea1f0ca3850a9391fdb61b0396856203","infoHashBuffer":{"type":"Buffer","data":[119,179,138,89,234,31,12,163,133,10,147,145,253,182,27,3,150,133,98,3]},"announce":[],"urlList":[]}}