{"title":"Polymer Brushes - Synthesis, Characterization, Applications","uid":11992656,"size":9383176,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:77f738a02edd0c27959486e2ef938b94ea019005&amp;dn=Polymer+Brushes+-+Synthesis%2C+Characterization%2C+Applications&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1433559953,"description":"ISBN 3527310339\n\nMaterials scientists, polymer chemists, surface physicists and materials engineers will find this book a complete and detailed treatise on the field of polymer brushes, their synthesis, characterization and manifold applications. In a first section, the various synthetic pathways and different surface materials are introduced and explained, followed by a second section covering important aspects of characterization and analysis in both flat surfaces and particles. These specific surface initiated polymerization (SIP) systems such as linear polymers, homopolymers, block copolymers, and hyperbranched polymers are unique compared to previously reported systems by chemisorption or physisorption. They have found their way in both large-scale and miniature applications of polymer brushes, which is covered in the last section. Such 'hairy' surfaces offer fascinating opportunities for addressing numerous problems of both academic and, in particular, industrial interest: high-quality, functional or protective coatings, composite materials, surface engineered particles, metal-organic interfaces, biological applications, micro-patterning, colloids, nanoparticles, functional devices, and many more. It is the desire of the authors that this book will be of benefit to readers who want to &quot;brush-up on polymers&quot;","torrent":{"xt":"urn:btih:77f738a02edd0c27959486e2ef938b94ea019005","amp;dn":"Polymer+Brushes+-+Synthesis%2C+Characterization%2C+Applications","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77f738a02edd0c27959486e2ef938b94ea019005","infoHashBuffer":{"type":"Buffer","data":[119,247,56,160,46,221,12,39,149,148,134,226,239,147,139,148,234,1,144,5]},"announce":[],"urlList":[]}}