{"title":"Lazy Swipe","uid":11968619,"size":629617,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:78991317283a80a4a422d7c7245e4ff2614aedfb&amp;dn=Lazy+Swipe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1432761406,"description":"Lazy Swipe can quickly connect applications and notifications setup with one hand\nIn any screen from the right / lower left corner of the Custom menu will open the sector and to find your applications and settings, the difference with other applications, Lazy Swipe is always hidden in siduachii. Swipe it when you need it.\nLazy Swipe one of the most popuryarogo applications in the list of tools on Google. Already Rekomendal 30 times in the main page of Google. Thanks to Google\n\nPROPERTIES\n\nâ˜… Unobtrusive:: Lazy Swipe appears and disappears only when you want it, never cluttering your beautiful desktop.\nâ˜… Reasonable: Lazy Swipe stores and skillfully distributes applications on your frequency of use in the past.\nâ˜… Lightweight: Lazy Swipe the size of a small (less than 1MB), optimized for purity and smoothness in use.\nâ˜… Favorites: Add 9 and set your favorite applications, so they are always at your fingertips.\nâ˜… tools: commonly used shortcuts and switches can also be accessed via a sliding finger. Easy on / off Flashlight, Wi-Fi, rotation lock and adjust the brightness of your screen. Your Android running slow? Accelerate the rate of purification of memory Android, using a tool to enhance the speed memory clearing &quot;Booster&quot;!\nâ˜… Notifications: You no longer have to use the phone with two hands, one supporting the other phone and opening the notification panel at the top of the screen. At the Lazy Swipe you can view and respond to your recent notification, using the twisting menu that you can open only one slide of a finger.\nâ˜… Topics: Lazy Swipe includes a variety of colorful themes to suit your desktop and your personality. Soon you expect exciting new themes!","torrent":{"xt":"urn:btih:78991317283a80a4a422d7c7245e4ff2614aedfb","amp;dn":"Lazy+Swipe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78991317283a80a4a422d7c7245e4ff2614aedfb","infoHashBuffer":{"type":"Buffer","data":[120,153,19,23,40,58,128,164,164,34,215,199,36,94,79,242,97,74,237,251]},"announce":[],"urlList":[]}}