{"title":"Heat Transfer in Industrial Combustion","uid":12006993,"size":12750294,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:78a9b64698760e2fb0e2ba2440c2d560db592ffc&amp;dn=Heat+Transfer+in+Industrial+Combustion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1433932289,"description":"ISBN 0849316995\n\nIndustry relies heavily on the combustion process. The already high demand for energy, primarily from combustion, is expected to continue to rapidly increase. Yet, the information is scattered and incomplete, with very little attention paid to the overall combustion system. Designed for practicing engineers, Heat Transfer in Industrial Combustion eclipses the extant literature with an emphasis on the aspects of heat transfer that directly apply to industry.\n\nFrom a practical point of view, the editor organizes relevant papers into a single, coherent resource. The book encompasses heat transfer, thermodynamics, and fluid mechanics, including the little-covered subjects of the use of oxygen to enhance combustion and flame impingement. Maximizing applications and minimizing theory, it covers modes of heat transfer, computer modeling, heat transfer from flame impingement, from burners, low temperature, high temperature, and advanced applications, and more.\n\nThe theoretical focus of most literature has created a clear need for a practical treatment of the heat transfer as it applies to industrial combustion systems. With detailed coverage and extensive references, Heat Transfer in Industrial Combustion fills this void","torrent":{"xt":"urn:btih:78a9b64698760e2fb0e2ba2440c2d560db592ffc","amp;dn":"Heat+Transfer+in+Industrial+Combustion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78a9b64698760e2fb0e2ba2440c2d560db592ffc","infoHashBuffer":{"type":"Buffer","data":[120,169,182,70,152,118,14,47,176,226,186,36,64,194,213,96,219,89,47,252]},"announce":[],"urlList":[]}}