{"title":"Door Kickers (v1.08) (GOG)","uid":12091263,"size":970429162,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:79ee814d3a13e2838a5e5e442389d9b59f17e0f4&amp;dn=Door+Kickers+%28v1.08%29+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"-Virtus-","files":5,"time":1436053163,"description":"About the game:\n================\nDoor Kickers is an innovative real-time strategy game that puts you in charge of a SWAT team and lets you command them during a tactical intervention. Analyze the situation, plan team routes, choose equipment, breach points and coordinate multiple troopers to reach the hostage room before the bad guys get to press that trigger.\nIt may sound daunting, and like real world CQB combat, it sure is. But most levels can be completed in minutes, and on the fly improvisation works. Achieving the perfect plan for getting the mission done with no false steps; that is a skill not easily mastered.\n\n\nFeatures:\n==========\n2D, Top Down for optimal tactical analysis\nReal time with free pause\nNo turns, no hexes, no action points or awkward interfaces\nRealistic and action packed\nNon-linear levels, freeform gameplay\nMission editor and modability\nUnlimited gameplay via mission and campaign generators\n\n\nVersion:\n=========\nGame version 1.08 or GOG setup 2.1.0.6, from June, 29 2015.\n\n\nVersion changes:\n=================\nChangelog for version 1.08 / GOG-6 (added 29.06.2015): \n\nFeatures: \n- New campaign, in celebration of the iPad release. \n- Two new shotguns. \n- Tablet mode: activate the new GUI and control scheme optimized for touchscreen displays and trackpads. \n- Added import/export save-games capability, to share progress between different platforms (PC-Mac-Linux-iOS). \n- Improved path-drawing smoothness on some maps. - Increased maximum zoom-in distance. \n\nFixes: \n- Saved plan no longer randomly reseting when restarting a mission. \n- Fixed incorrect window size when sometimes running in Windows8.1 (high-dpi scaling). - Fixed crash under certain conditions in the deploy screen. \n- Music is now looping after winning a mission. - Various fixes and improvements for many maps. - Issue where troopers could go through doors. \n- Bug where gocodes would get canceled. \n- Trackpad right-click emulation changed to Z (though now you should activate the Tablet mode option). \n- Various other improvements and fixes regarding GUI and gameplay. \n- Fixed starting resolution on Windows high-dpi devices.\n\n\nInstructions:\n==============\nIf you're installing for the first time then launch Setup and Install. Done! Play.\nPatch is there if you're patching already installed previous version (otherwise not needed)\nPlay - Enjoy - Seed!\n \n\nSystem Requirements:\n=====================\nMinimum\nOperating system: Windows XP SP3 \nProcessor: Intel Pentium IV 2.6 GHz or equivalent \nVideo card: An OpenGL 2.0 graphics adapter. NOT SUPPORTED: Intel GMA, Intel HD Graphics (1) or older. Resolution: 1366x768 minimum display resolution\nSystem memory: 2 GB RAM (1 GB recommended)\nHard disk drive: 2 GB available space \n\nRecommended\nOperating system: Windows 7\nProcessor: Intel Core 2 Duo or AMD Athlon 64 X2 5600+\nVideo card: NVidia Geforce 9xxx / AMD Radeon HD / IntelHD 3000 series or better, Resolution: 1920x1080\nSystem memory: 4 GB RAM (1 GB recommended)\nHard disk drive: 2 GB available space \n\n\n\n\n           If you enjoyed the game then share with others by seeding\n                       Remember to support quality games","torrent":{"xt":"urn:btih:79ee814d3a13e2838a5e5e442389d9b59f17e0f4","amp;dn":"Door+Kickers+%28v1.08%29+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79ee814d3a13e2838a5e5e442389d9b59f17e0f4","infoHashBuffer":{"type":"Buffer","data":[121,238,129,77,58,19,226,131,138,94,94,68,35,137,217,181,159,23,224,244]},"announce":[],"urlList":[]}}