{"title":"Doucette - The Douce Is Loose [1979][320 KBPS][Bonus Tracks]","uid":12010244,"size":115001861,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7bf7c6fd5e94a71510d109c1b7b22846d2da0d89&amp;dn=Doucette+-+The+Douce+Is+Loose+%5B1979%5D%5B320+KBPS%5D%5BBonus+Tracks%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"LameDuck69","files":16,"time":1434094309,"description":"------------------------------------------------------------\nDoucette - The Douce Is Loose [1979][320 KBPS][Bonus Tracks]\n------------------------------------------------------------\n\n\n01 Run Buddy Run\n02 Rita\n03 Someday\n04 Father Dear Father\n05 Nobody\n06 Before I Die\n07 All Over Me\n08 Further On Up The Road\n09 Follow Me [Bonus Track]\n10 All Around You [Bonus Track]\n-------------------------------\n**320 KBPS CBR\n**Cover Art\n-------------------------------\nJerry Victor Doucette (born 1952 in Montreal, Quebec) is a Canadian guitarist and singer-songwriter.\n\nBorn in Montreal, Quebec, Jerry Doucette's family moved to Hamilton, Ontario, when he was four. He received his first guitar when he was six.\n\nDoucette joined numerous bands prior to his solo career, starting with The Reefers, at the age of 11. He migrated to Toronto, Ontario, and played in the final incarnation of Brutus.[1] Doucette moved to Vancouver, British Columbia, in 1972. Doucette worked in bands with Lindsay Mitchell and Rocket Norton, both of whom later joined Prism. He subsequently signed a solo recording deal with Mushroom Records, and commenced recording under his surname only.\n\nMama Let Him Play, the single from the first Doucette album release of the same name, in the fall of 1977 earned platinum status (sales of 100,000 units) in Canada, plus substantial publicity and tour promotion. The single and record were not successful to the same degree in the United States, though the single charted in the Billboard Top 100 and the album in the Billboard 200. The recording band for the single and album was composed of Duris Maxwell on drums, Brent Shindell on guitar,. Don Cummings on bass and Robbie King on keyboards.\n\nThe following year's release The Douce is Loose was less successful, although it earned gold status (50,000 units sold) in Canada, and produced the popular single &quot;Nobody&quot; co-written with Maxwell.\n\nMushroom Records eventually succumbed to financial problems, leaving Doucette to find a new label for his third album, Coming up Roses. This, plus the emergence of new wave music, were blamed for Doucette's lack of follow-up success in the music industry.\n\nJerry Doucette currently resides in Tsawwassen, British Columbia","torrent":{"xt":"urn:btih:7bf7c6fd5e94a71510d109c1b7b22846d2da0d89","amp;dn":"Doucette+-+The+Douce+Is+Loose+%5B1979%5D%5B320+KBPS%5D%5BBonus+Tracks%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bf7c6fd5e94a71510d109c1b7b22846d2da0d89","infoHashBuffer":{"type":"Buffer","data":[123,247,198,253,94,148,167,21,16,209,9,193,183,178,40,70,210,218,13,137]},"announce":[],"urlList":[]}}