{"title":"How to Be Bohemian with Victoria Coren Mitchell s01e03 ENG SUBS","uid":12052233,"size":665738145,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7c71569bf2b7bb87aac7f378d5c70e6b67def187&amp;dn=How+to+Be+Bohemian+with+Victoria+Coren+Mitchell+s01e03+ENG+SUBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":4,"time":1435029692,"description":"How.to.Be.Bohemian.with.Victoria.Coren.Mitchell.s01e03.ENG.SUBS.WEBRIP\n\nFormat: MPEG-4\nSize: 832x468\nFrameRate: 25.00 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\nSeries Finale\n\nAre we all bohemian now or are none of us? Just one of the questions Victoria discusses with a colourful array of modern-day bohemians in the final episode of her series exploring unconventional living. This time she runs the post-war gamut from artist, drinker and sexual masochist Francis Bacon to the modern-day, latte-sipping hipster.\n\nThe birth of pop music and the sexual revolution spread bohemian values from an arty elite to ordinary folk in the suburbs. But were these watered down with mass take-up in the 1970s, becoming little more than a lifestyle choice, signalled perhaps by a taste for eccentric clothes, recreational drugs and a willingness to talk frankly about sex? Perhaps, Victoria wonders, it was punks who were the true bohemians of their day, because like their 19th-century French predecessors, they set out to shock. And she asks, were the new bohemians those who flamboyantly championed gay rights in the 1980s, then equally shocking to mainstream society?\n\nAnd what of today? Do today's artists and wannabe artists still identify with either the values or the pose of bohemians past? Or has the idea of the 'alternative' lifestyle, like everything else in our post-industrial culture, become a commodity to such an extent that the concept has been robbed of any value? Does a fine beard really signal a free spirit? Or is the life of the hipster worlds apart from those few daring individuals still determined to plough their own furrow?\n\nVictoria quizzes a range of entertaining and colourful interviewees over the course of the episode - hearing the hedonistic sexploits of artist Molly Parkin, uncovering the punk past of critic AA Gill, and asking former pop star-turned-vicar Richard Coles about his drug and sex-fuelled party years. She also talks to fine artists Grayson Perry and Maggi Hambling, drag artists Jonny Woo and the Virgin Xtravaganzah, poet John Cooper Clarke and writer Will Self. And she visits the squat where the self-styled 'Bohemians 4 Soho' are seeking to prevent corporate redevelopment of one of London's iconic music venues.\n\n[img]https://yuq.me/users/44/769/qyft4O3weB.png[/img]\n\n[img]https://yuq.me/users/44/769/97ix4lYSRB.jpg[/img]","torrent":{"xt":"urn:btih:7c71569bf2b7bb87aac7f378d5c70e6b67def187","amp;dn":"How+to+Be+Bohemian+with+Victoria+Coren+Mitchell+s01e03+ENG+SUBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c71569bf2b7bb87aac7f378d5c70e6b67def187","infoHashBuffer":{"type":"Buffer","data":[124,113,86,155,242,183,187,135,170,199,243,120,213,199,14,107,103,222,241,135]},"announce":[],"urlList":[]}}