{"title":"Naomi Murakawa -The First Civil Right (2014) [epub]","uid":12103144,"size":14245851,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7e34d82805d0e0d52a6ff8af6c0d082d414aa971&amp;dn=Naomi+Murakawa+-The+First+Civil+Right+%282014%29+%5Bepub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Eugene_Debs","files":3,"time":1436381686,"description":"The explosive rise in the U.S. incarceration rate in the second half of the twentieth century, and the racial transformation of the prison population from mostly white at mid-century to sixty-five percent black and Latino in the present day, is a trend that cannot easily be ignored. Many believe that this shift began with the &quot;tough on crime&quot; policies advocated by Republicans and southern Democrats beginning in the late 1960s, which sought longer prison sentences, more frequent use of the death penalty, and the explicit or implicit targeting of politically marginalized people. In The First Civil Right, Naomi Murakawa inverts the conventional wisdom by arguing that the expansion of the federal carceral state-a system that disproportionately imprisons blacks and Latinos-was, in fact, rooted in the civil-rights liberalism of the 1940s and early 1960s, not in the period after.\n\nMurakawa traces the development of the modern American prison system through several presidencies, both Republican and Democrat. Responding to calls to end the lawlessness and violence against blacks at the state and local levels, the Truman administration expanded the scope of what was previously a weak federal system. Later administrations from Johnson to Clinton expanded the federal presence even more. Ironically, these steps laid the groundwork for the creation of the vast penal archipelago that now exists in the United States. What began as a liberal initiative to curb the mob violence and police brutality that had deprived racial minorities of their 'first civil right-physical safety-eventually evolved into the federal correctional system that now deprives them, in unjustly large numbers, of another important right: freedom. The First Civil Right is a groundbreaking analysis of root of the conflicts that lie at the intersection of race and the legal system in America","torrent":{"xt":"urn:btih:7e34d82805d0e0d52a6ff8af6c0d082d414aa971","amp;dn":"Naomi+Murakawa+-The+First+Civil+Right+%282014%29+%5Bepub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e34d82805d0e0d52a6ff8af6c0d082d414aa971","infoHashBuffer":{"type":"Buffer","data":[126,52,216,40,5,208,224,213,42,111,248,175,108,13,8,45,65,74,169,113]},"announce":[],"urlList":[]}}