{"title":"StreetMeatAsia - Ink Pad","uid":12092606,"size":613554794,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:7e5e8d205262ebd5086666180ab996f501df28e1&amp;dn=StreetMeatAsia+-+Ink+Pad&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Ctrlme","files":1,"time":1436092645,"description":"Screenshot(s): &lt;a href=&quot;\nhttp://imgctrl.com/image/AJb&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/AJb&lt;/a&gt; &lt;a href=&quot;\nhttp://imgctrl.com/image/AJl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/AJl&lt;/a&gt;\n\nInk Pad comes from a good family, used to study hard and get good grades at school, and was friends with a local boy. When she discovered he had lots of girlfriends, she dropped him and started up with a foreign teacher. Her family called him a dirty foreigner, and dissuaded her from seeing him. This just alienated her from her family, and she grew closer to him, waiting for him to pick her up each evening. She believed she would eventually marry him, and loved him too much. After a few months, he started arriving with some rather rough looking friends. It turned out he owed a lot of money to them. She loved him, and agreed to help him if she could, although she herself did not have any money. So her life seamlessly changed from being respectable to hiring herself out to lowlife stinking beer breath foreigners, many with tattoos. Ink Pad never forgot her good upbringing, always smiled charmingly, and understood that a good tattoo should be as beautifully presented as a loving girl. She sucked off the tattoo artist in payment for her first tattoo. In fact, she has sucked him off a few times. Now she works competently on the street, and does not care about her old teacher boyfriend. She cares about any guy, dirty or smelly, so long as the appreciate her work of art figure","torrent":{"xt":"urn:btih:7e5e8d205262ebd5086666180ab996f501df28e1","amp;dn":"StreetMeatAsia+-+Ink+Pad","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e5e8d205262ebd5086666180ab996f501df28e1","infoHashBuffer":{"type":"Buffer","data":[126,94,141,32,82,98,235,213,8,102,102,24,10,185,150,245,1,223,40,225]},"announce":[],"urlList":[]}}