{"title":"The Smell of Football (2011).epub Gooner","uid":12051081,"size":470660,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8075aa882dfc8970b3a1c6bb2acb41eb386e6cd4&amp;dn=The+Smell+of+Football+%282011%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1434994457,"description":"Publisher: Vision Sports Publishing (August 1, 2011)\nLanguage: English\nISBN-10: 1907637141\nISBN-13: 978-1907637148\n\nWhen Mick Rathbone signed for Birmingham City as a 16 year-old apprentice he was living every schoolboy's dream. But when he discovered he was so nervous he was unable to speak, let alone pass the ball, in the presence of his boyhood hero and City star Trevor Francis, he realised that a career in football might not be everything he had imagined. The Smell of Football is the brutally honest and utterly unputdownable story of how 'Baz' conquered his personal demons to build a life in the game - from the terrified teenager who purposely tried to get injured in training rather than get picked for the first team, to the experienced pro who became Head of Medicine at Premier League Everton FC in charge of the treatment of the likes of Wayne Rooney, Louis Saha and Tim Cahill. Brilliantly written and packed with hilarious tales featuring a football 'who's who' cast of characters - from Sir Alf Ramsey and 'Big Sam' Allardyce to David Moyes, Duncan Ferguson and Rooney himself - The Smell of Football is an engrossing and moving memoir that covers every aspect of the professional game and gives an unprecedented insight into what life is really like at football's coalface","torrent":{"xt":"urn:btih:8075aa882dfc8970b3a1c6bb2acb41eb386e6cd4","amp;dn":"The+Smell+of+Football+%282011%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8075aa882dfc8970b3a1c6bb2acb41eb386e6cd4","infoHashBuffer":{"type":"Buffer","data":[128,117,170,136,45,252,137,112,179,161,198,187,42,203,65,235,56,110,108,212]},"announce":[],"urlList":[]}}