{"title":"Red Nose Day USA Special (2015)","uid":11955056,"size":1755248872,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8142f4ef6de6790c8a13cba7371549921b28f6cc&amp;dn=Red+Nose+Day+USA+Special+%282015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"aeolus15","files":1,"time":1432370796,"description":"For the community, this is a direct rip from NBC. 720p. Enjoy!\n\n---\n\nRed Nose Day, the U.K.'s #1 television fundraising event, has come to America in a spectacular live star-studded special on NBC.\n\nSeth Meyers, David Duchovny and Jane Krakowski will host &quot;Red Nose Day,&quot; NBC's star-studded charity event, while Ed Sheeran, Josh Groban, Christian Slater, Al Roker, Andy Cohen, Kellan Lutz and Kermit the Frog are joining the &quot;fun-raising&quot; special. Featuring great comedy, videos produced by Funny or Die, incredible music performances and almost 100 of Hollywood's favorite stars, the benefit event will help 12 charity organizations lift children and young people out of poverty in the U.S. and in some of the poorest communities in the world. Meyers, Duchovny and Krakowski will each host one hour of the three-hour live event happening at New York City's Hammerstein Ballroom.\n\nHollywood's biggest stars, including Julia Roberts, Will Ferrell, Jennifer Aniston, Reese Witherspoon, Jodie Foster, Jimmy Fallon, Neil Patrick Harris, Coldplay, Julianne Moore and Jack Black, will also appear, along with John Krasinski, Emily Blunt, Michelle Rodriguez, Gwyneth Paltrow, &quot;Voice&quot; coaches Adam Levine, Blake Shelton, Christina Aguilera and Pharrell Williams, Richard Gere, Jennifer Garner, Keith Urban, John Mellencamp, One Direction, Zac Efron, Helen Mirren, Robert Pattinson, Liam Neeson and Nick Cannon. Sienna Miller, Paul Rudd, Olivia Wilde, Eddie Redmayne, Benedict Cumberbatch, Sir Ian McKellen, Orlando Bloom, Leslie Mann, January Jones and Simon Cowell will also be joining the fun, as well as Matt Lauer, Carson Daly, Nick Offerman, Elizabeth Banks, Chris Pine, Jeff Goldblum, Billy Eichner, Martin Short, Laura Linney, Anna Kendrick, Sean &quot;P. Diddy&quot; Combs, John Michael Higgins, Bill and Melinda Gates, Stephen Merchant, Naomi Campbell, Anna Camp, Jeanne Tripplehorn, Yvette Nicole Brown, Retta, Natalie Morales, Danny Pudi and Rob Huebel.\n\nIn addition, Matt LeBlanc, Hugh Bonneville, Dame Diana Rigg, Kyle MacLachlan, Rose Byrne, Elisabeth Moss, &quot;Saturday Night Live&quot; cast members Jay Pharaoh, Colin Jost and Michael Che, Hoda Kotb and Gilbert Gottfried are slated to appear, along with Cheryl Burke, Nicole Scherzinger, Jeff Dye and Australian comedy sketch trio SketchShe.\n\nThe star-studded event for charity will also feature &quot;Game of Thrones&quot; cast members Kit Harington, Peter Dinklage, Iwan Rheon, Nikolaj Coster-Waldau, Emilia Clarke, Thomas Brodie-Sangster, Mark Addy, John Bradley, Rose Leslie, Alfie Allen and Charlotte Hope. &quot;Orange Is the New Black&quot; cast members Dascha Polanco, Samira Wiley, Yael Stone, Selenis Leyva, Lea DeLaria, Adrienne C. Moore and Jackie Cruz will also be part of the charity special.\n\nA sketch film documenting the creation of &quot;Game of Thrones: The Musical,&quot; written by Coldplay and featuring a number of the HBO show's cast members, will be one of the many highlights on &quot;Red Nose Day,&quot; along with John Mellencamp and Keith Urban performing &quot;Pink Houses.&quot;\n\nThe benefit event will also feature short appeal films that shed light on those in need. Jack Black travelled to Africa to visit children in Uganda living on the streets, witnessing firsthand the devastating effects of preventable diseases at a hospital. Blake Shelton visited a mobile health clinic in Los Angeles that is providing free, life-changing care to underprivileged children. In Peru, Michelle Rodriguez met children having to work to survive and saw how projects there are helping them get the education they need.\nNick Cannon will kick off the festivities with &quot;Red Nose Day Danceathon with Nick Cannon,&quot; streaming live on NBC.com beginning Wednesday, May 20. The &quot;America's Got Talent&quot; host will attempt to dance nonstop for 24 hours in honor of the inaugural Red Nose Day celebration in the United States, leading into the &quot;Red Nose Day&quot; telecast on Thursday, May 21. Streamed live from the NBC Experience Store at Rockefeller Center in New York City, the day of dance will be filled with guest DJs and musicians, celebrity drop-ins and a variety of dance acts and troupes. Viewers can support Cannon's endeavor through sponsorship and donation.\nThe money raised during Red Nose Day will be used to fund programs that address the immediate needs of children and young people living in poverty in the U.S. and internationally in Africa, Asia and Latin America. The money will be split between domestic and international poverty issues. The pre-selected charity partners are Boys &amp; Girls Clubs of America; charity: water; Children's Health Fund; Feeding America; Gavi, The Vaccine Alliance; the Global Fund; LIFT; National Council of La Raza; National Urban League; Oxfam America; Save the Children and United Way.\n\nIn the U.K., Red Nose Day has been a tradition for 30 years and is an inspiring cultural phenomenon that unites people from all walks of life in the interest of saving and changing lives across the globe. With superstar presenters and comedians, original sketch comedy, hilarious film parodies and amazing musical performances, Red Nose Day has been one of the BBC's highest-rated Friday night shows for many years and raised more than $1 billion in donations so far for organizations addressing poverty.\n\nCreated in 1985 by Oscar nominee and Emmy Award-winning writer-director-producer Richard Curtis (&quot;Four Weddings and a Funeral,&quot; &quot;Bridget Jones Diary,&quot; &quot;Notting Hill&quot;), Red Nose Day was built upon the foundation that mass media and celebrities can help raise money and increase awareness of poverty in order to save and change millions of lives.\n\nCurtis is an executive producer for the NBC telecast (a Universal Television production), along with Hamish Hamilton and Ian Stewart of Done and Dusted Productions. Henrietta Conrad and Lily Sobhani will also serve as executive producers, as will Mike Farah, Anna Wenger and Joe Farrell from Funny or Die. Hamilton is set to direct","torrent":{"xt":"urn:btih:8142f4ef6de6790c8a13cba7371549921b28f6cc","amp;dn":"Red+Nose+Day+USA+Special+%282015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8142f4ef6de6790c8a13cba7371549921b28f6cc","infoHashBuffer":{"type":"Buffer","data":[129,66,244,239,109,230,121,12,138,19,203,167,55,21,73,146,27,40,246,204]},"announce":[],"urlList":[]}}