{"title":"Linn Sondek LP12 vs budget table vs Supertable, FLAC metadata","uid":12306212,"size":418651095,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:831ffd550a1cf93faadf75dd6c23614499a89471&amp;dn=Linn+Sondek+LP12+vs+budget+table+vs+Supertable%2C+FLAC+metadata&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rontoolsie","files":17,"time":1440805009,"description":"Here are eight tracks recorded using three different turntables, designated A, B and C. \n\nOn seven of them the Linn Sondek (which is either deck A or deck B-you have to figure out) is compared against a well built but budget deck scored on eBay for $25. This budget deck was modified however for less than $20 in additional parts. Note that deck 'A' is consistently one of the tables, and all versions of A were made with the same turntable. Likewise table B. \n\nOne one of the tracks (St. James Infirmary by Louis Armstrong-which is probably the finest sounding recording of this compilation) I threw in on additional deck, so there is now an A, B and C version to compare and contrast. \n\nSo here you have it...three turntables varing from $25 to $30,000. \n\nWithout revealing at this point, which table was which I will give details..\n\nThe budget deck was equipped with a $2500 Lyra Helikon SL cartridge mounted into its own S-shaped tonearm, and plugged into a $15,000 custom built tube phono stage. \n\nThe Linn Sondek was fully Naimed-so it had their Armageddon power supply, the Aro tonearm, the Prefix-K built in phono stage, powered by a dedicated Supercap power supply. The output from the Naim 552 preamp was inputted into the same Yamaha CD-recorder. The LP12 was also fitted with the very same Lyra Helikon SL cartridge as the budget deck. \n\nThe Superdeck probably retails for in excess of $30,000 including a unipivot tonearm and exotic MC cartridge. It went into the same tube phono stage as the budget deck. \n\nI have embedded metadata in these FLAC tracks and removed the Bitcomet padding files, which was a problem with the earlier seed of this torrent","torrent":{"xt":"urn:btih:831ffd550a1cf93faadf75dd6c23614499a89471","amp;dn":"Linn+Sondek+LP12+vs+budget+table+vs+Supertable%2C+FLAC+metadata","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"831ffd550a1cf93faadf75dd6c23614499a89471","infoHashBuffer":{"type":"Buffer","data":[131,31,253,85,10,28,249,63,170,223,117,221,108,35,97,68,153,168,148,113]},"announce":[],"urlList":[]}}