{"title":"Bobby Seale - Seize the Time (pdf)","uid":12036021,"size":1470155,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:835ce1a9c5d8ab7b23ca1243342872cc8a67790e&amp;dn=Bobby+Seale+-+Seize+the+Time+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Eugene_Debs","files":1,"time":1434684885,"description":"\nNew Introduction by the Author\n\n\nSEIZE THE TIME was first published more than twenty years ago. I tape-recorded and wrote most of this book under the strain of being a political prisoner in the San Francisco County Jail in 1969 and 1970. At that time, most protest organizations, particularly anti-war and civil rights groups, were targeted for attacks by all levels of government. Seize The Time was published while I was incarcerated and a defendant in two major political trials-consecutive, racist, political trials that I eventually won.\n\nI am often told that Seize The Time is a 1960's protest-era classic. Whether it is indeed a classic or not, I am uncertain. However, I am certain that the Black Panther Party For Self-Defense, as it was originally called, founded during that era and depicted in this book, remains a classic example of African and African American people'' age-old resistance to racism and class oppression. Looking back on that era and thinking about all for our dedicated members through the years, it is clear to me that our &quot;do or die&quot; revolutionary methods in racist America provided a contemporary example of struggle for oppressed people the world over. More importantly, the Black Panther Party exposed institutionalized racism and further defined the phenomenon of white America's self-righteous and fascist absolutism. In effect, Seize The Time continues to have universal appeal as an account of an oppressed people's struggle for human liberation.\n\nStanding on our constitutional and democratic human rights, we made Malcolm X's philosophical polemics, &quot;the ballot or the bullet&quot; and &quot;by any means necessary,&quot; come alive. The Party initiated national Black community Survival Programs and &quot;working coalition&quot; politics with progressive white radical and people fo color organizations. Our work caused the late F.B.I. director J. Edgar Hoover to intensify the government's COINTELPRO (Counter Intelligence Program) attacks against the Party. These attacks on Panthers, on our homes and our offices, most often led by state and local police, were particularly vicious during the 1969. On December 4th of that year in Chicago, Fred Hampton and Mark Clark were murdered in their sleep during a police raid. Two days later, a telephone conversation between then-California governor Ronald Reagan and J. Edgar Hoover preceded the police attack on the Los Angeles Black Panther party office. A four-hour shoot-out ensued between Los Angeles Police and Black Panthers. These attacks were nothing more than the fascist pig power structure's attempt to terrorize us out of existence. But we weathered it and in city after city won the majority of our political trials. Tragically, twenty-five Panthers lost their lives and there are still Panthers locked away in prisons across the country doing hard time on charges manufactured by the government.\n\nSeize The Time is also about the co-founder of the Party, Huey P. Newton, during his political revolutionary glory days. Before Huey went to jail in 1967, there were only about seventy-five Black Panther party members and two chapters, Los Angeles and Oakland, California. When Huey came out in 1971, there were over forty-five chapters and five thousand dedicated and politically educated Black Panther party members. The statement has been made that the Party experienced its most dramatic growth when Huey was in jail. What is often missed in this statement is Huey's importance as a revolutionary political prisoner, a symbol for Black America and oppressed people around the world. Whatever difficulties may have come Huey's way in later years, I think he will probably be best remembered as I captured him in Seize The Time. On August 22, 1989, my friend and old comrade Huey was shot dead. Huey had not fallen victim to the many police guns and bullets nor the prison death houses we both had faced. Huey, had been killed by a young drug dealer. I am troubled by the question that if Huey P. Newton, who struggled against all odds in the sixties and seventies, could get caught up in the vicious cycle of Black community self-destruction, then were will this destruction end? Somebody has to deal with this; somebody has to deal with all of this self-destruction.\n\nAt this time more than ever we need activists who are motivated and dedicated to organizing people, raising consciousness and instilling self-respect and Black community love in African Americans. We especially need creative Black youth who know our history and who understand that Black Unity is the catalyst to help humanize this racist world. We need socially conscious activists who will work toward the economic empowerment of our people. We need activists who cross all ethnic and religious backgrounds and color lines who will establish civil and human rights for all, including the right to an ecologically balanced, pollution-free environment. We must create a world of decent human relationships where revolutionary humanism is grounded in democratic human rights for every person on earth. Those were the political revolutionary objectives of my old Black Panther Party. They must now belong to the youth of today","torrent":{"xt":"urn:btih:835ce1a9c5d8ab7b23ca1243342872cc8a67790e","amp;dn":"Bobby+Seale+-+Seize+the+Time+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"835ce1a9c5d8ab7b23ca1243342872cc8a67790e","infoHashBuffer":{"type":"Buffer","data":[131,92,225,169,197,216,171,123,35,202,18,67,52,40,114,204,138,103,121,14]},"announce":[],"urlList":[]}}