{"title":"S4 Informers (Area 51 &amp; UFO Alien Documentary)","uid":11976298,"size":3434272643,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:83c30f94b58e07d5ceb781074d57a66db83c756d&amp;dn=S4+Informers+%28Area+51+%26amp%3B+UFO+Alien+Documentary%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1433024383,"description":"The long-awaited release of the 1991 &quot;Connor O'Ryan&quot; testimony. \n\n\nA six-hour documentary by Under-Appreciated Science Productions \nfeaturing...\n \nWendelle C. Stevens \nwith special guest speakers \nRobert O. Dean \n&quot;Connor O'Ryan&quot; \nGem Cox \nand featuring testimony by \nBill Uhouse \nBob Lazar \nSteve Wilson \nRichard Boylan \nRichard Hoagland \nPhil Schneider \nJohn Lear \nand \nJim Dilettoso \n\n\nWe will let you know it all... \n\n\nFrom ufohypotheses.com: &quot;The latest documentary effort by Under-Appreciated Science Productions, called &quot;S-4 Informers&quot; (a six and one half hour long film) has just been finished after many long months of work by Rick Keefe. This documentary contains the first ever wide release of the Connor O'Ryan testimony, detailing the specifics of the above top secret laboratory installation within Area 51 known as S-4. Connor O'Ryan is the pseudonym of an S-4 sentry who defected, and approached Wendelle Stevens in the fall of 1991 and gave testimony as to the activities of certain high officials at the S-4 facility. S-4 rests inside the edge of the Papoose mountains that lay alongside the dry Papoose Lake. S-4 is located just a few miles southwest of the infamous Groom Lake Naval Air Base, for which Area 51 is most famous. However, S-4 is likely an even more secluded and guarded base than Groom Lake. This documentary presents the testimonies and circumstantial evidence regarding the highest extreme of classified secret activities of U.S. Navy scientists, engineers, guards, assassins, and certain government leaders and corporate executives that are conducting special ops missions and advanced experiments involving dangerous elements and energy sources out of the view of congressional oversight and public watchdogs. As well, it appears that a select clique of individuals, organizations, and corporations are profiting handsomely through seeding captured alien technology that has been back-engineered at S-4, then introduced into our society through companies of their choosing, rewarding those &quot;in the know&quot; handsomely, if not illegally, and unethically stunting the spread of this science to the world at large, choosing to keep it secret in order to benefit themselves financially and to promote their aspirations of greater power.&quot; \n\n\n\nAlso includes videos of Phil Schneider's public lectures.\n\n\n\nNone of this information is intended to be provided as true or false, and asks the viewer to draw there own conclusion.\n\n\n\nPlease Support This Torrent, Seed and Enjoy!","torrent":{"xt":"urn:btih:83c30f94b58e07d5ceb781074d57a66db83c756d","amp;dn":"S4+Informers+%28Area+51+%26amp%3B+UFO+Alien+Documentary%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83c30f94b58e07d5ceb781074d57a66db83c756d","infoHashBuffer":{"type":"Buffer","data":[131,195,15,148,181,142,7,213,206,183,129,7,77,87,166,109,184,60,117,109]},"announce":[],"urlList":[]}}