{"title":"1987 Canon Films Beauty And The Beast","uid":10951970,"size":4325270015,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8484d8cc3546823b00953b4d08f305e90e7ec7e7&amp;dn=1987+Canon+Films+Beauty+And+The+Beast&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"seksie","files":-1,"time":1409646413,"description":"1987 Beauty &amp; The Beast\n\nJohn Savage - Beast / Prince\nRebecca De Mornay - Beauty\n\nPlot\nIn a Renaissance-style kingdom, a wealthy merchant lives an affluent life with his two sons, Oliver and Frederick, and three daughters, Bettina, Isabella and Beauty. Beauty is the &quot;caretaker&quot; of her family; without her, none of the family can look after themselves, and she is constantly taking care of her siblings. Despite this, she is not frustrated, but wonders what she would do with her life if she did not devote it to her family.\n\nAfter the merchant loses his wealth in a tempest at sea, the family must renounce their luxurious life and move to the countryside, with Beauty once again taking charge. After a time, the family hear that their wealth may be returned, for a ship has made it to port. To celebrate, the father promises his children gifts of luxury, but Beauty merely wants a rose. The merchant realises it was a lost cause, for he is still as poor as he was when he left, and returns. He stops off at a beautiful castle where an unseen host treats him to good food and a warm bed. However, the old man plucks a rose from the garden, and the host demands that Beauty come live with him as punishment. Beauty moves to the castle, and is alone for the first time in her life. Therefore, she realises what she wants to do with her life, and realises that the Beast is not a complete monster.\n\n\n\n\nMOVIE IS IN MKV FORMAT\n\n**************PLEASE SEED AT LEAST 24 HOURS THANK YOU*******************","torrent":{"xt":"urn:btih:8484d8cc3546823b00953b4d08f305e90e7ec7e7","amp;dn":"1987+Canon+Films+Beauty+And+The+Beast","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8484d8cc3546823b00953b4d08f305e90e7ec7e7","infoHashBuffer":{"type":"Buffer","data":[132,132,216,204,53,70,130,59,0,149,59,77,8,243,5,233,14,126,199,231]},"announce":[],"urlList":[]}}