{"title":"Charlie Cochet - THIRDS Book 4 Rise and Fall","uid":11990098,"size":253446031,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:849d7aec6759c75692b0a3baf4c5492b7c25cc70&amp;dn=Charlie+Cochet+-+THIRDS+Book+4+Rise+and+Fall&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"katelynor","files":2,"time":1433483939,"description":"Written by: Charlie Cochet\nNarrated by: Mark Westfield\nLength: 8 hrs and 47 mins\nUnabridged Audiobook\n\nTHIRDS, Book 4 - Sequel to Rack &amp; Ruin\n\nAfter an attack by the Coalition leaves THIRDS Team Leader Sloane Brodie critically injured, agent Dexter J. Daley swears to make Beck Hogan pay for what he's done. But Dex's plans for retribution are short-lived. With Ash still on leave with his own injuries, Sloane in the hospital, and Destructive Delta in the Coalition's crosshairs, Lieutenant Sparks isn't taking any chances. Dex's team is pulled from the case, with the investigation handed to Team Leader Sebastian Hobbs. Dex refuses to stand by while another team goes after Hogan, and decides to put his old HPF detective skills to work to find Hogan before Theta Destructive, no matter the cost.\n\nWith a lengthy and painful recovery ahead of him, the last thing Sloane needs is his partner out scouring the city, especially when the lies - however well-intentioned - begin to spiral out of control. Sloane is all too familiar with the desire to retaliate, but some things are more important, like the man who's pledged to stand beside him. As Dex starts down a dark path, it's up to Sloane to show him what's at stake, and finally put a name to what's in his heart","torrent":{"xt":"urn:btih:849d7aec6759c75692b0a3baf4c5492b7c25cc70","amp;dn":"Charlie+Cochet+-+THIRDS+Book+4+Rise+and+Fall","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"849d7aec6759c75692b0a3baf4c5492b7c25cc70","infoHashBuffer":{"type":"Buffer","data":[132,157,122,236,103,89,199,86,146,176,163,186,244,197,73,43,124,37,204,112]},"announce":[],"urlList":[]}}