{"title":"Grand Theft Auto V (v1.0.350.1) + Extras","uid":12091935,"size":65895804482,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8642a1d38cf5c6d026d0daa130a4cb52952234fe&amp;dn=Grand+Theft+Auto+V+%28v1.0.350.1%29+%2B+Extras&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"relentlesstech","files":4,"time":1436073284,"description":"Developed by series creator Rockstar North, Grand Theft Auto V is the largest and most ambitious title in the series to date. Grand Theft Auto V delivers a world of unprecedented scale and detail bursting with life, from mountaintops to the depths of the ocean. Los Santos: a sprawling sun-soaked metropolis full of self-help gurus, starlets and fading celebrities, once the envy of the Western world, now struggling to stay afloat in an era of economic uncertainty and cheap reality TV. Amidst the turmoil, three very different criminals plot their own chances of survival and success: Franklin, a former street gangster, now looking for real opportunities and serious money; Michael, a professional ex-con whose retirement is a lot less rosy than he hoped it would be; and Trevor, a violent maniac driven by the chance of a cheap high and the next big score. Running out of options, the crew risks everything in a series of daring and dangerous heists that could set them up for life.\n\n    Los Santos &amp; Blaine County - The largest open world yet by far, spanning vastly diverse cultural and geographical areas, the entire world of Grand Theft Auto V is open from the very beginning of the game to explore. Visitors to the greater metropolis of Los Santos and the countryside of Blaine County will encounter faded celebrities, meth heads, party people, violent gangs, hikers, bikers and every other manner of colorful denizen. You'll be able to traverse from the tops of the mountains, through the streets of Los Santos, to the depths of the ocean floor.\n    Three playable protagonists - Michael, Franklin and Trevor may live in different parts of town, have their own issues, attitudes, lifestyles, desires and goals - but they know how to work together. They have their own unique skillsets to bring to the table when it's time to get the job done. Michael is a veteran bank robber, and an expert with the kind of knowledge that only comes from years as a successful career criminal. A former street gangster now looking for real opportunities and serious money, Franklin works as a repo man for an Armenian luxury car dealership that runs scams on ambitious young hotshots, selling them expensive cars they can't afford. Not interested in living by anyone else's rules, Trevor's a habitual drug user and extremely volatile individual that's prone to destructive outbursts and violent rampages.\n    'Recreational' Activity - Grand Theft Auto V is not just massive in scale, but will offer more to get into than ever before. Play a bit of golf or tennis, zen out with yoga or cycle the countryside. Parachute over the city, or customize your Cheetah and take it to the streets to race suckers for money. Or earn cash the old fashioned way, by taking it - whether by ripping off liquor stores or by buying and taking over businesses that will earn you dividends. Even minding your own business having a stroll you may find yourself off on a wild misadventure you never expected.\n\n    ESRB Rating: MATURE with Blood and Gore, Mature Humor, Strong Language, Nudity, Strong Sexual Content, Use of Drugs and Alcohol, and Intense Violence\n\n**********************************************************************************\n\nINSTALLATION:\n\nNOTE: Due to image sizes, the ISOs must be mounted for installation! WinISO is recommended.\n\nIn order to make this I copied all the files from a legitimate GTAV installation (including registration keys), and created an MSI installer which will:\n\n1. Install all files that come with a legitimate GTAV install (base copy).\n2. Once the main files are installed, the installer will proceed to run Rockstar Social Club setup (GTAV cannot be played online when cracked, but Social Club is necessary for several registry entries).\n3. After the Social Club installation, setup will continue to install official GTAV updates (there are six in all).\n4. The last step will be to install DirectX 9c, which is VERY IMPORTANT! Do not skip this step!\n\nOnce the setup is finished, be sure to apply the no-CD crack to play!\nAlso, never allow GTAV or Social Club to access the internet!\n\nNote: Do not use the shortcut created by the installer on the Desktop - Once you copy the no-CD files, create a shortcut to the 3DM launcher instead.\n\nI did not include the crack in the installer simply because no-CD cracks more often than not tend to throw off 'false-positives', and I would rather not have my efforts to make installing and playing the game easier thwarted by over-protective antiviruses!\n\n*** PLEASE BE KIND, AND SEED! ***","torrent":{"xt":"urn:btih:8642a1d38cf5c6d026d0daa130a4cb52952234fe","amp;dn":"Grand+Theft+Auto+V+%28v1.0.350.1%29+%2B+Extras","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8642a1d38cf5c6d026d0daa130a4cb52952234fe","infoHashBuffer":{"type":"Buffer","data":[134,66,161,211,140,245,198,208,38,208,218,161,48,164,203,82,149,34,52,254]},"announce":[],"urlList":[]}}