{"title":"Caffeine: Chemistry, Analysis, Function and Effects","uid":12090206,"size":11396477,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:86a7614567112a25116b4d503953f28db50f2a78&amp;dn=Caffeine%3A+Chemistry%2C+Analysis%2C+Function+and+Effects&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mdusanjay","files":1,"time":1436024643,"description":"Caffeine: Chemistry, Analysis, Function and Effects By Victor R. Preedy\n\n2012 | 442 Pages | ISBN: 1849733678 | PDF | 11 MB\n\n\n\nCaffeine is known to stimulate the central nervous system but what other functions does it have? This book covers the latest scientific knowledge in a uniquely structured format and is specifically designed to link chemistry with health and nutrition to provide a broad, appealing book. Coverage begins with caffeine in relation to nutrition focussing on beverages, then concentrates on chemistry, crystal structures of complexes in caffeine and biochemistry. In the analysis chapters, assays are conducted by LC-MS, capillary electrophoresis, automated flow methods and immunoassay methods. The effects of caffeine on the brain, cognitive performance, sleep, oxidative damage, exercise and pulmonary function are all considered in the closing section of the book. Delivering high quality information, this book will be of benefit to anyone researching this area of health and nutritional science. It will bridge scientific disciplines so that the information is more meaningful and applicable to health in general. Part of a series of books, it is specifically designed for chemists, analytical scientists, forensic scientists, food scientists, dieticians and health care workers, nutritionists, toxicologists and research academics. Due to its interdisciplinary nature it could also be suitable for lecturers and teachers in food and nutritional sciences and as a college or university library reference guide","torrent":{"xt":"urn:btih:86a7614567112a25116b4d503953f28db50f2a78","amp;dn":"Caffeine%3A+Chemistry%2C+Analysis%2C+Function+and+Effects","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86a7614567112a25116b4d503953f28db50f2a78","infoHashBuffer":{"type":"Buffer","data":[134,167,97,69,103,17,42,37,17,107,77,80,57,83,242,141,181,15,42,120]},"announce":[],"urlList":[]}}