{"title":"Leonard Cohen - Dear Heather (2004) [2014_Qobuz 24-44,1]","uid":11823157,"size":542749305,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:86e1eb720dc27a9d5336b4a49600cc6935ecf5e6&amp;dn=Leonard+Cohen+-+Dear+Heather+%282004%29+%5B2014_Qobuz+24-44%2C1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sidmal","files":16,"time":1429315407,"description":"Leonard Cohen - Dear Heather (2004/2014)\n FLAC (tracks) 24-bit/44,1 kHz | Time - 48:55 minutes | 544 MB\nStudio Master, Official Digital Download | Artwork: Front cover\n\n Dear Heather is the eleventh studio album by Canadian singer-songwriter Leonard Cohen, released by Columbia Records in 2004. It shows a further departure from Ten New Songs, with more female lead singing and a marked increase in read poetry over sung lyrics, two of these being poems by other writers.\n\n\n There is an air of finality on Leonard Cohen's Dear Heather. Cohen, who turned 70 in September of 2004, offers no air of personal mortality -- thank God; may this elegant Canadian bard of the holy and profane live forever. It nonetheless looks back -- to teachers, lovers, and friends -- and celebrates life spent in the process of actually living it. The album's bookend tracks provide some evidence: Lord Byron's bittersweet &quot;Go No More A-Roving,&quot; set to music and sung by Cohen and Sharon Robinson (and dedicated to Cohen's ailing mentor, Irving Layton), and a beautifully crafted reading of country music's greatest lost love song, &quot;Tennessee Waltz.&quot; Cohen's voice is even quieter, almost whispering, nearly sepulchral. The tone of the album is mellow, hushed, nocturnal. Its instrumentation is drenched in the beat nightclub atmospherics of Ten New Songs: trippy, skeletal R&amp;B and pop and Casio keyboard- and beatbox-propelled rhythm tracks are graced by brushed drums, spectral saxophones, and vibes, along with an all but imperceptible acoustic guitar lilting sleepily through it all. But this doesn't get it, because there's so much more than this, too. That said, Dear Heather is Cohen's most upbeat offering. Rather than focus on loss as an end, it looks upon experience as something to be accepted as a portal to wisdom and gratitude. Women permeate these songs both literally and metaphorically. Robinson, who collaborated with Cohen last time, is here, but so is Anjani Thomas. Leanne Ungar also lends production help. Cohen blatantly sums up his amorous life in &quot;Because Of&quot;: &quot;Because of a few songs/Wherein I spoke of their mystery/Women have been exceptionally kind to my old age/They make a secret place/In their busy lives/And they say, 'Look at me, Leonard/Look at me one last time.'&quot; &quot;The Letters,&quot; written with Robinson, who sings in duet, is a case in point, reflecting on a past love who has been &quot;Reading them again/The ones you didn't burn/You press them to your lips/My pages of concern...The wounded forms appear/The loss, the full extent/And simple kindness here/The solitude of strength.&quot; &quot;On That Day&quot; is a deeply compassionate meditation on the violence of September 11 where he asks the question: &quot;Did you go crazy/Or did you report/On that day....&quot; It is followed by the spoken poem &quot;A Villanelle for Our Time,&quot; with words by Cohen's late professor Frank Scott that transform these experiences into hope. &quot;We rise to play a greater part/The lesser loyalties depart/And neither race nor creed remain/From bitter searching of the heart....&quot; On &quot;There for You,&quot; with Robinson, Cohen digs even deeper into the well, telling an old lover that no matter the end result of their love, he was indeed there, had shown up, he was accountable and is grateful. Cohen quotes his own first book, The Spice Box of Earth, to pay tribute to the late poet A.M. Klein. &quot;Tennessee Waltz&quot; is indeed a sad, sad song, but it is given balance in Cohen's elegant, cheerful delivery. If this is indeed his final offering as a songwriter, it is a fine, decent, and moving way to close this chapter of the book of his life.  \n\n\nTracklist:\n\n 01 - Go No More A-Roving\n 02 - Because Of\n 03 - The Letters\n 04 - Undertow\n 05 - Morning Glory\n 06 - On That Day\n 07 - Villanelle for Our Time\n 08 - There for You\n 09 - Dear Heather\n 10 - Nightingale\n 11 - To a Teacher\n 12 - The Faith\n 13 - Tennessee Waltz (Live at Montreux Jazz Festival)","torrent":{"xt":"urn:btih:86e1eb720dc27a9d5336b4a49600cc6935ecf5e6","amp;dn":"Leonard+Cohen+-+Dear+Heather+%282004%29+%5B2014_Qobuz+24-44%2C1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86e1eb720dc27a9d5336b4a49600cc6935ecf5e6","infoHashBuffer":{"type":"Buffer","data":[134,225,235,114,13,194,122,157,83,54,180,164,150,0,204,105,53,236,245,230]},"announce":[],"urlList":[]}}