{"title":"Henry Flynt - Raga Electric (1963-1971) [Flac]","uid":11958014,"size":120171900,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:86f49cbd5792cec58e3c0d23673bfd077096e42b&amp;dn=Henry+Flynt+-+Raga+Electric+%281963-1971%29+%5BFlac%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"celsoinc","files":4,"time":1432495008,"description":"Release Date June 7, 2002\nDuration32:37\nGenre\nAvant-Garde\nPop/Rock\nStyles\nExperimental\nRecording Date  1963 - 1971\n\n\n\nThis retrospective is a sunny afternoon's dig around the musical archaeological site, in which surprising Flynt \n\nhandicrafts are unearthed. Not quite the majestic temple of the extended works issued on the Recorded label, these are \n\npieces that nonetheless provide illumination into other things the man was capable of during his experimental music days. \n\nThe disc's title piece may ultimately not be something a listener will return to again and again, other than to perhaps \n\nprovide an example to curious guests about what might be one of the most extreme recordings ever made. The vocal on this \n\nselection will arouse curiosity even among those hearing it all the way on the other side of a large house, if only \n\nbecause it is a vocal performance that resembles nothing else ever released. The same cannot really be said for the \n\nelectric guitar playing that accompanies this sometimes horrifying vocal; what sounds like (but might not be) a pair of \n\ndouble-tracked guitars, slightly out of tune in junior's garage band mode, take a very simplistic approach to Indian raga \n\nindeed. Play the track for Indian classical musicians, and they will inevitably laugh it right out of the room. &quot;Free \n\nAlto&quot; is where he goes for it on saxophone, getting right into screaming overtones with the kind of conceptual \n\nforthrightness that marks the extreme solos of players such as Roscoe Mitchell and Marshall Allen. It is only the \n\nflabbiness of some of the pitches Flynt attempts that gives away his primitive technique on the saxophone, and to some \n\nears the music would sound much better, screams included, if that weren't the case. This track may wind up being a \n\nlaudable accomplishment in search of an audience, as the horn torture freaks who like this kind of stuff are probably \n\ngoing to say they prefer listening to the well-established heroes. OK, listen to a performance by a hornman in the latter \n\ncategory and this one side by side -- please. Not only will it be good clean fun, but surprised sax snobs may admit Flynt \n\nmore than holds his own. Click back to the opening third of the set for the best music, however. &quot;Marines Hymn&quot; is the \n\nnewest piece, the only one from the '70s and despite its title a haunting non-military work, again raga-influenced. With \n\nslight string accompaniment, Flynt turns in a concentrated and quite moving vocal performance, and this time the Indian \n\nmusicians listening will nod in approval. A set of four short pieces entitled &quot;Central Park Transverse Vocal&quot; is the high \n\npoint of Raga Electric. Knowing Flynt, there must be more to the concept than just showing up in one of those Central Park \n\ntunnels and recording weird vocals, but even if that's all this is about, it is a set of sublime moments on the trail of a \n\nvisionary spirit captured up to his eyebrows in creativity, as usual","torrent":{"xt":"urn:btih:86f49cbd5792cec58e3c0d23673bfd077096e42b","amp;dn":"Henry+Flynt+-+Raga+Electric+%281963-1971%29+%5BFlac%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86f49cbd5792cec58e3c0d23673bfd077096e42b","infoHashBuffer":{"type":"Buffer","data":[134,244,156,189,87,146,206,197,142,60,13,35,103,59,253,7,112,150,228,43]},"announce":[],"urlList":[]}}