{"title":"The Great War of Our Time - al Qa'ida to ISIS (ebook)","uid":11977846,"size":3817504,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:88226dc8d25357feca4a47875aa97d75a40505f0&amp;dn=The+Great+War+of+Our+Time+-+al+Qa%27ida+to+ISIS+%28ebook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"heliiaruy","files":1,"time":1433093207,"description":"The Great War of Our Time: The CIA's Fight Against Terrorism--From al Qa'ida to ISIS\n\nby Michael Morell (Author) \n\n ISBN: 1455585661\n\nCalled the &quot;Bob Gates of his generation&quot; by Politico, Michael Morell was a top CIA officer who played a critical role in the most important counterterrorism events of the past two decades. Morell was by President Bush's side on 9/11/01 when terrorists struck America and in the White House Situation Room advising President Obama on 5/1/11 when America struck back-killing Usama bin Ladin. From the subway bombings in London to the terrorist attacks in Benghazi, Morell always seemed to find himself on the cusp of history.\n\nA superb intelligence analyst and briefer, Morell now presents THE GREAT WAR OF OUR TIME, where he uses his talents to offer an unblinking and insightful assessment of CIA's counterterrorism successes and failures of the past twenty years and, perhaps most important, shows readers that the threat of terrorism did not die with Bin Ladin in Abbottabad. Morell illuminates new, growing threats from terrorist groups that, if unaddressed, could leave the country vulnerable to attacks that would dwarf 9/11 in magnitude.\n\nHe writes of secret, back-channel negotiations he conducted with foreign spymasters and regime leaders in a desperate attempt to secure a peaceful outcome to unrest launched during the &quot;Arab Spring.&quot; Morell describes how efforts to throw off the shackles of oppression have too often resulted in broken nation states unable or unwilling to join the fight against terrorism.\n\nAlong the way Morell provides intimate portraits of the leadership styles of figures ranging from Presidents Bush and Obama, CIA directors Tenet, Goss, Hayden, Petraeus, Panetta, and Brennan, and a host of others","torrent":{"xt":"urn:btih:88226dc8d25357feca4a47875aa97d75a40505f0","amp;dn":"The+Great+War+of+Our+Time+-+al+Qa%27ida+to+ISIS+%28ebook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88226dc8d25357feca4a47875aa97d75a40505f0","infoHashBuffer":{"type":"Buffer","data":[136,34,109,200,210,83,87,254,202,74,71,135,90,169,125,117,164,5,5,240]},"announce":[],"urlList":[]}}