{"title":"The Everything Guide to Writing Your First Novel","uid":12018778,"size":1081325,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8925045dd640c9bdeb5eb331ff9d8a12b893305d&amp;dn=The+Everything+Guide+to+Writing+Your+First+Novel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ZamKhan","files":1,"time":1434367497,"description":"For an aspiring novelist, nothing is more intimidating than a blank page or computer screen. This step-by-step guide helps you get past that hurdle, start writing, and cross the finish line to first draft in only twenty-six weeks! This guide covers the entire novel-writing process--from polishing an idea to finding an agent and submitting to publishers.\n\nThis practical guide takes you through the ins and outs of writing and publishing your first book, including how to:\n\nCreate authentic characters, engaging plotlines, and believable settings\nEdit for tone, structure, and pacing\nFind the right agent\nMarket and sell your work to publishers\nBuild a career as a novelist\nComplete with writing exercises, inspiring examples, and expert advice from bestselling novelists, this book is an excellent starting place for anyone interested in the art, craft, and business of writing fiction.\n\nAbout the Author\nHallie Ephron is an award-winning book reviewer for the Boston Globe and the author of six novels, including Never Tell a Lie, and of two books about books, including The Bibliophile's Devotional. She also wrote the Edgar-nominated Writing and Selling Your Mystery Novel: How to Knock 'Em Dead with Style. An avid reader of novels of all kinds, Ephron teaches at several writing conferences and workshops","torrent":{"xt":"urn:btih:8925045dd640c9bdeb5eb331ff9d8a12b893305d","amp;dn":"The+Everything+Guide+to+Writing+Your+First+Novel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8925045dd640c9bdeb5eb331ff9d8a12b893305d","infoHashBuffer":{"type":"Buffer","data":[137,37,4,93,214,64,201,189,235,94,179,49,255,157,138,18,184,147,48,93]},"announce":[],"urlList":[]}}