{"title":"The Upperfloor-tUF-37855 Cherry Torn, Juliette March, Mickey Mod","uid":12041649,"size":4133595706,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:89877ddfad13525352a51289d740956b70f667c4&amp;dn=The+Upperfloor-tUF-37855+Cherry+Torn%2C+Juliette+March%2C+Mickey+Mod&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":174,"time":1434799231,"description":"\nCherry Torn: Alpha Sex Slave Returns to Train Anal Rookie\n\nJun 19, 2015 - Performers: Cherry Torn ,  Mickey Mod  and  Juliette March \n\n\nMed, Hi and HD MP4 + Pics.\n\n\nCherry Torn, the bombshell Alpha Slave from the original House Staff, returns to brutalize, humiliate, and fuck a domestic servant gone astray. Juliette March grovels and begs to have her throat fucked and her lithe body put in chains and anally punished. Truly Cherry Torn serves The House on her back like no other and begs to cum as the Butler gives her a strict ass fucking on his hard dick as Juliette licks his shoes clean. \n\nCherry Torn is called in on short notice to correct a domestic slave, Juliette March, who has fallen astray and used wire hangers to store a guest's fur jacket. Back in her cuff and collar, Cherry attends to her lesser slave, who is bound tightly and left suffering with a vibrator tied to her sore clit. Cherry wastes no time using the object of offense to beat Juliette pink and red and coax another painful orgasm out of her destroyed pussy. When the Butler finds them a little too noisy, Cherry yanks Juliette to a squat and teaches her how you apologize to senior staff properly: with a strict throat fucking and oral service. \n\nJuliette's punishment is by no means done, and the next scene finds her stripped of her stockings and in in chains on the bathroom floor scrubbing the urinals with a face gag. Cherry and The Butler have fallen into cahoots and torment Juliette with a butt plug and a whip, while continually dousing the urinal she is cleaning with fresh piss to clean. Cherry is a perverse bitch, and clamps Juliette's pink pussy shut with clover clamps and gets The Butler rock hard before inviting him to invade Juliette's open asshole. Fucked on the bathroom floor in chains, Juliette swears she will never disrespect the guests again. Horney Cherry Torn is no longer listening as The Butler feeds her his dick fresh from Juliette's ass. The only thing that will satisfy Cherry now is a begging screaming orgasm from Juliette. \n\nBack in the lounge Cherry and Juliette gives the floor a much needed scrubbing, until The Butler returns with a horrible news for Cherry Torn. His shoes have been left horribly scuffed with pussy juice and as senior slave she is to pay. He takes her huge jiggling ass for a hard spanking that leaves her a deep scarlet. Juliette has been keeping Cherry's asshole and cheeks glistening with spit. As any filthy Butler should, Mr. Mod decides to spear Cherry's ass on his hard cock and allow Juliette to clean his shoes with her cunt. Both girls ride their posts well, and once again the Floor is visited by the familiar sight of Cherry Torn's desperate cumming face. \n\nFinal service of the day leaves Cherry and Juliette on their backs begging for dick and getting a proper face fucking. Both slaves submit to being slapped around and begging for orgasms and the violent use of their holes at the hands of the Butler. Truly the return of Cherry Torn to House Service is a blessing for Juliette, who has clearly fallen into line and is rewarded with a hot load of cum on her bush.\n\nScreens &lt;a href=&quot;\nhttp://www.theupperfloor.com/site/shoot/37855-Cherry-Torn-Alpha-Sex-Slave-Returns-to-Train-Anal-Rookie.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theupperfloor.com/site/shoot/37855-Cherry-Torn-Alpha-Sex-Slave-Returns-to-Train-Anal-Rookie.html&lt;/a&gt;\n\nUploaded by Merzedes and Shallow2\n\n18 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\n\nJust keep on leaving us the nice comments below and we are happy :)\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttps://yuq.me/users/23/079/W2kwa6hEeP.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://yuq.me/users/23/079/W2kwa6hEeP.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg&lt;/a&gt;\n\nCheers :-)","torrent":{"xt":"urn:btih:89877ddfad13525352a51289d740956b70f667c4","amp;dn":"The+Upperfloor-tUF-37855+Cherry+Torn%2C+Juliette+March%2C+Mickey+Mod","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89877ddfad13525352a51289d740956b70f667c4","infoHashBuffer":{"type":"Buffer","data":[137,135,125,223,173,19,82,83,82,165,18,137,215,64,149,107,112,246,103,196]},"announce":[],"urlList":[]}}