{"title":"The Dream Machine (2001), by M. Mitchell Waldrop [DjVu]","uid":11832973,"size":5774047,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:89dfc15d6516c403f557ef8b9dd93bb45dad687a&amp;dn=The+Dream+Machine+%282001%29%2C+by+M.+Mitchell+Waldrop+%5BDjVu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bey0nd","files":1,"time":1429654493,"description":"The Dream Machine: J.C.R. Licklider and the Revolution That Made Computing Personal\n\n\nIn 1962, decades before &quot;personal computers&quot; and &quot;Internet&quot; became household words, the revolution that gave rise to both of them was set in motion from a small, nondescript office in the depths of the Pentagon. In an age when the word &quot;computer&quot; still meant a big, ominous mainframe mysteriously processing punch cards, the occupant of that office-an MIT psychologist named J.C.R. Licklider-had somehow seen a future in which computers would become an exciting new medium of expression, a joyful inspiration to creativity, and a gateway to a vast on-line world of information. And now he was determined to use the Pentagon's money to make it all happen.\n\nWritten with the novelistic flair that made his Complexity &quot;the most exciting intellectual adventure story of the year&quot; (Washington Post), M. Mitchell Waldrop's The Dream Machine is the first full-scale portrait of J.C.R. Licklider and how his dream of a &quot;human-computer symbiosis&quot; changed the course of science and culture. But more than that, it is an epic saga of technological advance that spans the history of modern computers from the Second World War to the explosion of creativity at Xerox PARC in the 1970s to the personal computer boom of the 1980s and the Internet boom of the 1990s. Capturing the drama, passion, and excitement of the brilliant men and women who were caught up in one of the great intellectual and technological adventures in human history, The Dream Machine has the hallmarks of a classic.\n\n-------------------------------------\nSeries: Sloan Technology\nHardcover: 528 pages\nPublisher: Viking Adult; 1st edition (August 2001)\nLanguage: English\nISBN-10: 0670899763\nISBN-13: 978-0670899760","torrent":{"xt":"urn:btih:89dfc15d6516c403f557ef8b9dd93bb45dad687a","amp;dn":"The+Dream+Machine+%282001%29%2C+by+M.+Mitchell+Waldrop+%5BDjVu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89dfc15d6516c403f557ef8b9dd93bb45dad687a","infoHashBuffer":{"type":"Buffer","data":[137,223,193,93,101,22,196,3,245,87,239,139,157,217,59,180,93,173,104,122]},"announce":[],"urlList":[]}}