{"title":"Karen Marie Moning - Iced (Fever Series Book 6)","uid":11989202,"size":853352447,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8a1fb80cbf443cb191f16f48f368c865c6f69195&amp;dn=Karen+Marie+Moning+-+Iced+%28Fever+Series+Book+6%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"katelynor","files":3,"time":1433456611,"description":"Iced: A Dani O' Malley Novel, Book 1\n\nWritten by: Karen Marie Moning\nNarrated by: Phil Gigante, Natalie Ross\nLength: 14 hrs and 51 mins\nSeries: Fever, Book 6\nUnabridged Audiobook\n\nDani &quot;Mega&quot; O?Malley plays by her own set of rules - and in a world overrun by Dark Fae, her biggest rule is: Do what it takes to survive. Possessing rare talents and the all-powerful Sword of Light, Dani is more than equipped for the task. In fact, she?s one of the few humans who can defend themselves against the Unseelie. But now, amid the pandemonium, her greatest gifts have turned into serious liabilities.\n\nDani?s ex?best friend, MacKayla Lane, wants her dead, the terrifying Unseelie princes have put a price on her head, and Inspector Jayne, the head of the police force, is after her sword and will stop at nothing to get it. What?s more, people are being mysteriously frozen to death all over the city, encased on the spot in sub-zero, icy tableaux.\n\nWhen Dublin?s most seductive nightclub gets blanketed in hoarfrost, Dani finds herself at the mercy of Ryodan, the club?s ruthless, immortal owner. He needs her quick wit and exceptional skill to figure out what?s freezing Fae and humans dead in their tracks - and Ryodan will do anything to ensure her compliance.\n\nDodging bullets, fangs, and fists, Dani must strike treacherous bargains and make desperate alliances to save her beloved Dublin - before everything and everyone in it gets iced.\n\nPlease seed and enjoy!","torrent":{"xt":"urn:btih:8a1fb80cbf443cb191f16f48f368c865c6f69195","amp;dn":"Karen+Marie+Moning+-+Iced+%28Fever+Series+Book+6%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a1fb80cbf443cb191f16f48f368c865c6f69195","infoHashBuffer":{"type":"Buffer","data":[138,31,184,12,191,68,60,177,145,241,111,72,243,104,200,101,198,246,145,149]},"announce":[],"urlList":[]}}