{"title":"Superman Post-Crisis Chronology, Volumes 001-010","uid":12052349,"size":3282938798,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:8b40e1d7d2d3c0f9a78cfe50d16d4e1b690da548&amp;dn=Superman+Post-Crisis+Chronology%2C+Volumes+001-010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"CeraKesh","files":11,"time":1435038778,"description":"A remastered version of the Superman Post-Crisis Chronology found on various torrent sites.  Rather than an unwieldy dump of thousands of issues that are meticulously numbered and ordered (and whose filenames screw with modern comic reader parsers), the Chronology is presented as a series of ad-hoc collections with a simple volume ordering.  I'll be releasing these in series of 10 volumes a piece.\n\nAs with previous releases of this chronology, strict chronology order has been followed as close as possible, though some flexibility and &quot;grain of salt&quot; needs to be used for proper interpretation.  Books have been culled from a variety of sources and all credit goes to the original scanners/rippers.\n\nThis torrent includes volumes 1-10, covering the history of Krypton and the House of El as well as the Kent family history in the late 19th century, continuing on to the destruction of Krypton in the 1930s and Kal-El's arrival and birth on Earth about 25 years before the modern age, his life before becoming Superman and his public debut.  The silver and bronze age Post-Crisis interpretations are detailed with as much material as is available (there are other Superman adventures referred to throughout the body of the work but these were never fully detailed post-Crisis, so they are likely close to the original pre-Crisis events with the changes of Crisis applied).  Finally, the Modern Age picks back up in volume 10 which includes Superman v2 #1 and continues from there","torrent":{"xt":"urn:btih:8b40e1d7d2d3c0f9a78cfe50d16d4e1b690da548","amp;dn":"Superman+Post-Crisis+Chronology%2C+Volumes+001-010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b40e1d7d2d3c0f9a78cfe50d16d4e1b690da548","infoHashBuffer":{"type":"Buffer","data":[139,64,225,215,210,211,192,249,167,140,254,80,209,109,78,27,105,13,165,72]},"announce":[],"urlList":[]}}