{"title":"The Anthony Cumia Show 2015-06-08 Rapeity Rape Rape MP4 MP3","uid":12005674,"size":339907997,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8b693c37cdec9a23a9342bdc8b4947c5481c03f7&amp;dn=The+Anthony+Cumia+Show+2015-06-08+Rapeity+Rape+Rape+MP4+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mothergoose58","files":2,"time":1433868245,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nEpisode 175 - &quot;Rapeity Rape Rape&quot;; A brand new week commences with Anthony talking about being on Greg Gutfeld's new show (or was he?) and catching a Yankees game over the weekend, he then gets into a news story about a woman hit by a broken bat, Seinfeld hating on PC kids, and we get an update on &quot;mattress girl&quot; and spoiler alert; it includes porn. Ant discusses crossing the line from sex to rape, the callers get in on the rape convo, we take a look at Monday's mail, read an article about &quot;the new normal&quot;, talk about tolerating tolerance, Clint Eastwood getting into hot water for referencing Caitlyn Jenner, and check out some throwback fashion with subliminal advertising. We get a history lesson on Charlie Brown and the bat shit guy who voices him, find out that Seth MacFarlane is psychic, go through a list of celebs that somehow avoided 9/11, and TACS wraps with Ant's take on the newest non-compliance cop story and video out of Texas and by looking at a surprise clip from The Five on Fox.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:8b693c37cdec9a23a9342bdc8b4947c5481c03f7","amp;dn":"The+Anthony+Cumia+Show+2015-06-08+Rapeity+Rape+Rape+MP4+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b693c37cdec9a23a9342bdc8b4947c5481c03f7","infoHashBuffer":{"type":"Buffer","data":[139,105,60,55,205,236,154,35,169,52,43,220,139,73,71,197,72,28,3,247]},"announce":[],"urlList":[]}}