{"title":"WWE Unfiltered with Renee Young S01E04 720p AVCHD-SC-SDH","uid":11966181,"size":291224941,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:8ce7d8b69c876f29405d4ff4b7685ba14bcf2e6c&amp;dn=WWE+Unfiltered+with+Renee+Young+S01E04+720p+AVCHD-SC-SDH&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SCSA420","files":4,"time":1432715938,"description":"StoneCold420 presents another High Quality 720p H264 release for the wrestling fans around the world here exclusively on KickAss Torrents and The Pirate Bay.\n\n\nWWE Unfiltered with Renee Young S01E04 720p AVCHD-SC-SDH\n\n\n\nWWE Unfiltered with Renee Young \nS01E04\nMay 26, 2015\n\n\nIn the 4th episode of Unfiltered, Renee Young hangs out with King Bad News Barrett for a fun and revealing conversation.\n\n\nThis is SDH release #1,769 for the wrestling fans from a wrestling fan. First aired and captured from HDMI in H264 AVCHD at 8,000 kbps from the 16:9 widescreen 1280 x 720p HD resolution source on 05/26/2015 on the PS4 WWE Network Live channel. Framerate is 29.970 with an average Video Bitrate of 4,500 kbps in a High Quality 277 MB 720p H264 AVCHD MP4 release with 48khz 320 kbps AAC 2 channel stereo audio the show runtime is 7:59\n\n\nThis is my 1,039th official H264 AVCHD 720p release. Enjoy the show in 720p WWE wrestling fans. \n\nThis release is in H264 AVCHD MP4 format with AAC 2 channel stereo audio. This release is playable with Sony Playstation 3, Xbox 360, Samsung Galaxy S III smartphones, iPhone, iPad, VLC player as well as Media Player Classic, Windows Media Player, and any other devices capable of playing 720p HD MP4 video files with AAC 2 channel stereo audio.\n\nIf you want this show in MKV format it is easy to convert it from MP4 to MKV using MKVtoolnix 2.2.0 (MKVmerge 2.2.0) which you can download from here: http://www.bunkus.org/videot...2/mkvtoolnix-2.2.0-setup.exe\n\nHere's how to do it: Download and install MKVMerge (Use link above). It is a free program that allows you to take video and audio files and convert them into MKV files on the fly, making it a very quick conversion.\n\nOpen MKVMerge on your computer, and you will be greeted by its home menu. Click the &quot;Add&quot; button that is near the top of the program, and a new window will appear giving you access to your computer's files. Locate your MP4 video files and select them. Press &quot;Open,&quot; and it will load into MKVMerge.\n\nPress the &quot;Browse&quot; button at the bottom of the program, and a window will appear. Locate a place on your computer to save the new MKV file after it is created. Once you have found a place, click &quot;Save&quot; to save the location. Click the &quot;Start Muxing&quot; button at the bottom of the program and your MKV file will be created. Depending on the size of the file, it could take a few minutes. Once it is finished locate the MKV file after the program congratulates you on the conversion and play it as you would any other video file.\n\nTo ensure that you can get proper MKV playback after the mkv conversion be sure you have installed the K-lite codec pack full version or mega version both of which comes with Media Player Classic Home Cinema and configure it properly for .mkv playback. If you do not have it you can get it here below: \n &lt;a href=&quot;\nhttp://www.free-codecs.com/download/K_Lite_Codec_Pack.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.free-codecs.com/download/K_Lite_Codec_Pack.htm&lt;/a&gt; \n\nOnce installed you can playback the .mkv or .mp4 file with the following players:\n\nMedia Player Classic or Windows Media Player. \n\n\nEnjoy the WWE Unfiltered show WWE wrestling fans and thanks for downloading my WWE Unfiltered with Renee Young S01E04 720p AVCHD-SC-SDH release.\n\n\nUploaded by SCSA420 on KickAss Torrents and The Pirate Bay\n\n\nATTENTION: PLEASE FEEL FREE TO UPLOAD MY RELEASES ANYWHERE BUT DON'T ADD YOUR NAME TO MY HARD WORK and IF this show is uploaded on XWT then please keep the folder and files as they are and DO NOT RENAME the files or retag them with another name!!! Thank You!!!\n\nI work on my own so that I get all the credit for my hard work each and every week!!! \n\nBest Played With Media Player Classic or VLC Player \n\n\nStoneCold420\nSmackDownHotel\nMay 26, 2015\n\n\nFor SC-SDH releases find me on KAT at:\nand The Pirate Bay at: https://thepiratebay.se/user/SCSA420\n\n\nPlease check out the WrestleReaction show on http://WrestleReaction.net","torrent":{"xt":"urn:btih:8ce7d8b69c876f29405d4ff4b7685ba14bcf2e6c","amp;dn":"WWE+Unfiltered+with+Renee+Young+S01E04+720p+AVCHD-SC-SDH","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ce7d8b69c876f29405d4ff4b7685ba14bcf2e6c","infoHashBuffer":{"type":"Buffer","data":[140,231,216,182,156,135,111,41,64,93,79,244,183,104,91,161,75,207,46,108]},"announce":[],"urlList":[]}}