{"title":"Mary Berrys Absolute Favourites-S01E03-WebDL-HD-x264","uid":11974092,"size":523779427,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:8e0fab6e2787f05dc93597540824f468ca96ed1f&amp;dn=Mary+Berrys+Absolute+Favourites-S01E03-WebDL-HD-x264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"uggauga","files":2,"time":1432959962,"description":"Episode 3\n\nIn this delightful six-part series, the nation's best-loved home cook draws on her wealth of cookery know-how to share a selection of her absolute favourite recipes. Each episode, Mary draws inspiration from a favourite place, one where she loves to spend time, and cooks up tried and tested crowd pleasers as well as a bounty of new dishes that are easy to make, yet guaranteed to impress all your family and friends.\n\nIn this episode, Mary takes inspiration from the herb garden. Only dried herbs were available when Mary started cooking, but these days there are an abundance of fresh herbs that can turn an ordinary dish into something spectacular. First up, Mary demonstrates her favourite summer salad - watermelon and feta with lashings of fresh mint - before turning her hand to her grandchildren's favourite comfort dish of succulent tomato and herb meatballs. Her pesto lemon chicken is easy to assemble and is perfect for a summer lunch or light dinner, as is another of Mary's dinner party favourites - salmon, potato and prawn salad platter.\n\nAs well as planting herbs with her granddaughters, Mary visits the Dairy in Clapham, south London, where the chef Robin Gill opens Mary's eyes to new ways of using fresh herbs. She finishes by adding a herby twist to her all-time favourite cake - a lemon drizzle cake, which she flavours with fresh lemon verbena from her garden","torrent":{"xt":"urn:btih:8e0fab6e2787f05dc93597540824f468ca96ed1f","amp;dn":"Mary+Berrys+Absolute+Favourites-S01E03-WebDL-HD-x264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e0fab6e2787f05dc93597540824f468ca96ed1f","infoHashBuffer":{"type":"Buffer","data":[142,15,171,110,39,135,240,93,201,53,151,84,8,36,244,104,202,150,237,31]},"announce":[],"urlList":[]}}