{"title":"The Context of Scripture (Volumes 1-3) by William W. Hallo [EPUB","uid":12043963,"size":3421342,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8e1c80d22cca91e6380dcda75bd9b4896b381c20&amp;dn=The+Context+of+Scripture+%28Volumes+1-3%29+by+William+W.+Hallo+%5BEPUB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"realOfek","files":4,"time":1434842893,"description":"&quot;The Context of Scripture&quot; illuminatingly presents the multi-faceted world of ancient writing that forms the colorful background to the literature of the Hebrew Bible. Designed as a thorough and durable reference work for all engaged in the study of the Bible and the ancient Near East, and involving 63 of the world's outstanding scholars in the field, it provides reliable access to a broad, balanced and representative collection of Ancient Near Eastern texts that have some bearing on the interpretation of the Bible. Translations of recently discovered texts are included, alongside new translations of better-known texts and in some cases the best existing translations of such texts. The substantial three-volume work, with its specially designed page layout and large format, features full cross-referencing to comparable Bible passages, and new, up-to-date bibliographical annotations with judicious commentary. Its many distinct advantages over other collections will ensure the place of &quot;The Context of Scripture&quot; as a standard reference work for the 21st century.\n\nNote: These EPUB files are directly from the publisher. Also, included is a detailed chart comparing this to &quot;Ancient Near Eastern Texts Relating to the Old Testament&quot;","torrent":{"xt":"urn:btih:8e1c80d22cca91e6380dcda75bd9b4896b381c20","amp;dn":"The+Context+of+Scripture+%28Volumes+1-3%29+by+William+W.+Hallo+%5BEPUB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e1c80d22cca91e6380dcda75bd9b4896b381c20","infoHashBuffer":{"type":"Buffer","data":[142,28,128,210,44,202,145,230,56,13,205,167,91,217,180,137,107,56,28,32]},"announce":[],"urlList":[]}}