{"title":"Runtastic Pro 5.0.6","uid":12012521,"size":20559910,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:8e4cdaa63450c681b59023b0bfd73ee6311408c8&amp;dn=Runtastic+Pro+5.0.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ariloc","files":1,"time":1434239665,"description":"Take your fitness to a new level with Runtastic PRO - the best running, fitness &amp; tracking app! Runtastic PRO uses GPS to map &amp; track your sports and fitness activities, such as: running, jogging, biking or walking. The Runtastic PRO app tracks your cardio workout progress (time, distance, elevation change, speed, calories &amp; more) to help you reach your training goals. Join us and become part of a global fitness community that is fun &amp; motivational, whether you're looking to improve your health, build up your cardio endurance, or train for a marathon! Runtastic PRO is a great fit for users of all fitness levels.\n\nPRO FEATURES:\n- Voice feedback during workout: Get audio feedback for each mi or km completed\n- LIVE tracking: Show friends where you are, what you've accomplished\n- Cheering: Live cheers &amp; messages from friends = motivation to run further\n- Heart rate zone training &amp; analysis: Choose a heart rate zone to optimize training (i.e. fat burning zone)\n- Split table with dynamic mile and km splits\n- Calorie goal: Set a specific calorie goal and use voice feedback to reach your workout goal\n- Pace goal: Define your favorite pace and tailor training accordingly\n- Geotagging: Take pictures during exercise &amp; view photos online with your map trace\n- Weather, temp. &amp; sunrise/sunset data to assist with scheduling &amp; analysis of training sessions\n- Ad free\n\nFEATURES:\n- Map your workout in real-time with built-in GPS and monitor your workout progress (time, distance, speed, pace, calories, altitude, etc.)\n- Personal workout diary and metrics - Mapping: Detailed live mapping and historic mapping of previous training sessions (Google Maps)\n- Dashboard configuration: Display preferred training statistics\n- Graphs: Get charts with altitude, pace, speed, and heart rate info from your jog / run - Performance analysis with lap times\n- Enjoy your cardio workouts with the integrated music player\n- Accurate calculation of elevation gain and loss\n- Manual entry of workouts: Add treadmill, spinning, and weight lifting workouts\n- Monthly and overall metrics for distance, number of workouts, duration, and calories\n- Share your sports activities on Google+, Facebook, and Twitter\n\nSave workouts to Runtastic.com and join our online fitness community. You'll get further exercise data analysis, coaching and comparisons with friends! All these benefits can help you stay motivated while striving to reach your fat burning, cardio training and overall health &amp; wellness goals","torrent":{"xt":"urn:btih:8e4cdaa63450c681b59023b0bfd73ee6311408c8","amp;dn":"Runtastic+Pro+5.0.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e4cdaa63450c681b59023b0bfd73ee6311408c8","infoHashBuffer":{"type":"Buffer","data":[142,76,218,166,52,80,198,129,181,144,35,176,191,215,62,230,49,20,8,200]},"announce":[],"urlList":[]}}