{"title":"The Anthony Cumia Show 2015-04-15 Tom McCaffrey MP4 MP3","uid":11818964,"size":331008301,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8f8673823f818c62f7a75a2bcf4a829328aa7366&amp;dn=The+Anthony+Cumia+Show+2015-04-15+Tom+McCaffrey+MP4+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mothergoose58","files":2,"time":1429207434,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest(s): Tom McCaffrey\n\nEpisode 146 - Today's TACS starts by discussing the news story regarding a postal worker landing his gyrocopter outside the U.S. Capitol and the backstory of what his agenda was, we watch a new Alex Jones video, and sex it up with a story about a naked Twister playing mama. Ant then talks about a server losing his job because of the way he described customers on a receipt, an officer giving an underage drinker the chance to get out of a ticket by playing rock, paper, scissors, see part of the unsuccessful SpaceX landing as well as a &quot;deadly force&quot; police dash cam video, take a look at Seinfeld dolls, and watch Jenny Hutt making a douchetastic Periscope video. We also hear about the newest protest in NY focused on police brutality, a McDonald's automated machine, Obama on Jimmy Kimmel, and Ant relocates to the &quot;table of the stars&quot; to sit with Tom McCaffrey. The guys talk about his film &quot;Adventures in Comedy&quot;, and his comedy CD &quot;Streets Aren't Watching&quot;, going out to the movies versus screening them at home, they engage in a ton of movie chat, and wax about the old days of New York. The guys then talk about gun laws, the responsibility that comes with owning a gun, death threats due to ones ideology, past sketchy issues they have had personally, finding new friends as you get older, Ari Shaffir, and the show ends with the complete video of SpaceX's landing and with some bonus movie chat.\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:8f8673823f818c62f7a75a2bcf4a829328aa7366","amp;dn":"The+Anthony+Cumia+Show+2015-04-15+Tom+McCaffrey+MP4+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f8673823f818c62f7a75a2bcf4a829328aa7366","infoHashBuffer":{"type":"Buffer","data":[143,134,115,130,63,129,140,98,247,167,90,43,207,74,130,147,40,170,115,102]},"announce":[],"urlList":[]}}