{"title":"PBS.Makers.Volume.2.3of6.Women.in.Space.720p.HDTV.x264.AAC.MVG","uid":11966409,"size":910336913,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:90428f0662c6e2c88e0c89b2fa6645b23a695924&amp;dn=PBS.Makers.Volume.2.3of6.Women.in.Space.720p.HDTV.x264.AAC.MVG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MVGroup","files":1,"time":1432723964,"description":"Makers: Volume 2\n\nSociopolitical Documentary hosted by Leslie Mann and Julia Roberts and Jodie Foster and Alfre Woodward and Julianne Margulies and Christiane Amanpour, published by PBS in 2014 - English narration\n &lt;a href=&quot;\nhttp://docuwiki.net/images/9/99/Makers-Volume-2-Cover.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/images/9/99/Makers-Volume-2-Cover.jpg&lt;/a&gt;\n\nInformation\n------------------------------\n\nIn the last half-century, women have fought their way into nearly every sphere of American life, from the battlefield to the comedy club, the soundstage to the Senate. Each documentary in this six-part series examines the impact of the women's movement on six fields once largely closed to women: business, space, Hollywood, comedy, war and politics. In each field, women have pried open, and profoundly reshaped, the central institutions of American life and culture. Through intimate interviews with trailblazing women known and unknown, viewers are given a rare glimpse-- sometimes funny, sometimes sad, and always candid-of what it was like to be pioneers in their fields.\n\n\n1)  Comedy \nMakers: Women in Comedy tracks the rise of women in the world of comedy, from the &quot;dangerous&quot; comedy of 70s sitcoms like Maude to the groundbreaking women of the 1980s American comedy club boom and building to today's multifaceted landscape. Today, movies like Bridesmaids break box office records and the women of Saturday Night Live are often more famous than their male counterparts. Contemporary comics, including Chelsea Handler, Mo'Nique, Sarah Silverman, Ellen DeGeneres, Jane Lynch and Kathy Griffin, talk about where women started in this competitive, male-dominated profession and where they are determined to go.\n\n2)  Hollywood \nMakers: Women in Hollywood showcases the women of showbiz, from the earliest pioneers to present-day power players, as they influence the creation of one of the country's biggest commodities: entertainment. Audiences hear from actress-producer-activist Jane Fonda; television powerhouse Shonda Rhimes, who created Grey's Anatomy and Scandal; screenwriter Linda Woolverton, who re-imagined the traditional Disney princess; writer-director-actress Lena Dunham, who mines comedy and drama gold by exploring what it's really like to be a young woman today; and six-time Academy Award nominee Glenn Close.\n\n3)  Space \nMakers: Women in Space traces the history of women pioneers in the U.S. space program. Some, like aviators Wally Funk and Jerrie Cobb, passed the same grueling tests as male astronauts, only to be dismissed by NASA, the military, and even Lyndon Johnson, as a distraction. It wasn't until 1995 that Eileen Collins became the first woman to pilot a spacecraft. The program includes interviews with Collins, as well as Sally Ride's classmates Shannon Lucid, Rhea Seddon and Kathryn Sullivan, and features Mae Jemison, the first woman of color astronaut, and Peggy Whitson, the first female commander of the International Space Station. The hour ends with the next generation of women engineers, mathematicians and astronauts-the new group of pioneers, like Marleen Martinez, who continue to make small but significant steps forward.\n\n4)  War \nMakers: Women in War looks at American women's increasing participation in war-from Vietnam to the present-as nurses, soldiers, journalists, diplomats and spies. Among those featured are Linda Bray, the first woman to lead troops into battle, and Valerie Plame Wilson, whose career was sabotaged after she was &quot;outed&quot; as a high-level spy. Viewers hear from war correspondents Molly Moore, Clarissa Ward and Christiane Amanpour about life on the battlefield. The film shares the stories of military leaders who have broken through gender barriers, like General Angela Salinas, at her retirement the highest ranking woman serving in the USMC, and Vice Admiral Michelle Howard, the highest-ranking woman in the history of the U.S. Navy.\n\n5)  Business \nMakers: Women in Business tells the story of the exceptional women-past and present-who have taken the world of business by storm. Told by female business leaders themselves, this is a candid exploration of what it takes to make it and a celebration of the extraordinary individuals who, over the course of 50 years, have proven that a woman's place is wherever she believes it to be. Some of the featured business leaders include Ursula Burns, the CEO of Xerox and the first African-American woman to head a Fortune 500 company; Sallie Krawcheck, Wall Street powerhouse and current owner of the global networking platform for women, 85 Broads; lifestyle mogul and business magnate Martha Stewart; and Sheryl Sandberg, COO of Facebook, whose provocative book, Lean In,ignited a national conversation about women, feminism and equality in the workplace.\n\n6)  Politics \nMakers: Women in Politics profiles women in public office who were &quot;firsts&quot; in their fields. From the first woman elected to Congress in 1916 to a young woman running for Detroit City Council in 2013, the documentary explores the challenges confronting American women in politics. Trailblazing leaders like Hillary Clinton, Senator Barbara Mikulski, Olympia Snowe, the youngest Republican woman ever elected to the House of Representatives, and Shirley Chisholm, the first African-American woman to serve in Congress, provide a backdrop for younger women like Rashida Tlaib, the first Muslim-American woman elected to the Michigan House, and Raquel Castaneda-Lopez, who chronicles her run for Detroit City Council.\n\n\n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;0840616f6048443c2639&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt;\n * Video Bitrate: ~2100 Kbps (CRF 21)\n * Video Resolution: 1280x720\n * Video Aspect Ratio: 16:9\n * Framerate: 23.976fps and 29.970fps\n * Audio Codec: AAC-LC (Nero)\n * Audio Quality: 0.50 48KHz (~150 Kbps)\n * Audio Channels: 2\n * Run-Time: ~53mn (each)\n * Number of Parts: 6\n * Part Size: ~850 MiB\n * Container: MP4\n * Released: 2014\n * Source: HDTV AVC 1080i\n * Capper: KarMa\n * Subtitles: English - Merged in the MP4\n\n1)  Further Information \n * http://www.pbs.org/makers/season-two/\n\n2)  Related Documentaries \n * http://docuwiki.net/?title=Makers%3A%20Women%20Who%20Make%20America\n * http://docuwiki.net/?title=Annie%20Oakley\n * http://docuwiki.net/?title=Rebel%3A%20Loreta%20Velazquez%2C%20Secret%20Soldier%20of%20the%20American%20Civil%20War\n * http://docuwiki.net/?title=Spitfire%20Women\n * http://docuwiki.net/?title=Harlots%2C%20Housewives%20and%20Heroines%20-%20A%2017th%20Century%20History%20for%20Girls\n * http://docuwiki.net/?title=Dolley%20Madison%3A%20Americas%20First%20Lady\n\nSource: http://docuwiki.net/index.php?title=Makers:_Volume_2","torrent":{"xt":"urn:btih:90428f0662c6e2c88e0c89b2fa6645b23a695924","amp;dn":"PBS.Makers.Volume.2.3of6.Women.in.Space.720p.HDTV.x264.AAC.MVG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90428f0662c6e2c88e0c89b2fa6645b23a695924","infoHashBuffer":{"type":"Buffer","data":[144,66,143,6,98,198,226,200,142,12,137,178,250,102,69,178,58,105,89,36]},"announce":[],"urlList":[]}}