{"title":"Myra Friedman, Buried Alive, the Biography of Janis Joplin[Epub]","uid":12313919,"size":397121,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:90b76121d317bdb94569a96b92adc72bd79cfd68&amp;dn=Myra+Friedman%2C+Buried+Alive%2C+the+Biography+of+Janis+Joplin%5BEpub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Hand_of_Doom","files":4,"time":1440956751,"description":"Myra Friedman, Buried Alive, the Biography of Janis Joplin [Epub]\n\n\nElectrifying, highly acclaimed, and intensely personal, this new and updated version of Myra Friedman's classic biography of Janis Joplin teems with dramatic insights into Joplin's genius and into the chaotic times that catapulted her to fame as the legendary queen of rock. It is a stunning panorama of the turbulent decade when Joplin's was the rallying voice of a generation that lost itself in her music and found itself in her words.\n\nFrom her small hometown of Port Arthur, Texas, to San Francisco's Haight-Ashbury, from the intimate coffeehouses to the supercharged concert halls, from the glitter of worldwide fame to her tragic end in a Hollywood hotel, here is all the fire and anguish of an immortal, immensely talented, and troubled performer who devoured everything the rock scene had to offer in a fatal attempt to make peace with herself and her era. Yet, in an eloquent introduction recently written by the author, Joplin emerges from her &quot;ugly duckling&quot; childhood as a woman truly ahead of her time, an outrageous rebel, a defiant outcast and artist of incomparable authenticity who, almost in spite of herself, became to so many a symbol of triumph over adversity.\n\nThis edition also contains an afterword detailing the whereabouts of a large and colorful cast of characters who were part of Joplin's life, as well as &quot;We Remember Janis,&quot; a new chapter of poignant and affectionate anecdotes told by friends","torrent":{"xt":"urn:btih:90b76121d317bdb94569a96b92adc72bd79cfd68","amp;dn":"Myra+Friedman%2C+Buried+Alive%2C+the+Biography+of+Janis+Joplin%5BEpub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90b76121d317bdb94569a96b92adc72bd79cfd68","infoHashBuffer":{"type":"Buffer","data":[144,183,97,33,211,23,189,185,69,105,169,107,146,173,199,43,215,156,253,104]},"announce":[],"urlList":[]}}