{"title":"Blacked: Cum Inside Me (2015) - Interracial Creampie Porn XXX","uid":11971710,"size":3464918851,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:90f73dc8f901551275299a142a70a28a75cb191e&amp;dn=Blacked%3A+Cum+Inside+Me+%282015%29+-+Interracial+Creampie+Porn+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"KidAtomic","files":1,"time":1432852392,"description":"Blacked: Cum Inside Me (2015) - Interracial Porn XXX\n\nAVN and XBIZ award winning studio BLACKED.com proudly presents &quot;Cum Inside Me,&quot; featuring Ava Delush, August Ames, Kennedy Kressler and Aaliyah Love, who all share their passion for Interracial Creampies. This movie is about quality! It offers next level production values and is directed by award winning director Greg Lansky.\n\nSummary: Cum Inside Me by director Greg Lansky for Blacked.com looked great and had a stunning array of hotties like Ava DaLush, August Ames, Aaliyah Love, and rarity Kennedy Kressler engage in heated trysts starring men like Jovan Jordan to merit a rating of Recommended or better depending on your tastes in porn, my own preference for ladies that can more actively push their sexual limits well known. In short, Cum Inside Me combined a highly polished and stylized set of visuals with skilled direction and a fine cast of performers that should please most fans of interracial porn, the icing in the cake this time being each lady receiving a usually credible looking vaginal creampie so give it a look when it is released in the near future.\n\n    Scene 1. Ava Dalush, Michael Williams\n    Scene 2. Kennedy Kressler, Jason Brown\n    Scene 3. Aaliyah Love, Jovan Jordan\n    Scene 4. August Ames, Jason Brown\n\nLength 2 hrs. 14 mins.\nRating XXX\nReleased May 11 2015\nProduction Year 2015\nStudio  Blacked\n\nActresses\n\n    Aaliyah Love [Creampie IR]\n    August Ames [Bald Creampie IR]\n    Ava Dalush [Creampie IR]\n    Kennedy Kressler [Bald Creampie IR]\n\nActors\n\n    Jason Brown\n    Jovan Jordan\n    Michael Williams\n\nAva Dalush\n\nAva is on a balcony overlooking LA as she's wearing a sheer black bra and panties. She looks fantastic! She is unhappy with her husband and wants to cheat on him so she finds Michael Williams. They start making out and he feels up her fine form. Ava worships his cock and looks so sexy rubbing it along her face and licking up and down the shaft. She looks up at him as she slides him in and out of her mouth. She gags on his meat and works out some stringers. Ava does a fantastic job with the oral presentation! She gets her biscuit fucked in doggie, mish and cowgirl. Michael unloads in her pussy and it drips out onto his stomach. Good scene!\n\nKennedy Kressler\n\nKennedy is a pretty blonde wearing a pink sweater as she makes a deal with her husband. He cheated on her so she thinks it's only fair that she cheats on him! Jason Brown comes a-calling and they kiss passionately and Kennedy feels up his package. She takes him into her mouth and struggles to get past his head. She maintains nice eye contract and grabs ahold of his balls while servicing him. Kennedy keeps her sweater on and gets drilled in doggie and cowgirl. Kennedy finally gets naked and Jason splits her in mish before cumming in her pussy. Kennedy squeezes it out and gets fucked a little bit more.\n\nAaliyah Love\n\nAaliyah is naked and applying some lipstick. Damn, this woman is beautiful! In a voiceover, she says she wants to spice up the marriage so she's thinking of getting a BBC. Aaliyah's wearing a sexy black dress and finds a note waiting for her on her 5th anniversary. Her husband arranged for a black guy to come over to fuck her. She's wearing black lingerie as Jovan Jordan comes into the bedroom. She's blindfolded and feels up his package. Aaliyah gives him a no-hands blowjob then Jovan starts fucking her face. She gets him wet with her spit and she gags all over him. Jovan eats her out and bones her in mish, cowgirl, doggie and mish. Aaliyah does a very good job in this one and Jovan unloads inside her. The beauty digs it out and is exhausted!\n\nAugust Ames\n\nAugust is wearing glasses, a white blouse and black skirt as Jason Brown invites her into his office. He's concerned that she's a little timid and August is out to prove that she's not. She unbuttons her blouse and she is just bursting out of her red bra. Damn, girl! You're killing me! The skirt is next and Ms. Ames looks fucking incredible! She juggles her tits and crawls over the desk at him. They start making out and August gives him a sensuous blowjob. She gets about half of him into her mouth and does some ball sucking. Jason slams her in doggie, cowgirl and mish. Jason strokes off all over her cooch. August is amazing","torrent":{"xt":"urn:btih:90f73dc8f901551275299a142a70a28a75cb191e","amp;dn":"Blacked%3A+Cum+Inside+Me+%282015%29+-+Interracial+Creampie+Porn+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90f73dc8f901551275299a142a70a28a75cb191e","infoHashBuffer":{"type":"Buffer","data":[144,247,61,200,249,1,85,18,117,41,154,20,42,112,162,138,117,203,25,30]},"announce":[],"urlList":[]}}