{"title":"Monuments, Objects, Histories - Institutions of Art in Colonial ","uid":10864929,"size":9786391,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:91e53de707a9622a8facebcd76a11defa7ad1471&amp;dn=Monuments%2C+Objects%2C+Histories+-+Institutions+of+Art+in+Colonial+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"STBGD","files":-1,"time":1408910594,"description":"Tapati Guha-Thakurta - Monuments, Objects, Histories: Institutions of Art in Colonial and Post-Colonial India\n2004 | PDF | 432 pages | 9 MB\n\n\nArt history as it is largely practiced in Asia as well as in the West is a western invention. In India, works of art-sculptures, monuments, paintings-were first viewed under colonial rule as archaeological antiquities, later as architectural relics, and by the mid-20th century as works of art within an elaborate art-historical classification. Tied to these views were narratives in which the works figured, respectively, as sources from which to recover India's history, markers of a lost, antique civilization, and symbols of a nation's unique aesthetic, reflecting the progression from colonialism to nationalism. The nationalist canon continues to dominate the image of Indian art in India and abroad, and yet its uncritical acceptance of the discipline's western orthodoxies remains unquestioned, the original motives and means of creation unexplored. The book examines the role of art and art history from both an insider and outsider point of view, always revealing how the demands of nationalism have shaped the concept and meaning of art in India. The author shows how western custodianship of Indian &quot;antiquities&quot; structured a historical interpretation of art; how indigenous Bengali scholarship in the late 19th and early 20th centuries attempted to bring Indian art into the nationalist sphere; how the importance of art as a representation of national culture crystallized in the period after Independence; and how cultural and religious clashes in modern India have resulted in conflicting &quot;histories&quot; and interpretations of Indian art. In particular, the author uses the depiction of Hindu goddesses to elicit conflicting scenarios of condemnation and celebration, both of which have at their core the threat and lure of the female form, which has been constructed and narrativized in art history.","torrent":{"xt":"urn:btih:91e53de707a9622a8facebcd76a11defa7ad1471","amp;dn":"Monuments%2C+Objects%2C+Histories+-+Institutions+of+Art+in+Colonial+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91e53de707a9622a8facebcd76a11defa7ad1471","infoHashBuffer":{"type":"Buffer","data":[145,229,61,231,7,169,98,42,143,172,235,205,118,161,29,239,167,173,20,113]},"announce":[],"urlList":[]}}