{"title":"Kid Rock - First Kiss (2015) [EAC-FLAC]","uid":12057932,"size":361304305,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:931b817b2b9849890a70fdb31d7309553a67744a&amp;dn=Kid+Rock+-+First+Kiss+%282015%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pucholoco","files":26,"time":1435165711,"description":"\n                     Kid Rock - First Kiss (2015) [EAC-FLAC]\n             EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 313 Mb\n                      Full Artwork @ 600 dpi (jpg) -&gt; 47 Mb\n\n\n\nKid Rock gives away the game in his album titles, making it plain on 2015's First Kiss that he's taking a sepia-tinted look back at his past, thinking back fondly to lost love and old tunes. In short, he's tapping into the nostalgia that coursed through his last big hit, 2008's &quot;All Summer Long,&quot; and turning it into a full album. Generally, this means leaning hard on his longstanding Bob Seger infatuation and ratcheting up the country inclinations that turned a little too stuffy on the Rick Rubin-produced Born Free.\n\nFirst Kiss is looser than that 2010 affair and, lacking such monuments to tackiness as &quot;Cucci Galore,&quot; it's not as raunchy as 2012's Rebel Soul but, bless his heart, Kid hasn't gotten tasteful. When he sings about &quot;Johnny Cash,&quot; he's envisioning himself as the Man in Black to his paramour's June Carter, he still snarls out the F-word with a smirk and has the best time singing blues songs about booze. \n\nRegrettably, his tackiness ripens into mawkishness whenever the tempo slows, which it does on the back half of the record. As long as he sticks to a bit of a Southern-fried soul groove, as he does on &quot;Best of Me,&quot; he still works up a pulse, but the seemingly blasphemous backporch pair of &quot;Jesus and Bocephus&quot; and &quot;FOAD&quot; don't make nearly as deep an impression as &quot;Drinking Beer with Dad,&quot; a heartfelt ode to tradition from the former rebel. \n\nEarlier on the album, Kid Rock admits &quot;we can't fight this getting older&quot; and that weary yet warm acceptance of his middle age is why First Kiss works: it's a bit bumpy and sometimes sleepy but it finds old Bob Ritchie settling into his comfort zone, knowing that he's in it for the long haul. There are two versions of the ten-track CD: the tenth track on one is a &quot;clean&quot; one with &quot;Say Goodbye&quot;; the tenth track on the other is the profanity-laced &quot;FOAD.&quot;\n\n\n---------------------------------\nTracklist:\n---------------------------------\n\n01 - First Kiss\n02 - Good Times, Cheap Wine\n03 - Johnny Cash\n04 - Ain't Enough Whiskey\n05 - Drinking Beer With Dad\n06 - Good Time Lookin' for Me\n07 - Best of Me\n08 - One More Song\n09 - Jesus and Bocephus\n10 - FOAD\n\n\n*2015 Warner Bros. | 9362-49318-9\n\n\nEnjoy and Sharing, Thanks!","torrent":{"xt":"urn:btih:931b817b2b9849890a70fdb31d7309553a67744a","amp;dn":"Kid+Rock+-+First+Kiss+%282015%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"931b817b2b9849890a70fdb31d7309553a67744a","infoHashBuffer":{"type":"Buffer","data":[147,27,129,123,43,152,73,137,10,112,253,179,29,115,9,85,58,103,116,74]},"announce":[],"urlList":[]}}