{"title":"Maximum Metal Magazine","uid":10717952,"size":35927380,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:931d35206ddb2dc0c3756c30332f3828e4957101&amp;dn=Maximum+Metal+Magazine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Icearth","files":1,"time":1407436516,"description":"MAXIMUM METAL MAGAZINE - FIRST ISSUE OUT NOW!!!\n\nMAXIMUM METAL was started online in 2003 by a few guys who just wanted a forum for communicating about hard rock and heavy metal and we have raised our metal claws for the style ever since. MAXIMUM METAL has been updated and modified for the metal community that has given, and still gives, so much to us. Now, after thousands of reviews, hundreds of interviews, dozens of columns, and a few humor pieces...\n\nMAXIMUM METAL MAGAZINE has arrived!\n\nMaximum Metal magazine will basically contain recent postings from the website with occasional exclusive content. \n\nIn our first edition, highlights include:\n\nInterviews with Watain, Ghost of War, Midnight Eternal, A Sound of Thunder, and Crystal Eyes.\n\nNow &amp; Then with Judas Priest and our under-rated JP songs\nAn exclusive column &quot;Shrieks from the Hearse&quot; by metal thrashing madman King Fowley\n\nMetal Maidens from Canada!\n\nLive concert pics from &quot;Welcome to Rockville&quot; and &quot;Metalfest Loreley&quot; in Germany\n\nA feature on renowned metal producer Jacob Hansen\n\n15 pages of our Reviews and Summaries\n\nA humorous &quot;Tale of the Tape&quot; on Rob Halford and Bruce Dickinson\n\nCool metal ads (sorta, if you like 'em)\n\nAnd Issue #1 is FREE!!!!!\n\nSo, from us to you the reader of issue #1, a big metal horns up and thanks from us. Read it, download it, share it with your friends, read it to the monster in your closet, send a copy to your grandpappy Delbert and his horse in Arizona and all your online social friends in Europe, South America, Asia, Africa, Australia, and Antarctica. We know metal is everywhere and we wanna be there along with it. \n\nYou can read the first issue online here or download externally at:\nwww.maximummetal.com/magazine/","torrent":{"xt":"urn:btih:931d35206ddb2dc0c3756c30332f3828e4957101","amp;dn":"Maximum+Metal+Magazine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"931d35206ddb2dc0c3756c30332f3828e4957101","infoHashBuffer":{"type":"Buffer","data":[147,29,53,32,109,219,45,192,195,117,108,48,51,47,56,40,228,149,113,1]},"announce":[],"urlList":[]}}