{"title":"Willie Nelson + Merle Haggard - Django And Jimmie (2015) {FLAC}","uid":12013442,"size":275605044,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9569cbc332e9283ce320b568e39585a38ec3fbd2&amp;dn=Willie+Nelson+%2B+Merle+Haggard+-+Django+And+Jimmie+%282015%29+%7BFLAC%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":7,"uploader":"vtwin88cube","files":20,"time":1434263305,"description":"Willie Nelson &amp; Merle Haggard\nDjango And Jimmie (2015)\n\n\n\n\n\nallmusic.com...\n\n\nWillie Nelson and Merle Haggard first teamed up on record for Pancho &amp; Lefty in 1983, a record released some 20 years after both singers began their careers. Back then, they were both hovering around 50, already considered old guys, but Django and Jimmie arrives 32 years after that record, when there's no question that the pair are old-timers. Appropriately enough, mortality is on their minds throughout Django and Jimmie, a record whose very title is taken from Willie and Merle's childhood idols. It's a song that seems like a confession, as does the casual admission that they didn't think they'd &quot;Live This Long,&quot; but neither Nelson nor Haggard wrote this, nor the title track or the album's first single, the near-novelty &quot;It's All Going to Pot.&quot; These are made-to-order originals by some of the best in the business -- Buddy Cannon, Jamey Johnson, and Ward Davis wrote &quot;It's All Going to Pot,&quot; Jimmy Melton and Jeff Prince the title track -- and it shows how producer Cannon has a sharp ear for material, along with a way with a relaxed groove. That comfortable, familial atmosphere is one of the best things about Django and Jimmie and extends far beyond the marquee names; the studio pros, friends, family, and fellow travelers who support Willie and Merle help give this a warm, worn-in feel that's appealing on its own terms. As comforting as the vibe is, it's the singers and their songs that linger. Neither Nelson nor Haggard make any attempt to hide their age -- Willie is a bit thinner than he used to be, Merle a bit growlier -- and their age is affecting when they revisit songs from the past, whether they wrote them or not (Hag's &quot;Swinging Doors&quot; is revived, as is the country standard &quot;Family Bible&quot; and Bob Dylan's &quot;Don't Think Twice, It's All Right&quot;). This nod to the passage of time isn't as explicit as &quot;Live This Long&quot; or &quot;Missing Ol' Johnny Cash,&quot; where they bring in fellow survivor Bobby Bare to reminisce about their old pal. Often, country memories can get maudlin, but Willie and Merle are filled with good humor here and the pair often strike a delicate balance of fun and sweet melancholy which gives Django and Jimmie a soulful lift. Both singers are aware they're approaching the twilight, but they're not cursing the dark, they're enjoying the sunset. \n\n\nGenre................: Country\nQuality..............: Free Lossless Audio Codec (FLAC)\nLabel.................: Sony Legacy\nIncluded.............: Covers, auCDtect, Log, Cue\n\n\n01.Django And Jimmie\n02.It's All Going To Pot\n03.Unfair Weather Friend\n04.Missing Ol' Johnny Cash (Feat. Bobby Bare)\n05.Live This Song\n06.Alice In\n07.Don't Think Twice, It's Alright\n08.Family Bible\n09.It's Only Money\n10.Swinging Doors\n11.Where Dreams Come To Die\n12.Somewhere Between\n13.Driving The Herd\n14.The Only Man Wilder Than Me\n\n\n\n\n\nTHANKS for Seeding!\nCheers","torrent":{"xt":"urn:btih:9569cbc332e9283ce320b568e39585a38ec3fbd2","amp;dn":"Willie+Nelson+%2B+Merle+Haggard+-+Django+And+Jimmie+%282015%29+%7BFLAC%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9569cbc332e9283ce320b568e39585a38ec3fbd2","infoHashBuffer":{"type":"Buffer","data":[149,105,203,195,50,233,40,60,227,32,181,104,227,149,133,163,142,195,251,210]},"announce":[],"urlList":[]}}