{"title":"UFC Fit Workout Program","uid":12074897,"size":5087720366,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:957bda986f6ed71b6758f9d5e913e6488ac96bc1&amp;dn=UFC+Fit+Workout+Program&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MrTVGuy","files":22,"time":1435612766,"description":"UFC Fit Workout Program\n\nThe UFC FIT home workout program is broken into four, three-week high-intensity interval training segments. Picture steps, where each one stacks on top of the other. You must go through the first weeks to develop the strength, flexibility and conditioning for the later weeks. UFC Fit teaches fitness training techniques with the proper volume and intensity to force consistent progression so that with each workout, you get better. By Week 12, you will be in the absolute best shape of your life, just like a UFC athlete when he or she peaks before entering the Octagon. There are 12 UFC workout videos included in the program: Power Punch, Power Pull, Plyo Shred, Fat Fighter, Striker Strength, Grapple Strength, Ultimate Fit Challenger, Ultimate Fit Champion, Cardio Cross Train, Ab Assassin, Ultimate Stretch Flex, and Shark Attack.\n\nTrain with Mike Dolce, the Trainer of the Year at the 2013 World MMA Awards. Get the same fitness training techniques and motivation as professional athletes, featuring high-intensity interval training (HIIT). United States version and packaging.\n\nIncludes: 12 UFC workout dvds, 12-week workout tracker, and a 132-page lifestyle and nutrition manual. Additional equipment recommended, but NOT included: UFC Fit Octagon Mat, light and heavy dumbbells (two of each).\n\nGet a jump start on weight loss with 3-Day Shred.\n\nShort and effective workouts ranging from 23-43 minutes.\n\nCompeting on season seven of The Ultimate FighterÂ® and training with some of the top athletes in the sport such as Thiago Alves, Michael Bisping, Johny Hendricks and Gray Maynard, Mike Dolce is qualified to present the UFC FIT program","torrent":{"xt":"urn:btih:957bda986f6ed71b6758f9d5e913e6488ac96bc1","amp;dn":"UFC+Fit+Workout+Program","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"957bda986f6ed71b6758f9d5e913e6488ac96bc1","infoHashBuffer":{"type":"Buffer","data":[149,123,218,152,111,110,215,27,103,88,249,213,233,19,230,72,138,201,107,193]},"announce":[],"urlList":[]}}