{"title":"Greg Graffin - American Lesion (1997) [FLAC]","uid":12047660,"size":240536387,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:97142315e4c8e7757da783df76c0f6861b167a70&amp;dn=Greg+Graffin+-+American+Lesion+%281997%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"politux","files":13,"time":1434933377,"description":"\n  Greg Graffin - American Lesion (1997) [FLAC]\n\n  Genre: Rock\n  Style: Folk, Alternative\n  Source: CD \n  Codec: FLAC\n  Bit rate: ~ 1,000 kbps\n  Bit depth: 16\n  Sample rate: 44.1 kHz\n\n  01 Opinion \n  02 Fate's Cruel Hand \n  03 Predicament \n  04 The Fault Line \n  05 When I Fail \n  06 Cease \n  07 Maybe She Will \n  08 The Elements \n  09 In the Mirror \n  10 Back to Earth \n\n  Bad Religion leader Greg Graffin had a bunch of songs he'd composed that didn't really fit his explosive, melodic punk band, given the personal subject matter in the tunes. So he recorded them by himself in the home studio he usually uses for demos. The end product is a small stunner. The bulk of it is Graffin alone with either a piano or an acoustic guitar and overdubbed drums (his playing is actually adequate). Here's an LP so different from Bad Religion that, with its American Lesion moniker, you wouldn't know who was behind it if it weren't for Graffin's familiar, full, resolute voice. The overwhelming flavor is that of '70-'73 Todd Rundgren (typified by the smash hits &quot;Hello It's Me&quot; and &quot;I Saw the Light&quot;). Add a splash of Carole King's Tapestry and even a hint of Gordon Lightfoot on one song (&quot;The Fault Line&quot;), and you've got a gentle, up-close portrait, far removed from Graffin's band. The challenge, then, is to make such a personal, sensitive record as compelling as Bad Religion's explosive firepower, foregoing the thoughtful social protest lyrics. Graffin deftly manages this difficult transition of personas like Scrooge after his ghosts have gone. Somehow he remains intense just under the surface, even in such hushed tones. A more revealing title would be &quot;Scenes From a Divorce.&quot; Indeed, it's hard to think of a more intimate portrait of a marriage lost's emotional kerpow. Graffin's own marriage was dying when he composed this material, yet he expresses his feelings, thoughts, and reactions straight-up without indulgence and even helplessly reserves some blame for himself. American Lesion is a silent, somber nightmare, a reality for millions of broken families. This is where art meets life, and it's a hard row to hoe sometimes","torrent":{"xt":"urn:btih:97142315e4c8e7757da783df76c0f6861b167a70","amp;dn":"Greg+Graffin+-+American+Lesion+%281997%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97142315e4c8e7757da783df76c0f6861b167a70","infoHashBuffer":{"type":"Buffer","data":[151,20,35,21,228,200,231,117,125,167,131,223,118,192,246,134,27,22,122,112]},"announce":[],"urlList":[]}}