{"title":"Zao - Xenophobe","uid":12088763,"size":7606890,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:97a51d5f8557437435b2a94c302dd65d83551282&amp;dn=Zao+-+Xenophobe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"chernobit","files":1,"time":1435974078,"description":"We haven't heard from metalcore veterans Zao since 2009's well-regarded tenth album Awake? (released in limited physical quantities on Ferret; remember Ferret, kids?) Well, the five-piece is working on approximately 13 songs for their first album since 2009 at Treelady Studios in Pittsburgh PA, with a projected fall release date. In the interim, they're self-releasing 7-inch/digital two-song single &quot;Xenophobe&quot;/&quot;Fear Itself&quot; and we're proud to unleash the former right here on the Deciblog.\n\nAccording to frontman Dan Weyandt, &quot;Lyrically, 'Xenophobe' is about specific outlets of mass media using tried and true propaganda techniques to create division, radicalism and fear in the average American citizen's mind. Appealing at first to a viewer's prejudice and worries, it then reshapes the way one thinks and perceives. It's the great divider in the digital age and the corruptor of rational thoughts. It is loyal to no side and both at once.&quot;\n\n&quot;Xenophobe&quot;/&quot;Fear Itself&quot; will be available in a limited edition of 600 on clear vinyl packaged in hand-assembled, hand-numbered lithographed covers. Pre-orders are available here, and the single will be released through all other digital outlets on July 10. &quot;Almost everyone in the band is a collector of some sort: toys, comics, records,&quot; says drummer Jeff Gretz. &quot;Outside of music, that is our common language. We wanted to make something that wasn't just some digital printed generic cover with a few thousand floating around. We wanted to do something that was pretty limited and unique, and had a little bit of personal stamp/imperfections in it. We are fully aware that for the most part, music is free, but we are also aware that people like to collect things, and the less of something out there, the more special it is to have one. So, we are sort of courting that mentality; it's a little pricier to do things this way, but in the end, it's more fun for both sides of the transaction.&quot;\n\nThe current lineup of Zao continues with the same core as The Fear Is What Keeps Us Here and Awake?, with the additional return of Russ Cogdell. Check out &quot;Xenophobe&quot; and the single cover below!","torrent":{"xt":"urn:btih:97a51d5f8557437435b2a94c302dd65d83551282","amp;dn":"Zao+-+Xenophobe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97a51d5f8557437435b2a94c302dd65d83551282","infoHashBuffer":{"type":"Buffer","data":[151,165,29,95,133,87,67,116,53,178,169,76,48,45,214,93,131,85,18,130]},"announce":[],"urlList":[]}}