{"title":"Brittney Skye - Cum Beggars 2 (2005) WEBRip","uid":12005964,"size":349361301,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:97f0c16e921bde719827ec7552a4c5cf238e0405&amp;dn=Brittney+Skye+-+Cum+Beggars+2+%282005%29+WEBRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"roflcopter2110","files":1,"time":1433873276,"description":"Director: Danny Case\nStarring: Brittney Skye, Pat Myne, David Perry\n\n\n\nDescription: Brittney Skye is sitting on a toilet blindfolded with a butt plug up her ass and vibrator working in her pussy. She's getting pretty worked up with the director cheering her on. He pulls his cock out for her, which she finds blind, and Brittney goes to her knees to suck it. She does a nice job of getting it into her throat and smiles when the blindfold comes off and she can see the hard tool. Brittney bends over, ready to fuck, and gets sent into the living room where a rock ready David Perry awaits. Brittney hoovers his stiffy. Nice energy and some slobber from Brittney, then a second cock for her in the person of Pat Myne. These guys work her throat nicely and Brittney is a natural for this action. She has her trusty vibe buzzing her clit as Pat mounts her in doggy. She works David's cock by hand and mouth. Spoon for David, Pat feeds her face. He retrieves her vibe so she can enjoy David to her fullest. Pat rails her in mish, slamming in deep. She comes very close to orgasm before Pat pulls out and leaves her for David. He punch fucks her in mish then a cut to Pat inserting in mish anal. David gets his piece of ass in spoon, then A2M. RCA on David who gapes her. More A2M. A little head for Pat, then an up and over doggy anal. Brittney gets down on the floor and takes a face painting from Pat. David adds some artistry of his own to the other side of her face and she looks quite the sight with cum dripping onto her tits and face glazed.\n\n\n\nReleased: 2005\nIssued: USA / 3rd Degree\nDuration: 00:20:00\nLanguage: English\nGenre: Gonzo, Anal, Big Tits, Toys, Oral, Blowjob, Facial\n\n\n\nFormat: MKV\nQuality: WEBRip\nVideo Codec: AVC / H.264\nVideo: 720x544, 29.970fps, 2168 Kb / s\nSound: 48KHz, AC3, 160 Kb / s (2 ch)","torrent":{"xt":"urn:btih:97f0c16e921bde719827ec7552a4c5cf238e0405","amp;dn":"Brittney+Skye+-+Cum+Beggars+2+%282005%29+WEBRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97f0c16e921bde719827ec7552a4c5cf238e0405","infoHashBuffer":{"type":"Buffer","data":[151,240,193,110,146,27,222,113,152,39,236,117,82,164,197,207,35,142,4,5]},"announce":[],"urlList":[]}}