{"title":"Festivals.Sex.and.Suspicious.Parents.s02e01.ENG.SUBS.WEBRIP","uid":11966295,"size":642788950,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:99e01a36a375ad9d6461528324c76d7ef4961159&amp;dn=Festivals.Sex.and.Suspicious.Parents.s02e01.ENG.SUBS.WEBRIP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":4,"time":1432719663,"description":"Torrent Description: \n\nFestivals.Sex.and.Suspicious.Parents.s02e01.ENG.SUBS.WEBRIP\n\nTwo groups of youngsters head to the Frequency Festival in Austria for a long weekend of music and mayhem.\n\nIn Brighton, 19-year-old mummy's boy Charlie can't wait to cut loose at his first ever music festival with mates Callum and Reece. After the festival Charlie will be leaving home to go to uni and mum Donna is worried about his safety, so she wants to know whether her son is up to the challenge of looking after himself.\n\nOver in East Anglia, 18-year-old college student Amy is looking forward to her first trip abroad without her mum. She's travelling with her mates Nathan and Lana and can't wait to get trollied. Despite her wild ways she has dreams of joining the army. Now mum Susan is following her to the festival to see if Amy has what it takes.\n\nThey might be heading to the same festival but the groups have two very different first nights - while Charlie and the boys waste no time getting on the booze and trying their luck with the local ladies, unprepared Amy and friends spend their night struggling to put up a tent in the dark and the mud.\n\nThe parents arrive and watch the previous night's antics. Amy's mum is expecting the worst, but Charlie's mum is confident in her golden boy and doesn't think there's anything he can do to shock her. As the weekend continues, Charlie and the boys push their alcohol intake, their bodies and the goodwill of the Austrian people to the limit, while Amy discovers a surprising sensible side. Charlie's mum refuses to condemn his increasingly extreme antics and it's causing a rift between the parents, but as he ramps up the booze and bad behaviour, will her darling Charlie finally cross the line?\n\nThere's laughter, shock and even tears for the mums as they see what their kids get up to, but how will the teens react when they find out their mums have been watching everything all along?\n\nFormat: MPEG-4\nSize: 832x468\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz","torrent":{"xt":"urn:btih:99e01a36a375ad9d6461528324c76d7ef4961159","amp;dn":"Festivals.Sex.and.Suspicious.Parents.s02e01.ENG.SUBS.WEBRIP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99e01a36a375ad9d6461528324c76d7ef4961159","infoHashBuffer":{"type":"Buffer","data":[153,224,26,54,163,117,173,157,100,97,82,131,36,199,109,126,244,150,17,89]},"announce":[],"urlList":[]}}