{"title":"How to Be Bohemian with Victoria Coren Mitchell s01e02 ENG SUBS","uid":12020582,"size":667187484,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:99fcf42fb6b9dc01d7b7f0ff97a3e0ae87302608&amp;dn=How+to+Be+Bohemian+with+Victoria+Coren+Mitchell+s01e02+ENG+SUBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":4,"time":1434427475,"description":"How.to.Be.Bohemian.with.Victoria.Coren.Mitchell.s01e02.ENG.SUBS.WEBRIP\n\nFormat: MPEG-4\nSize: 832x468\nFrameRate: 25.00 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\nIn episode two, the journey through bohemian history reaches the early 20th century, when the Bloomsbury Group and others were determined to challenge sexual taboos - sometimes in their work and often in their private lives. They threw off their inhibitions, and frequently their clothes, and set the tone for generations of bohemians who followed. But what did the pursuit of freedom do for these artists, their art, and the people around them?\n\nVictoria considers the very open relationships of the Bloomsbury set, famously known as 'a circle who lived in squares and loved in triangles'. She also visits Charleston, the rural love nest of painters Vanessa Bell and Duncan Grant. She explores the story of Edward Carpenter, the poet and proto-hippy who dared to campaign for gay liberation in Edwardian England, and examines the 'King of Bohemia', painter Augustus John, who was alleged to have sired at least 99 children - one of whom Victoria meets.\n\nThis episode also features the Bright Young Things - the glamorous, party-loving bohemians of the Roaring Twenties, who provided the inspiration for photographer Cecil Beaton and writer Evelyn Waugh. Victoria discusses them with Stephen Fry, who directed the film of Waugh's novel Vile Bodies. She also uncovers the forgotten life of Nina Hamnett, a painter who spent too much time down the pub to fulfil her early promise. Finally she grapples with the truly shocking sexual conduct of one of the greatest English artists of the century, Eric Gill, whose actions for many embody the most unpalatable excesses of bohemian behaviour, living beyond any boundaries.\n\nAlong the way Victoria also meets artists Grayson Perry and Maggi Hambling, and seeks the wisdom of the Rev Richard Coles and author Will Self","torrent":{"xt":"urn:btih:99fcf42fb6b9dc01d7b7f0ff97a3e0ae87302608","amp;dn":"How+to+Be+Bohemian+with+Victoria+Coren+Mitchell+s01e02+ENG+SUBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99fcf42fb6b9dc01d7b7f0ff97a3e0ae87302608","infoHashBuffer":{"type":"Buffer","data":[153,252,244,47,182,185,220,1,215,183,240,255,151,163,224,174,135,48,38,8]},"announce":[],"urlList":[]}}