{"title":"PipTec Green Icons &amp; Live Wallpaper v1.2.2 APK (Android)","uid":12317603,"size":40218520,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:9a2290504eef9fa57b824228c192a74d8d4fceba&amp;dn=PipTec+Green+Icons+%26amp%3B+Live+Wallpaper+v1.2.2+APK+%28Android%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Pahly","files":1,"time":1440981817,"description":"3,300+ Hand-crafted HD icons in both FO3 and FO4 shades of green\nAnimated Live Wallpaper with scanline\nVault-Boy inspired Battery Widget\nFO4 &quot;STAT&quot; Widget\nDigital Clock Widget with date options\n&quot;Stats List&quot; Widget - Fully editable shortcut list of your apps in text form, you can also edit the name displayed.\n&quot;Stats Boxed&quot; Widget - Editable boxes with missed calls, unread texts and battery percentage.\n40+ Pip-Boy HD wallpapers - Hosted on the cloud. Choose and save the ones you want. (All wallpapers shown are included)\nPip-Tec is a theme that applies new icons to the most popular apps through a launcher of your choice. Each icon was hand crafted with simplicity in mind. The 3,300+ green icons and 70 wallpapers are inspired from the Fallout game series and the Fallout Pip-boy 3000. icons are xxxhdpi which means they're HD or high enough resolution to get cool looking lined icons on any device out there.\n\nNote: \nYou need a launcher like Nova Launcher(Dev recommended) or an app like unicon to apply the theme. Most of the launchers above offer free versions. \n\nFeatures:\nMuzei support for rotating wallpapers\nNew Icons added regularly\nAll pip-boy wallpapers shown are included. Full Version includes blue and amber icons and wallpapers.\nXXXHDPI high definition modern, green fallout pip-boy 3000 icons included for super large HD screens. All Icons are 192x192.\nSome parts of the green fallout pip-boy 3000 icons are transparent letting each show the provided scenic/landscape backgrounds or to your own backgrounds.\nContains over 3,200 different clean, flat and simple fallout pip-boy themed icons with many variations of default lined icons such as phone, contacts, camera, etc.\nWallpaper chooser comes installed to replicate a pip-boy on your device..\nEasy link to request more outline icons. \nClean, green pip-boy 3000 icons work best with dark wallpapers.\nCompatible with: (There are free versions of these. Dev recommends Nova Launcher)\nADW Launcher\nAction Launcher\nApex Launcher\nAtom Launcher\nAviate Launcher\nGo Launcher\nHolo Launcher (through launcher settings)\nInspire Launcher\nKK Launcher\nLucid Launcher\nNext Launcher\nNine Launcher\nNova Launcher\nSolo Launcher\nSmart Launcher\nThemer\nTSF\nUnicon\nWhat's in this version : (Updated : Aug 29, 2015)\nBoth FO3 and FO4 colors now included!\nAdded FO3 Green as a separate app; &quot;Pip-Tec Classic&quot; Install it from the side menu!\nRequired Android O/S : 4.0.3+","torrent":{"xt":"urn:btih:9a2290504eef9fa57b824228c192a74d8d4fceba","amp;dn":"PipTec+Green+Icons+%26amp%3B+Live+Wallpaper+v1.2.2+APK+%28Android%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a2290504eef9fa57b824228c192a74d8d4fceba","infoHashBuffer":{"type":"Buffer","data":[154,34,144,80,78,239,159,165,123,130,66,40,193,146,167,77,141,79,206,186]},"announce":[],"urlList":[]}}