{"title":"Shostakovich String Quartets Borodin later lineup [Melodiya]","uid":10726773,"size":2226390162,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:9bf1f9ef3726a23d0fb342dba85623e855328723&amp;dn=Shostakovich+String+Quartets+Borodin+later+lineup+%5BMelodiya%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"magneez","files":15,"time":1407580500,"description":"6 CDs FLAC+CUE, cover\n\n\nrandom review from amazon:\n\n\nI agree with the other reviewer. There are too many superlatives that one could use to review this set. The music is made to sound both ravishing and frightening. These performances are among the very best that are available on recorded format, if not THE very best, and are something of a reference work because the Borodins worked so closely with Shostakovich throughout his life, and the composer shared many exclusive insights with them. In fact, the Borodins frequently performed Shostakovich's Piano Quintet with Shostakovich himself at the piano, and there was a very famous concert that they all gave of that work in Gorky in 1964 which was the composer's last public peformance as a pianist. People in the audience cried, hugged each other and held hands as Shostakovich walked off stage. The Borodins' recordings were the first publicly available recordings of the quartets in many countries, including USSR, Germany, USA and Japan, and Shostakovich wrote to them in December 1964 after hearing recorded performances by them and said &quot;Accept my deep gratitude for your superb performance of my quartets.&quot; That is certainly a top recommendation!! The Borodin Quartet here is the second reformation of the quartet. The second reformed quartet was established in 1972 and had 2 members from the original band - Shebalin (viola) and Berlinsky (cello). The original Quartet undertook a complete recording of the Shostakovich quartets but only got to quartet 13. All of their recordings are available in an excellent set that has been issued by Chandos, who have remastered them. It is much admired. The complete set recorded by the second reformed Quartet (all 15 quartets) is what is reissued here. These recordings date from 1978 to 1983. They have long been quite difficult to get....","torrent":{"xt":"urn:btih:9bf1f9ef3726a23d0fb342dba85623e855328723","amp;dn":"Shostakovich+String+Quartets+Borodin+later+lineup+%5BMelodiya%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9bf1f9ef3726a23d0fb342dba85623e855328723","infoHashBuffer":{"type":"Buffer","data":[155,241,249,239,55,38,162,61,15,179,66,219,168,86,35,232,85,50,135,35]},"announce":[],"urlList":[]}}