{"title":"Materials for High-Temperature Fuel Cells (Wiley-VCH, 2013).pdf","uid":12013794,"size":3754858,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9ce50088430ef9cdb1cf9f489dd0ae75ebb4e56d&amp;dn=Materials+for+High-Temperature+Fuel+Cells+%28Wiley-VCH%2C+2013%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1434271676,"description":"ISBN 9783527330416\n\nThe world's ever-growing demand for power has created an urgent need for new efficient and sustainable sources of energy and electricity. Today's consumers of portable electronics also demand devices that not only deliver more power but are also environmentally friendly. Fuel cells are an important alternative energy source, with promise in military, commercial and industrial applications, for example power vehicles and portable devices.\n\nA fuel cell is an electrochemical device that directly converts the chemical energy of a fuel into electrical energy. Fuel cells represent the most efficient energy conversion technologies to-date and are an integral part in the new and renewable energy chain (e.g., solar, wind and hydropower). Fuel cells can be classified as either high-temperature or lowtemperature, depending on their operating temperature, and have different materials requirements. This book is dedicated to the study of high temperature fuel cells. In hightemperature fuel cells, the electrolyte materials are ceramic or molten carbonate, while the electrode materials are ceramic or metal (but not precious metal). High operation temperature fuel cells allow internal reforming, promote rapid kinetics with non-precious materials and offer high flexibilities in fuel choice, and are potential and viable candidate to moderate the fast increase in power requirements and to minimize the impact of the\nincreased power consumption on the environment.\n\n'Materials for High Temperature Fuel Cells' is part of the series on Materials for Sustainable Energy and Development edited by Prof. Max Q. Lu. The series covers advances in materials science and innovation for renewable energy, clean use of fossil energy, and greenhouse gas mitigation and associated environmental technologies","torrent":{"xt":"urn:btih:9ce50088430ef9cdb1cf9f489dd0ae75ebb4e56d","amp;dn":"Materials+for+High-Temperature+Fuel+Cells+%28Wiley-VCH%2C+2013%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ce50088430ef9cdb1cf9f489dd0ae75ebb4e56d","infoHashBuffer":{"type":"Buffer","data":[156,229,0,136,67,14,249,205,177,207,159,72,157,208,174,117,235,180,229,109]},"announce":[],"urlList":[]}}