{"title":"Made in the USA: The Rise and Retreat of American Manufacturing","uid":12078961,"size":1795656,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9d5d0be7b92b2bb7e1092f9df90ab3e057155b4b&amp;dn=Made+in+the+USA%3A+The+Rise+and+Retreat+of+American+Manufacturing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"heliiaruy","files":1,"time":1435701196,"description":"Made in the USA: The Rise and Retreat of American Manufacturing\n\nby Vaclav Smil\n\nPrint Length: 278 pages\n\nPublisher: The MIT Press; 1 edition (August 16, 2013)\n\n\n&quot;There is probably no other writer whose books I anticipate with more enthusiasm than Vaclav Smil. He brings remarkable insight to every topic he examines, combining his vast knowledge of science and energy, history and business to address some of the most pressing issues we face today. So I'm pleased he will be turning that keen intellect to the subject of manufacturing in the U.S.&quot;--Bill GatesIn Made in the USA, Vaclav Smil powerfully rebuts the notion that manufacturing is a relic of predigital history and that the loss of American manufacturing is a desirable evolutionary step toward a pure service economy. Smil argues that no advanced economy can prosper without a strong, innovative manufacturing sector and the jobs it creates. Reversing a famous information economy dictum, Smil argues that serving potato chips is not as good as making microchips. The history of manufacturing in America, Smil tells us, is a story of nation-building. He explains how manufacturing became a fundamental force behind America's economic, strategic, and social dominance. He describes American manufacturing's rapid rise at the end of the nineteenth century, its consolidation and modernization between the two world wars, its role as an enabler of mass consumption after 1945, and its recent decline. Some economists argue that shipping low-value jobs overseas matters little because the high-value work remains in the United States. But, asks Smil, do we want a society that consists of a small population of workers doing high-value-added work and masses of unemployed? Smil assesses various suggestions for solving America's manufacturing crisis, including lowering corporate tax rates, promoting research and development, and improving public education. Will America act to preserve and reinvigorate its manufacturing? It is crucial to our social and economic well-being; but, Smil warns, the odds are no better than even.\n\n\nthanks cntrl+c\n\nhappy enjoy book.  \n fits in kindle directories. if you cant figure out what azw3 is, it fits in kindle directories on your probable device electronic. and if you cant figure out what azw3 is, nor can determine your digital e-reading device &amp;/ apps or how to convert a file,,  ,\n\n GET SOME INTERNET(s?)!!!\n\nread &amp; be merry\n\n\n\n\nh elii  ar                      u yy            ura                 ii    l      eh","torrent":{"xt":"urn:btih:9d5d0be7b92b2bb7e1092f9df90ab3e057155b4b","amp;dn":"Made+in+the+USA%3A+The+Rise+and+Retreat+of+American+Manufacturing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d5d0be7b92b2bb7e1092f9df90ab3e057155b4b","infoHashBuffer":{"type":"Buffer","data":[157,93,11,231,185,43,43,183,225,9,47,157,249,10,179,224,87,21,91,75]},"announce":[],"urlList":[]}}