{"title":"Ancient Near Eastern Texts Relating to the Old Testament (3rd Ed","uid":12043934,"size":269919739,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9efcbdaa44e924fdd5914cc11dad59b62e345055&amp;dn=Ancient+Near+Eastern+Texts+Relating+to+the+Old+Testament+%283rd+Ed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"realOfek","files":3,"time":1434842122,"description":"This anthology brought together the most important historical, legal, mythological, liturgical, and secular texts of the ancient Near East, with the purpose of providing a rich contextual base for understanding the people, cultures, and literature of the Old Testament. A scholar of religious thought and biblical archaeology, James Pritchard recruited the foremost linguists, historians, and archaeologists to select and translate the texts. The goal, in his words, was &quot;a better understanding of the likenesses and differences which existed between Israel and the surrounding cultures.&quot; Before the publication of these volumes, students of the Old Testament found themselves having to search out scattered books and journals in various languages. This anthology brought these invaluable documents together, in one place and in one language, thereby expanding the meaning and significance of the Bible for generations of students and readers. As one reviewer put it, &quot;This great volume is one of the most notable to have appeared in the field of Old Testament scholarship this century.&quot;\n\nNote: This book was scanned in high quality. Also, included is a detailed chart comparing this to &quot;The Context of Scripture&quot;","torrent":{"xt":"urn:btih:9efcbdaa44e924fdd5914cc11dad59b62e345055","amp;dn":"Ancient+Near+Eastern+Texts+Relating+to+the+Old+Testament+%283rd+Ed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9efcbdaa44e924fdd5914cc11dad59b62e345055","infoHashBuffer":{"type":"Buffer","data":[158,252,189,170,68,233,36,253,213,145,76,193,29,173,89,182,46,52,80,85]},"announce":[],"urlList":[]}}