{"title":"Malwarebytes Anti-Malware Premium 2.1.8.1057 Multilang","uid":12057328,"size":24524521,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9fe865bcd5540f3ae1317a8bf719a9d1f05361b2&amp;dn=Malwarebytes+Anti-Malware+Premium+2.1.8.1057+Multilang&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nikita200","files":5,"time":1435157306,"description":"Malwarebytes Anti-Malware is an anti-malware application that can thoroughly remove even the most advanced malware. It includes a number of features, including a built in protection monitor that blocks malicious processes before they even start. Malwarebytes Anti-Malware monitors every process and stops malicious processes before they even start. The Realtime Protection Module uses our advanced heuristic scanning technology which monitors your system to keep it safe and secure. In addition, we have implemented a threats center which will allow you to keep up to date with the latest malware threats.\n\nWhat's new in version 2.1.8.1057:\n\nImprovements:\n- License key is now displayed on the My Account screen\n- Remaining subscription duration now displayed on My Account screen\n- Implemented other licensing improvements to clarify license status\n- Enhanced protection capabilities of Malwarebytes Anti-Malware Web Protection\n- Numerous enhancements to prepare for full compatibility with Windows 10\n- Enhanced Malwarebytes Chameleon's ability to fully restore Malwarebytes functionality when affected by a malware infection\n- Updated data collection techniques to improve malware research and analysis\n- Removed &quot;Exclude&quot; button on Website Blocked notification to reduce inadvertent allowing of malicious sites\n- Updated button text on Malware Detected and Non-Malware Detected notifications to clarify meaning\n- Added enhanced support for High DPI displays\n- Enabled the Malwarebytes Anti-Malware Free version to receive incremental database updates\n- Added appropriate copyright notices and license statements for all third-party open source software\n- Corrected translation errors for core non-English languages (German, French, Spanish, Italian, Dutch, Portuguese, Brazilian Portuguese, Russian and Polish)\n- Added support for Chinese Traditional, which is provided as a convenience for our users by a community volunteer and is not an officially supported language\n- Several improvements to malware detection and remediation capabilities\n\nIssues Fixed:\n- Reverted the temporary change in v.2.1.6 that disabled checking for updates prior to scheduled scans\n- Fixed SDK Database load errors for error code 2 and 1812\n- Removed obsolete &quot;Terminate program when no threats are found&quot; setting since scans now run from the tray application\n- Fixed several crashes that could occur during scan and quarantine operations\n- Fixed crash that occurred when clicking the Clear Policies link on Access Policies screen\n- Fixed issue where &quot;Show notification after successful update&quot; setting was not properly retained during upgrade from v.2.1.4 to v.2.1.6\n- Fixed issue where &quot;Close notification&quot; setting was not retained during upgrade from v. 2.1.4 to v.2.1.6 if the user had changed that setting back to 7 seconds after installing v.2.1.4\n- Fixed issue on the Quarantine screen where unselecting a quarantined item disabled the Delete and Restore buttons\n- Fixed issue where incorrect program version was listed in the scan logs\n- Disabled option to specify rootkit scanning as part of a Hyper scan\n- Fixed issue in Windows 10 Tech Preview and Windows 8.1 where Malwarebytes Anti-Malware was unable to start in certain cases after self-protection was turned on\n- Fixed issue where Malwarebytes Chameleon did not load properly on Windows XP SP3 in certain conditions\n- Fixed issue which prevented Malwarebytes Anti-Malware v.2.1.4 (and higher) from upgrading over certain Malwarebytes Anti-Malware v.1.75 consumer builds\n\nHome Page www.malwarebytes.org","torrent":{"xt":"urn:btih:9fe865bcd5540f3ae1317a8bf719a9d1f05361b2","amp;dn":"Malwarebytes+Anti-Malware+Premium+2.1.8.1057+Multilang","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fe865bcd5540f3ae1317a8bf719a9d1f05361b2","infoHashBuffer":{"type":"Buffer","data":[159,232,101,188,213,84,15,58,225,49,122,139,247,25,169,209,240,83,97,178]},"announce":[],"urlList":[]}}