{"title":"Encyclopedic Dictionary of Industrial Technology [PDF]","uid":12086209,"size":9227111,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a20e8f0271ef5141cefc0a81d9f702b72096d6c2&amp;dn=Encyclopedic+Dictionary+of+Industrial+Technology+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Hawzerstar","files":1,"time":1435916727,"description":"Book name: Encyclopedic Dictionary of Industrial Technology: Materials, Processes and Equipment\n\nBook author: David F. Tver\n\nBook description: This volume has been prepared as a reference guide for all engineering, industrial and technical management personnel who are in any way involved in the manufacturing process, in product design, or in converting of raw materials to finished products. This Encyclopedic Dictionary covers a wide range of subjects from industrial materials, minerals, metals, plastics and synthetic fibers to machine tools, computers, lasers, robots and other production equipment as well as manufacturing processes. Some of the materials reviewed are brass, steel, nickel, copper, bronze, cast iron, cements, clay, coal, coke, petroleum and petrochemicals, glass, limestone, rubber, paper, metal alloys, chemicals, synthetic fibers, textiles, plastics, resins, lubricants, and thermoplastics. Various processes are reviewed such as metal casting, forming, machining, annealÂ­ ing, extrusion, heat treating, injection molding, papermaking and steel processing. In heat treating such areas as martempering, annealing, spheroidizing, tempering and austempering are included. Different types of equipment related to the products are defined. In plastics such proÂ­ ducts are covered as nylons, polyesters, rayons, Teflon, Vinyon, Saran, acetates and acrylics. Many of the manufacturing processes and equipment involved in the conversion of material to finished products are described along with products and their ultimate uses. Also, important associated manufacturing activities such as inspection, handling, and control are included to make the references as complete as is practicable.\n\nNumber of pages: 354\n\nISBN13: 9780412005015\n\nISBN10: 0412005018\n\nFormat: PDF","torrent":{"xt":"urn:btih:a20e8f0271ef5141cefc0a81d9f702b72096d6c2","amp;dn":"Encyclopedic+Dictionary+of+Industrial+Technology+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a20e8f0271ef5141cefc0a81d9f702b72096d6c2","infoHashBuffer":{"type":"Buffer","data":[162,14,143,2,113,239,81,65,206,252,10,129,217,247,2,183,32,150,214,194]},"announce":[],"urlList":[]}}