{"title":"Update on Mouldable Particle Foam Technology","uid":12011935,"size":776551,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a384ec38b1cf19fe08575b35ba5edd033ab8a566&amp;dn=Update+on+Mouldable+Particle+Foam+Technology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1434187667,"description":"ISBN 9781847354068\n\nMoulded particle (bead) foam products are ubiquitous, in packaging and construction, from drinking cups to motorway foundations. The industry which started with Expanded Polystyrene (EPS) has grown spectacularly and now also includes Expanded Polypropylene and Expanded Polyethylene, and its technology and machinery has become so specialised that it is seen as an almost isolated branch of the plastics industry. Update on Mouldable Particle Foam Technology summarises the present status of particle foam technology and how specific challenges have already driven its development. This includes the potential threats to the fire retardants and blowing agents which have been used for many years. The potential for particle foams made from &quot;&quot;renewable&quot;&quot; polymers such as starch, polylactic acid, polyhydroxyalkanoates and cellulosics is also covered. For each of these, existing technology is reviewed, together with the issues for research and development. Update on Mouldable Particle Foam Technology is written by a plastics technologist who recently joined the EPS industry. It will be of interest to both relative newcomers and those who already have long experience but wish to know more technical detail about a fascinating branch of plastics technology","torrent":{"xt":"urn:btih:a384ec38b1cf19fe08575b35ba5edd033ab8a566","amp;dn":"Update+on+Mouldable+Particle+Foam+Technology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a384ec38b1cf19fe08575b35ba5edd033ab8a566","infoHashBuffer":{"type":"Buffer","data":[163,132,236,56,177,207,25,254,8,87,91,53,186,94,221,3,58,184,165,102]},"announce":[],"urlList":[]}}