{"title":"Bleeding.mp3","uid":11834915,"size":5296626,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a3fd7180223782df7efc8a9d68ef7533150fa728&amp;dn=Bleeding.mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Basix92","files":1,"time":1429701924,"description":"Bleeding was written in one, emotionally fueled, afternoon, when the author's 13-year-old sister, who had been cutting for more than a year, attempted suicide. It's an honest response to a painful event. It's rap/hip-hop, emotionally deep, and profound.\n\nLYRICS\n\nBasix Intro:\nA fuck you day, man\nuh huh\n\nBasix Verse #1:\nFrom the top of a world to a bottomless pit\nFrom the fire where my live's well lit\nTo the coldest place where souls go to rest\nN no I ain't just gettin shit off my chest\nFlexin as I be stressin, be readily investin in a question\nLettin off aggression in this rap session is a blessin\nCuz honestly it's keepin me sane, well in line\nBit like me stayin in my own lane, in my mind\nWith all these emotions I'm exposin\nRunnin deeper than oceans.\nNot hopin for a magic potion, so now I'm thought provokin\nShit talkin n invokin malicious rhymes\nNot laughin n jokin, suspicious times\nOn my hands n knees cryin, just hopin you're fine\nJust thinkin bout you dyin, baby girl you're mine\nHere for you one hundred precent of the time\nSo know that's written in cement n not lime\nThat's yesterday, today, and tomorrow too\nSo I pray that today you start to get a clue\n\nLola Chorus:\nWhen you bleed, I bleed, I bleed, I bleed\nWhen you bleed, I bleed, I bleed\nDon't go towards the light\nBecause you already shine, bright\noh...\n\nBasix Verse #2:\nNow I see, the destruction of these chain of events\nNow to me, the corruption you see, pain of prevents\nI'm forever family, I saw you grow up\nDo whatever it takes, but now you blow up\nAt the ones who love you most, no waste of breath\nLike guns above the coast, angel of death\nThis is reality, to see a hospital bed\nWith no vitality, fills me with volatile dread\nSo I'm tryna' wrap my head 'round this but in my head\nIt keeps killin till I'm dead, n I might have to behead\nThis pretty boy but I wrote this instead\nIf I annoy, know it's to lesson embed\nGive yourself a few years, open your eyes\nLearn from the new tears, fuck the lies\nAnd you'll do just fine, that's a promise I can keep\nEyes are blue not blind, in time, benefits you'll reap\nWill surpass any of this trash, real talk\nBurn to ash all that's in the past, then walk\nOn with a new you, it's the thing to do\nKnow that my love's true, now you've got a clue\n\nThat's all I really got to fucking say,\nI love you to death Sara...\n\nLola Chorus:\nWhen you bleed, I bleed, I bleed, I bleed\nWhen you bleed, I bleed, I bleed\nDon't go towards the light,\nBecause you already shine, bright\noh...\n\nLola Outro:\nWhen you bleed, I bleed, I bleed, I bleed\nYou already shine bright\n\nThere eleven more tracks on my website at http://backtothebasix.com/","torrent":{"xt":"urn:btih:a3fd7180223782df7efc8a9d68ef7533150fa728","amp;dn":"Bleeding.mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3fd7180223782df7efc8a9d68ef7533150fa728","infoHashBuffer":{"type":"Buffer","data":[163,253,113,128,34,55,130,223,126,252,138,157,104,239,117,51,21,15,167,40]},"announce":[],"urlList":[]}}