{"title":"The Anthony Cumia Show 2015-06-09 Nick DiPaolo MP4 MP3","uid":12007457,"size":353203890,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a4419cc060caf67d1432413e5417e03dcb8bca07&amp;dn=The+Anthony+Cumia+Show+2015-06-09+Nick+DiPaolo+MP4+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mothergoose58","files":2,"time":1433955104,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest: Nick DiPaolo\n\nEpisode 176 - TACS kicks off with Ant briefly talking about the bomb scare at the White House and how the media handled it, his Twitter debate surrounding the &quot;police vs. teenagers&quot; video from McKinney, the public misinterpreting news stories, media coverage on public protests, and thoroughly explains the need for compliance. He relocates to the table of the stars to meet with Nick DiPaolo where they chat about the repetitiveness of media coverage, the apparent ease of getting past White House security, public distraction, ISIS selfies, ISIS's attack on Bagdad and the President admitting there's no plan to stop it, and they both question the sham in not handling ISIS. They then discuss lack of info about Obama's past, past presidents, Caitlyn Jenner, the government stepping in where they're not needed, the government's justification of tax laws, the possibility of Hillary Clinton becoming President, the mystery surrounding Bin Laden's death, hypocrisy in the media, and the lack of outrage surrounding Hillary's speech/interview. Ant and Nick also talk Kardashians, the ridiculousness of reality TV, Jon Stewart and the Daily Show, they breakdown the McKinney video, talk about de Blasio's policies, stats behind &quot;racist cops&quot;, playing the victim, they take a look at and discuss a white trash Walmart fight video, bring up Ann Coulter, cultural evilness, the TV show Lockup, and commiserate about how awful they'd be as criminals. They then get into authority and freedoms, man caves, Nick shares a story about what happened after the first time he did TACS, they talk about reactions to bugs, going on cruises, issues on cruise ships, and getting sick on the sea and in cars.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:a4419cc060caf67d1432413e5417e03dcb8bca07","amp;dn":"The+Anthony+Cumia+Show+2015-06-09+Nick+DiPaolo+MP4+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4419cc060caf67d1432413e5417e03dcb8bca07","infoHashBuffer":{"type":"Buffer","data":[164,65,156,192,96,202,246,125,20,50,65,62,84,23,224,61,203,139,202,7]},"announce":[],"urlList":[]}}