{"title":"Daniel Tiger's Neighborhood (PBS Kids) S2, Eps 01-11","uid":12103560,"size":2554671774,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a446657aaa2bf74e7400a6127156807aa1a12547&amp;dn=Daniel+Tiger%27s+Neighborhood+%28PBS+Kids%29+S2%2C+Eps+01-11&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NantoVision","files":11,"time":1436395728,"description":"Created by Angela Santomero, the creator of Blue's Clues and Super Why!, Daniel Tiger's Neighborhood is a new animated sequel to Mr. Rogers' Neighborhood, where all the original characters from the Neighborhood of Make-Believe are now grown up with their own preschool-aged children. The series centers around a four-year-old Daniel Tiger, son of the original Daniel Striped Tiger. Other characters include Katerina Kittycat, O the Owl, and Prince Wednesday. Two 11-minute episodes are linked by a common socio-emotional theme, such as disappointment, sadness or anger. The theme also uses a Musical Motif phrase to reenforce the theme and help children remember. The series is co-produced by The Fred Rogers Company (formerly Family Communications) and Out of the Blue Enterprises, with animation produced in Canada by 9 Story Entertainment.\t\n\nHere's the final batch of first season episodes, encoded by me from recordings off my local PBS station. This pack contains all of the episodes that aired in Jan-Feb 2014. The show has been renewed for a second season, which will start airing in Fall 2014. \n\nIf your family enjoys these episodes, please leave me a thank-you comment! After your download completes, please leave the torrent open for as long as possible so that it will be fully seeded for others to enjoy. If people continue to seed, I will continue posting new episodes when they are shown.\n\nCheck out my video collecting blog: nantovision at blog spot dot com","torrent":{"xt":"urn:btih:a446657aaa2bf74e7400a6127156807aa1a12547","amp;dn":"Daniel+Tiger%27s+Neighborhood+%28PBS+Kids%29+S2%2C+Eps+01-11","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a446657aaa2bf74e7400a6127156807aa1a12547","infoHashBuffer":{"type":"Buffer","data":[164,70,101,122,170,43,247,78,116,0,166,18,113,86,128,122,161,161,37,71]},"announce":[],"urlList":[]}}