{"title":"Little Asian Transsexuals 12 XXX DVDRip","uid":12108803,"size":3029346556,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:a4a4a1931c3dca80d52e79d742e8e101ba4bb0e4&amp;dn=Little+Asian+Transsexuals+12+XXX+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Ctrlme","files":4,"time":1436506015,"description":"Screenshot(s): &lt;a href=&quot;\nhttp://imgctrl.com/image/Aph&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/Aph&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgctrl.com/image/Ap5&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/Ap5&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgctrl.com/image/ApR&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/ApR&lt;/a&gt;\n\nLittle Asian Transsexuals is one of Third World Medias most popular series. And it's not hard to figure out why. The combination of Beautiful Ladyboys, most of whom look even better than real girls, and white guys (Falang) with fat shafts that drill out their silky asses. The last factor in the equation is that these lovely ladies got meaty cocks, that are at times more capable of spraying thick cumloads than your average real dude.\n\nChacha is our lovely Cover Girl, with super long legs that stretch endlessly from her toes to her thick juicy ass and chubby package. She wears red fishnet stockings and quickly unleashes her hairless, yet hefty hog. Her skin is golden brown and her asshole is hairless. Her frame is skinny and tight, yet her tits are large and neatly done. Her long hair stretches down to her stiffie, as Allen gets ready to throw his own healthy wang into play. Chacha knows exactly what to do, and swallows the majority of it while stroking her own 7 inch boner. They rub cocks and balls together, as Allan splits her cheeks and deep plugs her soft arse. He wraps her legs behind her ears and continues to ram her shitter while she strokes her own bird. Her girly voice moans as her boyish side flops around, before Allan pulls out and sprays a watery one all over her cock and balls. She shows Allen what time it is by rubbing out a doubly thick and creamy one by herself. Director Dimitri interviews her in English, getting lots of laughs and giggles, before she strips naked and jumps in the shower to wash her unusually thick Ladyboy ass. \n\nLee is the very cute and petite tranny, who has graced the covers of Little Asian Transsexuals before. She is as cute and sexy as ever, with super long dark hair, pretty face and very slim frame. Her cock sucking skills seem to have improved over time, as she swallows more than a few inches of foreign-born meat. Her nipples have budded nicely and her cock and balls bulging from her g-string appear just about as small and stiff as we have seen it before. Our guy licks her legs up and down, starting from her long boots and ending up at her stiff little weenie. He sucks her tiny sausage and licks her little tits some more, before rubbing cocks and reaming out her skinny asshole. Her nutsack hangs nicely as he back-doors this tiny tranny whore. He pounds her ass out in multiple positions stretching her skinny frame and tiny shiter to the limit. He pulls out dumping semen all over her slightly saggy sack, as she continues to jerk herself off using his cum load as lube. She manages to muster up a watery one of her own to mix with his puddle.\n\nSunny is still celebrating her 18th birthday, which was just the day before the shoot. She wears long patent leather boots, vest and a sexy hat. Allan gets the call on this newbie, as he licks her young shaft and tosses around her saggy scrotum. Allan has a foot fetish and is very excited by the site of an Asian tranny in high boots; especially a young cute one like Sunny. She rubs her cock and let her balls bounce around as Allan warms up her mouth with his dick. The two join together, rubbing cocks before Allan bends her over and stuffs her tight pooper. Her balls sway with each pump. Her ass proves tight for Allan who pulls out and squirts all over her stiffie. She continues to whack away, building up a triple thick, super load that stretches from her naval and almost all the way to her healthy bosom. Dimitri attempts to interview her about her 18th birthday. Her English skills could definitely use some polishing. \n\nNang is a light-haired tranny, who jerks her tiny wiener while watching porn on her cell phone. This ladyboy is 100% whore, staying up for days at a time partying, sucking, and fucking any cock that she can find. Her eyes maybe bloodshot, but her cock is hard and her mouth stands ready to suck Allan's big one. He crams every inch down her throat and she handles it all with ease. He sucks up her cock too, which resembles a stubby toothpick more than a meaty hog. He wraps her legs behind her ears and splits her bung hole as she strokes her tiny thang. He pile drives her ass,. then makes her ride his pole as her dark ding dong bounces. Her hormone titties puff up and shake, as Allan pulls out and blows on her puffy right nipple. She strokes away and grinds on Allan before pulling back her foreskin and coughing up a milky one from her bright pink tip","torrent":{"xt":"urn:btih:a4a4a1931c3dca80d52e79d742e8e101ba4bb0e4","amp;dn":"Little+Asian+Transsexuals+12+XXX+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4a4a1931c3dca80d52e79d742e8e101ba4bb0e4","infoHashBuffer":{"type":"Buffer","data":[164,164,161,147,28,61,202,128,213,46,121,215,66,232,225,1,186,75,176,228]},"announce":[],"urlList":[]}}