{"title":"Process Plant Design - Project Management from Inquiry to Accept","uid":12110370,"size":3343621,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a4a6a8ae17be6d233e2927725bdc576dceb6a460&amp;dn=Process+Plant+Design+-+Project+Management+from+Inquiry+to+Accept&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1436554381,"description":"Process Plant Design - Project Management from Inquiry to Acceptance - Frank Peter Helmus (Wiley-VCH, 2008).pdf\n\nISBN 9783527313136\n\nThis book describes the fascinating wealth of activities as they occur in the design, construction and commissioning of a chemical plant - a jigsaw puzzle of the work of chemical engineers, chemists, constructors, architects, electrical engineers, process automation engineers, economists and legal staff.\nThe author first takes the reader through the conceptual phase, in which the economic relevance and environmental impact need to be considered and supplemented by accurate estimates of capital requirements and profitability. This phase ends with the choice of an appropriate engineering firm and the conclusion of the contract, after which the reader is guided through all aspects of the implementation phase from the engineering of the chemical plant to commissioning, equipment and material procurement, the erection phase and the successful test run, after which the new facility is handed over to its owner.\nThe book also illustrates many potential sources of errors by means of examples from practice, and how, aside professional skills, teamwork and communication are also absolutely essential to keep such a complex project on track","torrent":{"xt":"urn:btih:a4a6a8ae17be6d233e2927725bdc576dceb6a460","amp;dn":"Process+Plant+Design+-+Project+Management+from+Inquiry+to+Accept","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4a6a8ae17be6d233e2927725bdc576dceb6a460","infoHashBuffer":{"type":"Buffer","data":[164,166,168,174,23,190,109,35,62,41,39,114,91,220,87,109,206,182,164,96]},"announce":[],"urlList":[]}}