{"title":"A Laboratory Course in Nanoscience and Nanotechnology","uid":12034446,"size":3366569,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a4b26608b21bbe940f59f89afbe4dcb289777e58&amp;dn=A+Laboratory+Course+in+Nanoscience+and+Nanotechnology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1434663588,"description":"ISBN 9781482231045\n\nAlthough there are many theoretical nanotechnology and nanoscience textbooks available to students, there are relatively few practical laboratory-based books. Filling this need, A Laboratory Course in Nanoscience and Nanotechnology presents a hands-on approach to key synthesis techniques and processes currently used in nanotechnology and nanoscience. Written by a pioneer in nanotechnology, this practical manual shows undergraduate students how to synthesize their own nanometer-scale materials and structures and then analyze their results using advanced characterization techniques.\n\n\n\nThrough a series of well-designed, classroom-tested lab experiments, students directly experience some of the magic of the nano world. The lab exercises give students hands-on skills to complement their theoretical studies. Moreover, the material in the book underscores the truly interdisciplinary nature of nanoscience, preparing students from physics, chemistry, engineering, and biology for work in nanoscience- and nanotechnology-related industries.\n\n\n\nAfter introducing examples of nanometer-scale materials and structures found in nature, the book presents a range of nanometer-scale materials and the synthesis processes used to produce them. It then covers advanced characterization techniques for examining nanometer-scale materials and structures. It also addresses lab safety and the identification of potential hazards in the lab before explaining how to prepare a scientific report and present research results. In addition, the author discusses typical projects undertaken in nanotechnology labs, such as the analysis of samples using scanning electron microscopy and atomic force microscopy. The book concludes with a set of projects that students can do while collaborating with a mentor or supervisor","torrent":{"xt":"urn:btih:a4b26608b21bbe940f59f89afbe4dcb289777e58","amp;dn":"A+Laboratory+Course+in+Nanoscience+and+Nanotechnology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4b26608b21bbe940f59f89afbe4dcb289777e58","infoHashBuffer":{"type":"Buffer","data":[164,178,102,8,178,27,190,148,15,89,248,154,251,228,220,178,137,119,126,88]},"announce":[],"urlList":[]}}