{"title":"Nanoscale Materials In Chemistry","uid":12060234,"size":7437475,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a52d5a127aedc1e994266275d93f5ba8ec2786ed&amp;dn=Nanoscale+Materials+In+Chemistry&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1435240313,"description":"ISBN 0471383953\n\nIn recent years, interest in the preparation and characterization of nanostructured materials has grown due to their distinctive properties and potential technological applications. Nanoscale materials represent a new realm of matter and offer widespread possibilities for contributions to science and technology. &quot;Nanoscale Materials in Chemistry&quot; explores the vast potential of nanomaterials and serves as essential reading for the entire science community. The extensive coverage of &quot;Nanoscale Materials in Chemistry&quot; presents a thorough introduction to the field of nanostructured materials, including chemical synthesis methods, bonding theories, and applications. Because nanomaterials are finding more applications in the real world, this text contains up-to-date treatment of such topics as: Metals, semiconductor nanocrystals, and ceramics; Double layers, optical properties, and the electrochemistry of metal nanoparticles; Chemical and catalytic aspects of nanocrystals; and Specific heats and melting points of nanocrystalline materials. Authored by world-renowned experts in the field of nanotechnology, &quot;Nanoscale Materials in Chemistry&quot; is suitable as a primary text for graduate courses and is a reliable resource for scientists","torrent":{"xt":"urn:btih:a52d5a127aedc1e994266275d93f5ba8ec2786ed","amp;dn":"Nanoscale+Materials+In+Chemistry","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a52d5a127aedc1e994266275d93f5ba8ec2786ed","infoHashBuffer":{"type":"Buffer","data":[165,45,90,18,122,237,193,233,148,38,98,117,217,63,91,168,236,39,134,237]},"announce":[],"urlList":[]}}