{"title":"Mary Berrys Absolute Favourites-Season 1-WebDL-SD-x264","uid":12043052,"size":1044782110,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a5bf2e79c5ad503bb314708a90bd52d2d47b70e8&amp;dn=Mary+Berrys+Absolute+Favourites-Season+1-WebDL-SD-x264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"uggauga","files":12,"time":1434822745,"description":"All six episodes of Mary Berry's Absolute Favourites - enjoy !!\n-----------------------------------------------------------------------------\nIn this delightful six part series, the nation's best-loved home cook draws on her wealth of cookery know-how to share a selection of her absolute favourite recipes. Each week Mary draws inspiration from a favourite place, one where she loves to spend time, and cooks up tried and tested crowd pleasers as well as a bounty of new dishes that are easy to make, yet guaranteed to impress all your family and friends.\n\nIn the series finale, Mary cooks dishes inspired by her home and family. No matter how busy Mary is, her top priority is to have the family round for a meal and three generations of Mary's family visit her in the kitchen and get involved with the cooking.\n\nTo start, a delicious Malay fried rice. It's Mary's husband Paul's favourite dish and bursting with flavour, it never fails to be a real crowd pleaser. One of Mary's joys in life is cooking with her grandchildren and it's no surprise that Mary's next dish, a delicious chicken pasta bake, has become one of their favourites! Next, the family come together to enjoy a delicious harrisa spiced lamb casserole - a perfect alternative to a Sunday roast. Then it's back to the kitchen where Mary's granddaughters are on hand to help make three different flavoured scrumptious biscuits, all made from the same dough. To finish, Mary makes her easy lemon meringue pie - the perfect desert for a family gathering; simple to make but guaranteed to have them coming back for seconds","torrent":{"xt":"urn:btih:a5bf2e79c5ad503bb314708a90bd52d2d47b70e8","amp;dn":"Mary+Berrys+Absolute+Favourites-Season+1-WebDL-SD-x264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5bf2e79c5ad503bb314708a90bd52d2d47b70e8","infoHashBuffer":{"type":"Buffer","data":[165,191,46,121,197,173,80,59,179,20,112,138,144,189,82,210,212,123,112,232]},"announce":[],"urlList":[]}}