{"title":"Halestorm - Into The Wild Life (Deluxe Explicit) (2015) {FLAC} ","uid":12052367,"size":414120105,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a65e4f4a00e6fffb11f739ae1d132085c7fd73b2&amp;dn=Halestorm+-+Into+The+Wild+Life+%28Deluxe+Explicit%29+%282015%29+%7BFLAC%7D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"vtwin88cube","files":18,"time":1435039901,"description":"Halestorm\nInto The Wild Life (Deluxe Explicit Edition) (2015)\n\n\n\n\n\nallmusic.com...\n\nSiblings Elizabeth and Arejay Hale, the core members of the hard rock band Halestorm, began the group in late 1997 near York, Pennsylvania, with Arejay on drums and Elizabeth on vocals and keyboard. Wanting to expand their sound, the duo invited their father, Roger, to play bass for Halestorm. Soon after their first professional gig in 1998 at the Blue Mountain Coffee House in Hershey, Pennsylvania, the band added various guitar players and released an EP, 1999's (Don't Mess with The) Time Man. More lineup changes occurred, but Halestorm finally solidified with Elizabeth (who was by then going by Lzzy) on vocals and guitar, Josh Smith on bass, Arejay on drums, and Joe Hottinger on guitar. The band caught the attention of producer David Ivory as well as Atlantic Records, both of whom were involved in the band's major-label debut, 2006's One and Done, a five-song EP recorded live at a show in Philadelphia. They would finally make their full-length studio debut in 2009 with the eponymous Halestorm, all the while maintaining a rigorous touring schedule that would see them playing upwards of 250 shows a year. The following year, Halestorm released the concert recording Live in Philly 2010, and Reanimate: The Covers EP appeared in 2011, featuring the band's takes on songs by Heart, Guns N' Roses, and Lady Gaga. Their sophomore album, The Strange Case Of..., followed in 2012, and the single &quot;Love Bites (So Do I)&quot; earned the group a Grammy Award for Best Hard Rock/Metal Performance. Reanimate 2.0 was released in 2013, this time finding the band tackling Fleetwood Mac, Daft Punk, and Marilyn Manson. The band's eclectic third studio long-player, the Jay Joyce-produced Into the Wild Life, was released in April 2015, and was preceded by the single &quot;Apocalyptic.&quot; \n\n\nGenre................: Hard Rock\nQuality..............: Free Lossless Audio Codec (FLAC)\nLabel.................: Atlantic\nIncluded.............: Front Cover, auCDtect, Cue\n\n\n01.Scream\n02.I Am The Fire\n03.Sick Individual\n04.Amen\n05.Dear Daughter\n06.New Modern Love\n07.Mayhem\n08.Bad Girl's World\n09.Gonna Get Mine\n10.The Reckoning\n11.Apocalyptic\n12.What Sober Couldn't Say\n13.I Like It Heavy\n14.Jump The Gun (Bonus Track)\n15.Unapologetic (Bonus Track)\n\n\n\n\n\nTHANKS for Seeding!\nCheers","torrent":{"xt":"urn:btih:a65e4f4a00e6fffb11f739ae1d132085c7fd73b2","amp;dn":"Halestorm+-+Into+The+Wild+Life+%28Deluxe+Explicit%29+%282015%29+%7BFLAC%7D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a65e4f4a00e6fffb11f739ae1d132085c7fd73b2","infoHashBuffer":{"type":"Buffer","data":[166,94,79,74,0,230,255,251,17,247,57,174,29,19,32,133,199,253,115,178]},"announce":[],"urlList":[]}}