{"title":"An Integrated Introduction to Computer Graphics and Geometric Mo","uid":12308395,"size":13648527,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a674e83c4f1f98383e5e5b78661c62155a845fd7&amp;dn=An+Integrated+Introduction+to+Computer+Graphics+and+Geometric+Mo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"heyo111","files":2,"time":1440838385,"description":"An Integrated Introduction to Computer Graphics and Geometric Modeling\n\nRonald Goldman\n\nSummary\n\nTaking a novel, more appealing approach than current texts, An Integrated Introduction to Computer Graphics and Geometric Modeling focuses on graphics, modeling, and mathematical methods, including ray tracing, polygon shading, radiosity, fractals, freeform curves and surfaces, vector methods, and transformation techniques. The author begins with fractals, rather than the typical line-drawing algorithms found in many standard texts. He also brings the turtle back from obscurity to introduce several major concepts in computer graphics.\n\nSupplying the mathematical foundations, the book covers linear algebra topics, such as vector geometry and algebra, affine and projective spaces, affine maps, projective transformations, matrices, and quaternions. The main graphics areas explored include reflection and refraction, recursive ray tracing, radiosity, illumination models, polygon shading, and hidden surface procedures. The book also discusses geometric modeling, including planes, polygons, spheres, quadrics, algebraic and parametric curves and surfaces, constructive solid geometry, boundary files, octrees, interpolation, approximation, Bezier and B-spline methods, fractal algorithms, and subdivision techniques.\n\nMaking the material accessible and relevant for years to come, the text avoids descriptions of current graphics hardware and special programming languages. Instead, it presents graphics algorithms based on well-established physical models of light and cogent mathematical methods","torrent":{"xt":"urn:btih:a674e83c4f1f98383e5e5b78661c62155a845fd7","amp;dn":"An+Integrated+Introduction+to+Computer+Graphics+and+Geometric+Mo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a674e83c4f1f98383e5e5b78661c62155a845fd7","infoHashBuffer":{"type":"Buffer","data":[166,116,232,60,79,31,152,56,62,94,91,120,102,28,98,21,90,132,95,215]},"announce":[],"urlList":[]}}