{"title":"Shelter v2.0.9","uid":12000850,"size":55602647,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:a7470c5b7e702a6b0951826e130b70f55e648225&amp;dn=Shelter+v2.0.9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Androider","files":2,"time":1433776948,"description":"Shelter is an exciting new zombie card-dueling game.\n\nPlaying like a hybrid of a collectible card game and the castle defence genre, Shelter will provide you with hours of challenging play.\n\nDefend yourself from the zombie onslaught as you fight to be reunited with the woman you love. You define your strategy, but be warned...\n\n...You'll need to adapt to survive.\n\nFeatures:\n\n- Deep but accessible gameplay. Easy to learn. Hard to master.\n- More than 100 game cards.\n- Integrated deck builder for deeply customisable play.\n- Graphic novel &amp; comic inspired hand drawn artwork.\n- Compelling story and characters.\n- 5 Campaign levels including a free roaming level.\n\nDetails:\n\nThe inspiration for Shelter comes from the desire to combine the complex, rich gaming mechanics of collectible card duelling games with the simple accessible gameplay of the castle defence genre.\n\nShelter is an asymmetric single-player card game where you build a deck of duelling cards and take them into battle against a zombie deck that &quot;plays itself&quot;. The zombie deck is not controlled by a hideously complex AI, but plays based on a simple set of rules with dice rolls to add the element of chance. You must fight off the waves of zombies before they smash your shelter's barricades and start munching on your brains.\n\nYou choose your survival strategy when you build your deck. Do you pack as many guns into your deck as you can? Do you use traps and reinforce your defences? Do you stun stronger zombies and pick off the weak ones? You have the freedom to play as you want.\n\nAs you win duels, you will be rewarded with new cards to work into your deck and streamline your play style. You will also meet allies throughout the campaign who you take into battle with you. Each ally brings 5 themed cards to the table that allow you to experience different styles of play.\n\nWhat's New:\n\n[FIX] Fixed out-of-order issues when repeatedly playing comic sequences\n[CHANGE] Switched back button to take user to menu during sequences, not skip forwards\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.shelter_droid.shelter&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.shelter_droid.shelter&lt;/a&gt;\n\n\nInstructions:\n\n1.Copy 'com.shelter_droid.shelter' folder to 'sdcard/Android/obb'\n2.Install APK\n3.Launch the game","torrent":{"xt":"urn:btih:a7470c5b7e702a6b0951826e130b70f55e648225","amp;dn":"Shelter+v2.0.9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7470c5b7e702a6b0951826e130b70f55e648225","infoHashBuffer":{"type":"Buffer","data":[167,71,12,91,126,112,42,107,9,81,130,110,19,11,112,245,94,100,130,37]},"announce":[],"urlList":[]}}