{"title":"Architecture at the End of the Earth - Russian North.pdf","uid":12113894,"size":32528676,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a7978402fdcd9087ac2a43423ced017d1dc0fe95&amp;dn=Architecture+at+the+End+of+the+Earth+-+Russian+North.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"STBGD","files":1,"time":1436640449,"description":"Architecture at the End of the Earth by William Craft Brumfield\nEnglish | 2015 | ISBN 0822359065 | 272 Pages | PDF (conv) | 31.02 MB\n\nCarpeted in boreal forests, dotted with lakes, cut by rivers, and straddling the Arctic Circle, the region surrounding the White Sea, which is known as the Russian North, is sparsely populated and immensely isolated. It is also the home to architectural marvels, as many of the original wooden and brick churches and homes in the region's ancient villages and towns still stand. Featuring nearly two hundred full color photographs of these beautiful centuries-old structures, &quot;Architecture at the End of the Earth&quot; is the most recent addition to William Craft Brumfield's ongoing project to photographically document all aspects of Russian architecture. The architectural masterpieces Brumfield photographed are diverse: they range from humble chapels to grand cathedrals, buildings that are either dilapidated or well cared for, and structures repurposed during the Soviet era. Included are onion-domed wooden churches such as the Church of the Dormition, built in 1674 in Varzuga; the massive walled Transfiguration Monastery on Great Solovetsky Island, which dates to the mid-1550s; the Ferapontov-Nativity Monastery's frescoes, painted in 1502 by Dionisy, one of Russia's greatest medieval painters; nineteenth-century log houses, both rustic and ornate; and the Cathedral of St. Sophia in Vologda, which was commissioned by Ivan the Terrible in the 1560s. The text that introduces the photographs outlines the region's significance to Russian history and culture. Brumfield is challenged by the immense difficulty of accessing the Russian North, and recounts traversing sketchy roads, crossing silt-clogged rivers on barges and ferries, improvising travel arrangements, being delayed by severe snowstorms, and seeing the region from the air aboard the small planes he needs to reach remote areas. The buildings Brumfield photographed, some of which lie in near ruin, are at constant risk due to local indifference and vandalism, a lack of maintenance funds, clumsy restorations, or changes in local and national priorities. Brumfield is concerned with their futures and hopes that the region's beautiful and vulnerable achievements of master Russian carpenters will be preserved. &quot;Architecture at the End of the Earth&quot; is at once an art book, a travel guide, and a personal document about the discovery of this bleak but beautiful region of Russia that most readers will see here for the first time","torrent":{"xt":"urn:btih:a7978402fdcd9087ac2a43423ced017d1dc0fe95","amp;dn":"Architecture+at+the+End+of+the+Earth+-+Russian+North.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7978402fdcd9087ac2a43423ced017d1dc0fe95","infoHashBuffer":{"type":"Buffer","data":[167,151,132,2,253,205,144,135,172,42,67,66,60,237,1,125,29,192,254,149]},"announce":[],"urlList":[]}}