{"title":"Starcraft 2 Wings Of Liberty 1.0 Crack [Liberty]","uid":12111560,"size":22020206,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a79aad455406ca0b64b27d69759c31bf201d84ec&amp;dn=Starcraft+2+Wings+Of+Liberty+1.0+Crack+%5BLiberty%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"djupload","files":13,"time":1436587574,"description":"StarCraft II continues the epic saga of the Protoss, Terran, and Zerg. These three distinct and powerful races clash once again in the fast-paced real-time strategy sequel to the legendary original, StarCraft. Legions of veteran, upgraded, and brand-new unit types do battle across the galaxy, as each faction struggles for survival. Featuring a unique single-player campaign that picks up where StarCraft: Brood War left off, StarCraft II presents a cast of new heroes and familiar faces in an edgy sci-fi story filled with adventure and intrigue. In addition, Blizzard again offers unparalleled online play through Battle.net, the company's world-renowned gaming service, with several enhancements and new features to make StarCraft II the ultimate competitive real-time strategy game. Features fast-paced, hard-hitting, tightly balanced competitive real-time strategy gameplay that recaptures and improves on the magic of the original game. New units and gameplay mechanics further distinguish each race. Vibrant new 3D-graphics engine with support for dazzling visual effects and massive unit and army sizes. Full map-making and scripting tools to give players incredible freedom in customizing and personalizing their gameplay experience","torrent":{"xt":"urn:btih:a79aad455406ca0b64b27d69759c31bf201d84ec","amp;dn":"Starcraft+2+Wings+Of+Liberty+1.0+Crack+%5BLiberty%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a79aad455406ca0b64b27d69759c31bf201d84ec","infoHashBuffer":{"type":"Buffer","data":[167,154,173,69,84,6,202,11,100,178,125,105,117,156,49,191,32,29,132,236]},"announce":[],"urlList":[]}}