{"title":"Advances in Solid Oxide Fuel Cells VI","uid":11994628,"size":12399224,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a7ab8d26b0513024491a05868d2b2b94fae0d890&amp;dn=Advances+in+Solid+Oxide+Fuel+Cells+VI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1433598602,"description":"ISBN 9780470594698\n\n\nThe Seventh International Symposium on Solid Oxide Fuel Cells (SOFC): Materials, Science, and Technology was held during the 34th International Conference and Exposition on Advanced Ceramics and Composites in Daytona Beach, FL, January 24 to 29, 2010. This symposium provided an international forum for scientists, engineers, and technologists to discuss and exchange state-of-the-art ideas, information, and technology on various aspects of solid oxide fuel cells. A total of 75 papers were presented in the form of oral and poster presentations, including ten invited lectures, indicating strong interest in the scientifically and technologically important field of solid oxide fuel cells. Authors from eleven countries (China, Denmark, Germany India, Italy, Japan, Russia, South Korea, Taiwan, UK and U.S.A.) participated. The speakers represented universities, industries, and government research laboratories.\nThese proceedings contain contributions on various aspects of solid oxide fuel cells that were discussed at the symposium. Fifteen papers describing the current status of solid oxide fuel cells technology are included in this volume","torrent":{"xt":"urn:btih:a7ab8d26b0513024491a05868d2b2b94fae0d890","amp;dn":"Advances+in+Solid+Oxide+Fuel+Cells+VI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7ab8d26b0513024491a05868d2b2b94fae0d890","infoHashBuffer":{"type":"Buffer","data":[167,171,141,38,176,81,48,36,73,26,5,134,141,43,43,148,250,224,216,144]},"announce":[],"urlList":[]}}