{"title":"Active Boot Disk Suite 10.0.3","uid":11973385,"size":441893737,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a82f18c33cc1570d0ed68cd6e0ca4c0dbc5f292c&amp;dn=Active+Boot+Disk+Suite+10.0.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nikita200","files":2,"time":1432927369,"description":"Active@ Boot Disk contains a collection of powerful utilities to perform data recovery, data imaging, secure data erasure and a number of other tasks all from a bootable CD/DVD or USB flash media. The self-contained boot environment by-passes the operating system allowing you to boot previously unbootable PCs. &quot; Finally, we come to a boot disc that offers useful tools, is easy to use, and can be created from virtually any XP or Vista computer. &quot; Active@ Boot Disk is a complete and functioning computer operating system on CD/DVD/USB disk. You simply insert a boot disk into your computer, and reboot.\n\nWhile a live CD does not modify the operating system already installed on a computer's hard drive, it includes many tools to boot up a computer and fix most startup, PC configuration, and system management problems. Active@ Boot Disk is based on lightweight Windows 7, SP1 (WinPE 3.1) operating system environment. It contains disk image, data recovery, password resetting, data erasure, network access tools and system utilities. Active@ Boot Disk is a custom configured system. Necessary drivers and scripts can be installed. One may add an alternate language keyboard layout.\n\n Homepage: boot-disk.com","torrent":{"xt":"urn:btih:a82f18c33cc1570d0ed68cd6e0ca4c0dbc5f292c","amp;dn":"Active+Boot+Disk+Suite+10.0.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a82f18c33cc1570d0ed68cd6e0ca4c0dbc5f292c","infoHashBuffer":{"type":"Buffer","data":[168,47,24,195,60,193,87,13,14,214,140,214,224,202,76,13,188,95,41,44]},"announce":[],"urlList":[]}}