{"title":"Watch_Dogs [PC] Repack 2015-cracked by R.G. Games","uid":12058910,"size":18950647988,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a97ce545eabfb79e9c9973540cb1f70ff5594397&amp;dn=Watch_Dogs+%5BPC%5D+Repack+2015-cracked+by+R.G.+Games&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Abt_Daniel_91","files":8,"time":1435189854,"description":"Watch_Dogs is an innovative action game with an open-structured city of Chicago, stuffed with cutting-edge technologies, in which the most powerful weapon of the protagonist are his hacking skills. The game is a work of several studies led by Ubisoft Montreal which is known for game series such as Assassin's Creed, Tom Clancy's Rainbow Six, or Far Cry.\nThe players assume the role of Aiden Pearce, a former criminal and an anti-hero, who is an expert in hacking. His skills enable him to cause a collision by manipulating traffic lights at an intersection, connect to the municipal monitoring system or hack into phones of people he passes by to learn more about them and, for example, influence their daily life in some way (save them from a thief, help them to take revenge etc.). Pearce talents allow him to control almost every element of the modern world that surrounds him.\nDoing all of the above is possible thanks to the presence of the Central Operating System or just CTO. This solution successfully connected the power supply, urban subway, traffic lights, and security cameras to a single infrastructure network . As a result, metropolitan areas are controlled by computers owned by private companies. These companies use their position to collect huge amounts of data on every citizen. To take control over a district, it is enough to find a local CTOs center and gain the necessary access codes.\nThe game features an open-structured world in which every element connected to the Central Operating System is a potential weapon. All of this does not mean that Aiden is a weakling glued to the screen of his cell phone. On the contrary, he also copes well with the physical violence and is able to deal with considerably more numerous enemy forces. During combat he uses firearms (ranging from handguns to bazookas), homemade explosives, and melee techniques. The cover system helps him to stay alive, as well","torrent":{"xt":"urn:btih:a97ce545eabfb79e9c9973540cb1f70ff5594397","amp;dn":"Watch_Dogs+%5BPC%5D+Repack+2015-cracked+by+R.G.+Games","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a97ce545eabfb79e9c9973540cb1f70ff5594397","infoHashBuffer":{"type":"Buffer","data":[169,124,229,69,234,191,183,158,156,153,115,84,12,177,247,15,245,89,67,151]},"announce":[],"urlList":[]}}