{"title":"The Dedalus Book of French Horror: The 19th Century ","uid":12111764,"size":570953,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a9ad840fdf3227687d1abe9ebc57025f18ca96b0&amp;dn=The+Dedalus+Book+of+French+Horror%3A+The+19th+Century+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ZamKhan","files":1,"time":1436591875,"description":"This anthology provides a representative selection of a century of French horror writing by such authors as Petrus Borel, Theophile Gautier, Gerard de Nerval, Charles Nodier, Guy de Maupassant, Charles Baudelaire, and J.K. Huysmans, most appearing for the first time in English. It traces the full development of a genre that initially appeared in the aftermath of the French Revolution, and has been used to explore the most terrifying aspects of science and social life.\n\nThe two dozen authors collected here span the 19th century, from La Harpe in the aftermath of the Revolution to Huysmans' fin de siecle decadence. Poe, Hoffmann and the English Gothic novel all fed the imagination of the French fantasists, who frequently added a touch of Gallic wit to the heady brew of vampirism, ghostly gore and sexual misbehaving. Hale provides a scholarly introduction to this highly enjoyable selection of strange tales.\n\n&quot;Hale's inspired selection - he includes little-known pieces by Sade, Baudelaire, Dumas and Maupassant, as well as stories by unjustly forgotten writers such as Catulle Mendes, Jean Pichepin, Charles Nodier and Petrus Borel - not only makes this an invigorating collection to read, it virtually redefines the boundaries of the French horror genre.&quot; Brendan King in The Times Literary Supplement","torrent":{"xt":"urn:btih:a9ad840fdf3227687d1abe9ebc57025f18ca96b0","amp;dn":"The+Dedalus+Book+of+French+Horror%3A+The+19th+Century+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9ad840fdf3227687d1abe9ebc57025f18ca96b0","infoHashBuffer":{"type":"Buffer","data":[169,173,132,15,223,50,39,104,125,26,190,158,188,87,2,95,24,202,150,176]},"announce":[],"urlList":[]}}