{"title":"Daughters of the KGB - Douglas Boyd","uid":11964511,"size":4877641,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa6d5d25cb080ed38ad1a4c185fb3dadce224967&amp;dn=Daughters+of+the+KGB+-+Douglas+Boyd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1432601608,"description":"Everyone has heard of the KGB, but little has been published about is 'daughter' organisations through which Moscow terrorised the satellite states grabbed by Stalin during and after the Second World War. Staffed by Moscow-trained nationals closely monitored by KGB 'ambassadors', Poland's UB, the Czech StB, the Hungarian AVH, Romania's Securitate, Bulgaria's KDS and the ultra-Stalinist Stasi of the German Democratic Republic all repressed democratic movements in their respective countries for forty years. They arrested and imprisoned without trial anyone not toeing the Moscow line, earning the hatred of their compatriots. When this boiled over - in GDR 1953, Hungary 1956 and Czechoslovakia 1968 - Russian troops and tanks mowed down unarmed protestors. The 'daughters' also carried out espionage and mokrye dyela assassinations for Moscow in Britain and other Western countries, such as the murder of Bulgarian defector Georgi Markov on Waterloo Bridge in 1978, and occasionally hired professional hit men, including the notorious assassin Carlos the Jackal. Historian and author Douglas Boyd explores for the first time the relationship between the KGB and its ghastly brood of 'daughters' - a true family from hell","torrent":{"xt":"urn:btih:aa6d5d25cb080ed38ad1a4c185fb3dadce224967","amp;dn":"Daughters+of+the+KGB+-+Douglas+Boyd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa6d5d25cb080ed38ad1a4c185fb3dadce224967","infoHashBuffer":{"type":"Buffer","data":[170,109,93,37,203,8,14,211,138,209,164,193,133,251,61,173,206,34,73,103]},"announce":[],"urlList":[]}}