{"title":"Bridging Heterogeneous and Homogeneous Catalysis","uid":11975594,"size":20631231,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aab0d0bdd2030455580598a0f3ec01e0590ebbc4&amp;dn=Bridging+Heterogeneous+and+Homogeneous+Catalysis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1433003781,"description":"There are two main disciplines in catalysis research - homogeneous and heterogeneous catalysis. This is due to the fact that the catalyst is either in the same phase (homogeneous catalysis) as the reaction being catalyzed or in a different phase (heterogeneous catalysis). Over the past decade, various approaches have been implemented to combine the advantages of homogeneous catalysis (efficiency, selectivity) with those of heterogeneous catalysis (stability, recovery) by the heterogenization of homogeneous catalysts or by carrying out homogeneous reactions under heterogeneous conditions.\n \n\nThis unique handbook fills the gap in the market for an up-to-date work that links both homogeneous catalysis applied to organic reactions and catalytic reactions on surfaces of heterogeneous catalysts. As such, it highlights structural analogies and shows mechanistic parallels between the two, while additionally presenting kinetic analysis methods and models that either work for both homogeneous and heterogeneous catalysis. \n \n\nChapters cover asymmetric, emulsion, phase-transfer, supported homogeneous, and organocatalysis, as well as in nanoreactors and for specific applications, catalytic reactions in ionic liquids, fluorous and supercritical solvents and in water. Finally, the text includes computational methods for investigating structure-reactivity relations.\nWith its wealth of information, this invaluable reference provides academic and industrial chemists with novel concepts for innovative catalysis research","torrent":{"xt":"urn:btih:aab0d0bdd2030455580598a0f3ec01e0590ebbc4","amp;dn":"Bridging+Heterogeneous+and+Homogeneous+Catalysis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aab0d0bdd2030455580598a0f3ec01e0590ebbc4","infoHashBuffer":{"type":"Buffer","data":[170,176,208,189,210,3,4,85,88,5,152,160,243,236,1,224,89,14,187,196]},"announce":[],"urlList":[]}}