{"title":"John Medeski, Matthew Shipp - Scotty Hard's Radical Reconstructi","uid":11942272,"size":299260688,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ab85328f7e97c51e3ef03ff13f96790029fc232b&amp;dn=John+Medeski%2C+Matthew+Shipp+-+Scotty+Hard%27s+Radical+Reconstructi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pucholoco","files":18,"time":1431995213,"description":"John Medeski, Matthew Shipp - Scotty Hard's Radical Reconstructive Surgery (2006)\n             EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 280 Mb\n                    Full Artwork @ 300 dpi (jpg) -&gt; 18 Mb\n\n\n\nScotty Hard initially made his reputation in the rap world, but since 2000 or so he's been doing at least as many jazz gigs (if not more), contributing heavily to albums by Sex Mob and Medeski, Martin &amp; Wood. Scotty Hard's Radical Reconstructive Surgery is Hard's first jazz release, put out as part of Thirsty Ear's illustrious Blue Series Continuum. The album is constructed from performances of an amazing all-star group: Matthew Shipp and John Medeski on keyboards, free jazz giant William Parker on bass, and Nasheet Waits on drums, with additional contributions from DJ Olive and percussionist Mauricio Takara.\n\nThen comes the radical reconstructive surgery. Hard takes those performances and transforms them, adding drum machines and samples and using dub techniques and studio production to rework the material into something that probably couldn't have been performed live, but retains the essence of the live performance. For a guy with a reputation as a free player, William Parker sure knows how to work a groove, and he and Waits set up some muscular beats. Shipp and Medeski are both virtuosos in their own right, and Hard contrasts them nicely by having them play different instruments on the songs, generally organ and piano. The playing is great all the way around, but this isn't an album about virtuosic solos; it's about groove and atmosphere and it succeeds in spades. Oddly enough, Hard's modus operandi is laid out in an exerpt from a medical journal written by &quot;The Company of Barber Surgeons&quot; (remember &quot;Theodoric of York&quot;?) concerning bodily humors and &quot;foul vapours&quot; in the curing of the sick. The answer?: &quot;to experiment with new techniques; to undertake a radical reconstructive surgery.&quot; The rest of the quote fits in nicely with the concept as well. Is this traditional jazz? No way. Is it jazz? You bet. Thirsty Ear has been releasing some of the finest examples of this new modern jazz over the last several years, and Radical Reconstructive Surgery stands up nicely alongside releases by avant-jazzmen like Matthew Shipp and Craig Taborn and other entries in the Blue Series Continuum from non-jazzers like Good and Evil and Spring Heel Jack. This is decidedly adventurous jazz that invites listeners in and can make them move at the same time. Well done.\n\n\n-------------------------------------------------------------------------------\nTracklist:\n-------------------------------------------------------------------------------\n\n01 - Primary Humor\n02 - Chance Operation\n03 - St. Clare's Hospital\n04 - Noonday Demon\n05 - The General\n06 - Eclipse\n07 - Apothecary's Cabinet\n08 - The Peeler\n09 - Anatomy of Melancholy\n10 - Round 2\n\n\n* 2006 Thirsty Ear Recordings | THI 57172.2\n\n\nPersonnel:\nJohn Medeski - organ, Wurlizter, Moog synthesizer, mellotron, clavinet, piano\nMatthew Shipp - piano, Wurlitzer, organ\nWilliam Parker - bass\nNasheet Waits - drums\nDJ Olive - turntables\nMauricio Takara - drums, percussion\nScotty Hard - drum machines, samplers, Optigan, percussion\n\n\n\nEnjoy and Sharing, Thanks!","torrent":{"xt":"urn:btih:ab85328f7e97c51e3ef03ff13f96790029fc232b","amp;dn":"John+Medeski%2C+Matthew+Shipp+-+Scotty+Hard%27s+Radical+Reconstructi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab85328f7e97c51e3ef03ff13f96790029fc232b","infoHashBuffer":{"type":"Buffer","data":[171,133,50,143,126,151,197,30,62,240,63,241,63,150,121,0,41,252,35,43]},"announce":[],"urlList":[]}}