{"title":"Catalytic Arylation Methods - Anthony J.Burke","uid":11977483,"size":5007556,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ab8f12d72ba2f51eb28f06e23a18063508762d0c&amp;dn=Catalytic+Arylation+Methods+-+Anthony+J.Burke&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1433081536,"description":"This &quot;hands-on&quot; approach to the topic of arylation consolidates the body of key research over the last ten years (and up to around 2014) on various catalytic methods which involve an arylation process. Clearly structured, the chapters in this one-stop resource are arranged according to the reaction type, and focus on novel, efficient and sustainable processes, rather than the well-known and established cross-coupling methods. The entire contents are written by two authors with academic and industrial expertise to ensure consistent coverage of the latest developments in the field, as well as industrial applications, such as C-H activation, iron and gold-catalyzed coupling reactions, cycloadditions or novel methodologies using arylboron reagents. A cross-section of relevant tried-and-tested experimental protocols is included at the end of each chapter for putting into immediate practice, along with patent literature. \n \n\nDue to its emphasis on efficient, &quot;green&quot; methods and industrial applications of the products concerned, this interdisciplinary text will be essential reading for synthetic chemists in both academia and industry, especially in medicinal and process chemistry","torrent":{"xt":"urn:btih:ab8f12d72ba2f51eb28f06e23a18063508762d0c","amp;dn":"Catalytic+Arylation+Methods+-+Anthony+J.Burke","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab8f12d72ba2f51eb28f06e23a18063508762d0c","infoHashBuffer":{"type":"Buffer","data":[171,143,18,215,43,162,245,30,178,143,6,226,58,24,6,53,8,118,45,12]},"announce":[],"urlList":[]}}