{"title":"Rachel RoXXX BangBros Pack 4 (8  Scenes) -={SPARROW}=-","uid":11823126,"size":2243131481,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:abccf5c87f30219cf2ecb02075072b6505af13ba&amp;dn=Rachel+RoXXX+BangBros+Pack+4+%288++Scenes%29+-%3D%7BSPARROW%7D%3D-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"SS132203","files":10,"time":1429356873,"description":"Rachel RoXXX BangBros Pack 4 (8  Scenes) -={SPARROW}=-\n\nRachel Roxxx is one of our favorite girls on the internet today, and obviously she's one of our members' favorites. She's a spunky petite girl with an amazing body and a hot screen presence. Rachel Roxxx's breasts are the feature of many a man's fantasy. They're a perfect D-cup and are studded with her distinctive curved, spiked nipple piercings. Rachel is only 5 feet tall, but she packs a lot into that small package. She has 34D-23-34 figure and multiple tattoos - three stars tattooed on the side of each hand, a tattoo on her right foot, and a tribal tattoo on her lower back. Rachel was born in San Antonio, Texas on March 2, 1983. She was a Hooters Girl before a friend introduced her into the industry. Before she joined the adult biz, she'd never watched a porn. But she started in 2007 when she was 22 years old. One of the very first places she shot was here at BangBros with Preston Parker for our Big Mouthful's site. Rachel has also gone by Rachel Roxx and Rachel Lyn in her scenes. Since entering the industry, Rachel Roxxx has been featured on numerous websites and over 100 dvd titles and her popularity seems only to be on the rise.Since then, Rachel has shot over 50 scenes and is enjoying every minute of it; although fairly new to the industry she really loves her job.\n\nScreens","torrent":{"xt":"urn:btih:abccf5c87f30219cf2ecb02075072b6505af13ba","amp;dn":"Rachel+RoXXX+BangBros+Pack+4+%288++Scenes%29+-%3D%7BSPARROW%7D%3D-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abccf5c87f30219cf2ecb02075072b6505af13ba","infoHashBuffer":{"type":"Buffer","data":[171,204,245,200,127,48,33,156,242,236,176,32,117,7,43,101,5,175,19,186]},"announce":[],"urlList":[]}}