{"title":"Human Kindness and the Smell of Warm Croissants (2015) epub","uid":11972739,"size":758997,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ac143b7bc855253308b19d050783a7aaf18673be&amp;dn=Human+Kindness+and+the+Smell+of+Warm+Croissants+%282015%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bookzilla","files":1,"time":1432899209,"description":"Human Kindness and the Smell of Warm Croissants: An Introduction to Ethics\n\n\nA beloved best-seller in France, Human Kindness and the Smell of Warm Croissants makes philosophy fun, tactile, and popular. Moral thinking is simple, Ruwen Ogien argues, and as inherent as the senses. In our daily experiences, in the situations we confront and the scenes we witness, we develop an understanding of right and wrong as sophisticated as the moral outlook of the world's most gifted philosophers. We can draw on this knowledge to navigate life's most perplexing problems, and ethics becomes second nature.\n\n Ogien poses nineteen real-world conundrums and explores through experimental philosophy and other methods the responses they provoke. Is a short, mediocre life better than no life at all? Is it acceptable to kill a healthy person so his organs can save five others? Would you swap a &quot;natural&quot; life filled with frustration, disappointment, and partial success for a world in which all of your needs are met, but through artificial and mechanical means? Ogien's goal is not to show how difficult it is to determine right from wrong or how easy it is for humans to become monsters or react like saints. Helping us tap into the registers of wisdom and feeling we already possess in our ethical &quot;toolboxes,&quot; he encourages readers to question moral presuppositions and rules; embrace an intuitive sense of dignity, virtue, and justice; and pursue a pluralist ethics better suited to the principles of human kindness","torrent":{"xt":"urn:btih:ac143b7bc855253308b19d050783a7aaf18673be","amp;dn":"Human+Kindness+and+the+Smell+of+Warm+Croissants+%282015%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac143b7bc855253308b19d050783a7aaf18673be","infoHashBuffer":{"type":"Buffer","data":[172,20,59,123,200,85,37,51,8,177,157,5,7,131,167,170,241,134,115,190]},"announce":[],"urlList":[]}}