{"title":"Britannica Student Encyclopaedia (2010).pdf Gooner","uid":12072258,"size":283941840,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ad4ae5b7813dcf3decd50eb900a7f1804c571380&amp;dn=Britannica+Student+Encyclopaedia+%282010%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1435539883,"description":"Publisher: Encyclopaedia Britannica; Revised edition edition (January 1, 2010)\nLanguage: English\nISBN-10: 1615353216\nISBN-13: 978-1615353217\n\nNewly updated for 2010, the Britannica Student Encyclopedia provides children with a broad collection of information to help them gain a better understanding of their world. Designed for ages 7-12, this set provides more than 2,250 captivating articles across a wide range of subjects, making it the perfect resource for homework help, classroom assignments and everyday answers for curious minds. Children will immerse themselves in more than 2,700 photos, charts and tables; 1,200 maps and flags from across the globe; and special quiz features that engage and entertain young learners. - Builds a foundation for confident learning. - Knowledge is easily accessible with A-Z articles and index, encouraging students to research and develop essential reference skills. - Covers key school subjects - History, Science, Geography, the Arts and more! - New and revised articles to reflect the changing state of the world. - From Beijing to Africa, ice skating to memory and Pablo Picasso to the Williams sisters - explore a variety of topics in this comprehensive set. - Timelines, 'More to explore' and 'Did you know?' features intrigue children and encourage them to keep learning, questioning and wondering","torrent":{"xt":"urn:btih:ad4ae5b7813dcf3decd50eb900a7f1804c571380","amp;dn":"Britannica+Student+Encyclopaedia+%282010%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad4ae5b7813dcf3decd50eb900a7f1804c571380","infoHashBuffer":{"type":"Buffer","data":[173,74,229,183,129,61,207,61,236,213,14,185,0,167,241,128,76,87,19,128]},"announce":[],"urlList":[]}}