{"title":"Son Of Satyamurthy(2015).mp4","uid":11909042,"size":451259676,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ad71eee18eeb58ef12c1059d40d4d499b6c01d4d&amp;dn=Son+Of+Satyamurthy%282015%29.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"wigelallie","files":1,"time":1431437749,"description":"Cast: Allu Arjun,Samantha,Nitya Menon and others\nDirected by : Trivikram\nProduced by : S. Radha Krishna\n\nBanner :Classic Entertainments\n\nMusic : Devi Sri Prasad\nRelease Date : Apr 08 2015 12:00 AM\nStory:\n\nViraj Anand (Allu Arjun) is the S/O Satyamurthy (Prakash Raj) who is super rich. A tragedy strikes the family and they were forced to adjust to a middle class set-up. The rest of the story is about how the protagonist restores his family name with the help of values inherited from his father!\n\nArtists Performance:\n\nAllu Arjun: He excelled as an actor and given his career best performance in few scenes, especially the sequence where Protagonist explains to Samantha about his Father. Upped the Style Quotient, Maintained Dignity, Exhibits Emotions to Perfection and Danced Superbly to walk away with the top honors.\n\nSamantha as the Love Interest of Protagonist is good enough. Adah Sharma looks gorgeous. Upendra as Devaraj, a powerful village strongman, is just perfect. Sneha is apt for the role of Devaraj's Wife. Nithya Menon makes her presence felt playing Devaraj's Sister. Rajendra Prasad produces few laughs with his mannerisms and comic timing. Brahmanandam excels in few scenes. Ali plays a full-length role. Kota Srinivas Rao, Rao Ramesh, Sampath and MS Narayana have done justice to their roles.\nAnalysis:\n\nAllu Arjun-Trivikram's 'Julayi' is a smash hit and even the last releases of these A-Listers were their biggest grossers. Obviously, Expectations would be high for 'S/O Satyamurthy'. Has this family subject lived up to the expectations?\n\nMusic &amp; Background Score by Devi Sri Prasad is pretty decent. Songs have been picturized so well. Prasad Murella's Cinematography is flawless. Dialogues are entertaining and thought-provoking. Art Direction by Ravindar is praise worthy. Editing could have been much better. Production Values are grand.\n\n'S/O Satyamurthy' is overloaded with values but lack of entertainment on par with Trivikram's past films proves costly. While the First Half is passable, Second Half is emotionally charged to some extent. The end result depends mostly on how the family crowds embrace it.\n\nBox Office: 'S/O Satyamurthy' is undoubtedly the biggest release (1375 screens) in Allu Arjun's career and Multiplex shows alone surpassed 800-mark which is the highest for any Telugu release in India. Hence, the openings could be phenomenal but long run depends on Family Crowds. 'S/O Satyamurthy' has to recover a mammoth share of Rs 54 crore for break even. Can Bunny-Trivikram combo do a miracle?","torrent":{"xt":"urn:btih:ad71eee18eeb58ef12c1059d40d4d499b6c01d4d","amp;dn":"Son+Of+Satyamurthy%282015%29.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad71eee18eeb58ef12c1059d40d4d499b6c01d4d","infoHashBuffer":{"type":"Buffer","data":[173,113,238,225,142,235,88,239,18,193,5,157,64,212,212,153,182,192,29,77]},"announce":[],"urlList":[]}}