{"title":"Cameringo+ Effects Camera v2.5.1","uid":12060882,"size":5675651,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:adc8b359ac3a3d751069d24aa41eddc21ad1f702&amp;dn=Cameringo%2B+Effects+Camera+v2.5.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Androider","files":1,"time":1435257625,"description":"With a simple yet stylishly powerful interface, this professional photographic camera App includes a large variety of live photo filters in lightning-fast real-time, such as several Lomo and Lo-Fi effects, artistic painting, cartoon and paper styles, retro, vintage, FAUX HDR, analog, and several deformations types, including even fisheye, wide angle camera filters, and many more.\n\nIn total over 200 customizable filters, and over 20 frames.\n\nFor HDR fans, produce the most beautiful images with the FAUX HDR tone mapping filters.\n\nCreate little planet photos with the Stereographic filters, or use the preset tinyplanet or Little Planet mode.\n\nLomography, Analogic and Hipster photography lovers will be pleased with the emulated effects of some classic cameras such as Holga, Zenit, Lomo LC-A, and even an awesome Super-8 style.\n\nWith the easiest Panorama mode you can find. The manual nature of the Panorama mode gives you full control over the final result. Try using different filters, people or objects in each shot to create unique panoramic images. Your imagination is the only limit.\n\nRecord GIF animations with all the available effects. You can also change the GIF recording speed to produce funny GIF animations, or even record GIFs in reverse mode.\n\nWith unique features that DSLR camera owners will envy. Manual controls for several photographic settings such as the exposure and exposure lock, brightness, contrast and saturation, All filters allow a complete and unique manual customization.\n\nGet a mad-face selfie with the unique Virtual Flash for Front-Facing Cameras. The idea is very simple; in complete darkness the screen will light up enough to give you the chance to snap your grin. Not all effects are suitable for this, so try it first with &quot;original&quot;.\n\nOther included features are on screen Auto Exposure Lock (AE-L), image stabilizer, silent camera mode, histogram, Incognito / spy mode, Geo Tagging (GPS Location), guidelines, tap to shoot, macro-focus, set the Artist and Copyright into the EXIF tag, and even the option to shoot perfectly squared photos making it easier to upload into Instagram.\n\nWhat's New:\n\n2.5.1\nMaintenance update. Several fixes and optimizations.\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.perracolabs.cp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.perracolabs.cp&lt;/a&gt;","torrent":{"xt":"urn:btih:adc8b359ac3a3d751069d24aa41eddc21ad1f702","amp;dn":"Cameringo%2B+Effects+Camera+v2.5.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adc8b359ac3a3d751069d24aa41eddc21ad1f702","infoHashBuffer":{"type":"Buffer","data":[173,200,179,89,172,58,61,117,16,105,210,74,164,30,221,194,26,209,247,2]},"announce":[],"urlList":[]}}