{"title":"Membranes for Membrane Reactor","uid":12084683,"size":17175824,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ae45e0b31b81d4ea33645d9585c37f317a5ddcd6&amp;dn=Membranes+for+Membrane+Reactor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1435867936,"description":"Membranes for Membrane Reactor - Preparation, Optimization and Selection (Wiley, 2011).pdf\n\nISBN: 9780470746523\n\nA membrane reactor is a device for simultaneously performing areaction and a membrane-based separation in the same physicaldevice. Therefore, the membrane not only plays the role of aseparator, but also takes place in the reaction itself.\nThis text covers, in detail, the preparation andcharacterisation of all types of membranes used in membranesreactors. Each membrane synthesis process used by membranologistsis explained by well known scientists in their specific researchfield.\n\nThe book opens with an exhaustive review and introduction tomembrane reactors, introducing the recent advances in this field.The following chapters concern the preparation of both organic andinorganic, and in both cases, a deep analysis of all the techniquesused to prepare membrane are presented and discussed. A briefhistorical introduction for each technique is also included,followed by a complete description of the technique as well as themain results presented in the international specialized literature.In order to give to the reader a summary look to the overall work,a conclusive chapter is included for collecting all the informationpresented in the previous chapters.\n\nKey features: * Fills a gap in the market for a scientific book describing thepreparation and characterization of all the kind ofmembranes used in membrane reactors * Discusses an important topic - there is increasing emphasis onmembranes in general, due to their use as energy efficientseparation tools and the green chemistryopportunities they offer * Includes a review about membrane reactors, several chaptersconcerning the preparation organic, inorganic, dense, porous, andcomposite membranes and a conclusion with a comparison among thedifferent membrane preparation techniques","torrent":{"xt":"urn:btih:ae45e0b31b81d4ea33645d9585c37f317a5ddcd6","amp;dn":"Membranes+for+Membrane+Reactor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae45e0b31b81d4ea33645d9585c37f317a5ddcd6","infoHashBuffer":{"type":"Buffer","data":[174,69,224,179,27,129,212,234,51,100,93,149,133,195,127,49,122,93,220,214]},"announce":[],"urlList":[]}}