{"title":"Josh Bivens - Failure By Design (2011) [epub]","uid":12023353,"size":744655,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:af1991c9ca356dfaeb3bda60d73e2545f3a476d5&amp;dn=Josh+Bivens+-+Failure+By+Design+%282011%29+%5Bepub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Eugene_Debs","files":1,"time":1434482100,"description":"Failure by Design: The Story behind America's Broken Economy, Josh Bivens and Lawrence Mishel\n\nIn Failure by Design, the Economic Policy Institute's Josh Bivens takes a step back from the acclaimed State of Working America series, building on its wealth of data to relate a compelling narrative of the U.S. economy's struggle to emerge from the Great Recession of 2008. Bivens explains the causes and impact on working Americans of the most catastrophic economic policy failure since the 1920s.\n\nAs outlined clearly here, economic growth since the late 1970s has been slow and inequitably distributed, largely as a result of poor policy choices. These choices only got worse in the 2000s, leading to an anemic economic expansion. What growth we did see in the economy was fueled by staggering increases in private-sector debt and a housing bubble that artificially inflated wealth by trillions of dollars. As had been predicted, the bursting of the housing bubble had disastrous consequences for the broader economy, spurring a financial crisis and a rise in joblessness that dwarfed those resulting from any recession since the Great Depression. The fallout from the Great Recession makes it near certain that there will be yet another lost decade of income growth for typical families, whose incomes had not been boosted by the previous decade's sluggish and localized economic expansion.\n\nIn its broad narrative of how the economy has failed to deliver for most Americans over much of the past three decades, Failure by Design also offers compelling graphical evidence on jobs, incomes, wages, and other measures of economic well-being most relevant to low- and middle-income workers. Josh Bivens tracks these trends carefully, giving a lesson in economic history that is readable yet rigorous in its analysis. Intended as both a stand-alone volume and a companion to the new State of Working America website that presents all of the data underlying this cogent analysis, Failure by Design will become required reading as a road map to the economic problems that confront working Americans","torrent":{"xt":"urn:btih:af1991c9ca356dfaeb3bda60d73e2545f3a476d5","amp;dn":"Josh+Bivens+-+Failure+By+Design+%282011%29+%5Bepub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af1991c9ca356dfaeb3bda60d73e2545f3a476d5","infoHashBuffer":{"type":"Buffer","data":[175,25,145,201,202,53,109,250,235,59,218,96,215,62,37,69,243,164,118,213]},"announce":[],"urlList":[]}}