{"title":"Lykka Yootheme Premium Theme","uid":12087022,"size":24064348,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:b05ab1f7c955a2c9152daa35a589a2a4a758e438&amp;dn=Lykka+Yootheme+Premium+Theme&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1435934883,"description":"June is getting cosy with our newest theme release Lykka. This interior design themed template stands out with two extra grid widgets, a roomy navbar and a special blog layout. It combines a modern, clean layout with subtle vintagy elements and animations to create an elegant style, perfect for your e-commerce, magazine or really any kind of website creation.\n\nNew Widgets\n\nLykka features a special Grid widget. Add a second media item and your widget content will automatically be displayed in an alternating grid layout with a primary and a secondary image. In addition to that there's also a Grid Alternate widget, which arranges content and media in a teaser layout with the image displayed alternating above or below the content.\n\nTheme Features\n\nThe navbar offers plenty of space for your logo and menu items and can be set fixed. The height of the fixed navbar will decrease elegantly when scrolling down to save valuable space. Also, this theme includes an optional unique blog layout. Articles can be displayed with a full width featured image and you can apply a two column text layout.\n\nLykka theme includes 6 dark, light and colored styles. You can add a special overlay to your content by adding the .tm-overlay-lykka class. As a little detail the panel header has a nice separator icon that is different for each style. You can even apply another icon in the Customizer. The individualized Gallery, Features, Services, About and Blog pages give you a wider range of usecases for the theme and Widgetkit","torrent":{"xt":"urn:btih:b05ab1f7c955a2c9152daa35a589a2a4a758e438","amp;dn":"Lykka+Yootheme+Premium+Theme","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b05ab1f7c955a2c9152daa35a589a2a4a758e438","infoHashBuffer":{"type":"Buffer","data":[176,90,177,247,201,85,162,201,21,45,170,53,165,137,162,164,167,88,228,56]},"announce":[],"urlList":[]}}