{"title":"The Beatles - The Days In Their Life [History - Narrative] mp3","uid":11976347,"size":2032367005,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b0ba47e19365399d4b9e93faa29e680880fe9a83&amp;dn=The+Beatles+-+The+Days+In+Their+Life+%5BHistory+-+Narrative%5D+mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NrKNrK","files":764,"time":1433030096,"description":"The Beatles - The Days In Their Life (2004)\n\nRadio Program / History / Chronology / Narrative /  Interview\n\n\nmp3 files at 192 kbps, total running time over 24 hours\n\ncomplete in 21 volumes with scans and indices, original air date 1981\n\n\nA thirty-hour (presumably the broadcast length including commercials) chronology tracing the life of four musicians who had a dramatic effect on directions taken by others. The group that inspired and redefined the boundaries of contemporary music. This program was eventually broadcast in more than fifty countries.\n\n***********************************************************************************\n\nFrom the volume 1 liner notes:\n\nThis twenty-one volume set contains the entire Days In Their Life program as it was originally broadcast in the early Eighties. The Days In Their Life was originally pressed onto thirty vinyl LP records. It was these vinyl LPs that radio stations used as a source for their broadcasts. The collection presented here is sourced from one of these original broadcast vinyl LP sets.\n\nThe LP set used for this remastered series is from the personal archives of Ira Lipson, the narrator of this extensive program. This particular series is made possible through his generosity, and trust. His support is sincerely appreciated.\n\nThis remastered version has attempted to upgrade the listening experience by replacing almost all of the music tracks with high quality audio from sources such as Mobile Fidelity Sound Labs, DCC Compact Classics and Dr. Ebbetts Sound Systems.\n\nAll of this has been done while maintaining the integrity of the original broadcast. No material has been added and no part of the original program has been removed. The result is a listening experience superior to what was possible during the original broadcast.\n\n***********************************************************************************\n\nPress release accompanying the set from TM Productions at time of release in 1981:\n\n&quot;The Beatles: The Days In Their Life&quot; is a 30 hour chronological study of the band that did more to change the scope of popular music than any other force of the 1960's.\n\nDuring the first 24 hours of the special, every song ever recorded by The Beatles is played, including several numbers never released. Because the producers have gained access to the original EMI masters, some songs previously heard only in mono are now in stereo.\n\nThe final 6 hours of the show trace the direction each of The Beatles took after the band disbanded in December 1970. All information is completely up-to-date as of the date of release in 1981.\n\n&quot;The Beatles: The Days In Their Life&quot; includes hundreds of interviews with The Beatles themselves and their associates, many of which have never been heard.\n\nWhile &quot;The Beatles: The Days In Their Life&quot; is 30 hours long and is designed to run as a blockbuster, the show may also be stripped into one hour segments if so desired.\n\n\nVolume 1 scans: &lt;a href=&quot;\nhttp://postimg.org/image/6lx5glt23/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/6lx5glt23/&lt;/a&gt; &lt;a href=&quot;\nhttp://postimg.org/image/qukj2bsd7/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/qukj2bsd7/&lt;/a&gt;","torrent":{"xt":"urn:btih:b0ba47e19365399d4b9e93faa29e680880fe9a83","amp;dn":"The+Beatles+-+The+Days+In+Their+Life+%5BHistory+-+Narrative%5D+mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0ba47e19365399d4b9e93faa29e680880fe9a83","infoHashBuffer":{"type":"Buffer","data":[176,186,71,225,147,101,57,157,75,158,147,250,162,158,104,8,128,254,154,131]},"announce":[],"urlList":[]}}