{"title":"Beat Happening - Crashing Through - 6 Albums + Bonus [Flac]","uid":11956450,"size":1484259494,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b0dfc1d6cc3d9f3bb939807d73f4a0cbcec592cc&amp;dn=Beat+Happening+-+Crashing+Through+-+6+Albums+%2B+Bonus+%5BFlac%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"celsoinc","files":90,"time":1432442764,"description":"\nIt's almost hard to remember just how utterly unique Beat Happening was when they started. They couldn't really sing, couldn't really play, didn't have a bass player, and flirted with childish imagery filtered through a young-adult perspective. Their live shows involved plenty of instrument switching and subtle confrontation. Ashtrays may have been thrown in their direction, but they took it in stride, following their own singular path over five albums. In time, everyone from Nirvana to the Vaselines to Bikini Kill cited the band as an influence. Crashing Through collects their five studio albums--from 1985's raw, plaintive Beat Happening to 1992's comparatively professional You Turn Me On--in one box. Many of the best tracks, including the wistful &quot;Indian Summer&quot; and the feedback-laden &quot;The This Many Boyfriends Club,&quot; have become indie-rock standards. One disc contains odds and ends, including singles, compilation contributions, and EP refuse. Another contains three live tracks from the out-of-print Beat Happening/Vaselines cassette, videos for &quot;Pine Box Derby&quot; and &quot;Hot Chocolate Boy,&quot; stunning live performance clips, and even footage of the Olympia Cake Walk from 1991's International Pop Underground convention. Topping the package off is a lavish booklet. --Mike Appelstei","torrent":{"xt":"urn:btih:b0dfc1d6cc3d9f3bb939807d73f4a0cbcec592cc","amp;dn":"Beat+Happening+-+Crashing+Through+-+6+Albums+%2B+Bonus+%5BFlac%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0dfc1d6cc3d9f3bb939807d73f4a0cbcec592cc","infoHashBuffer":{"type":"Buffer","data":[176,223,193,214,204,61,159,59,185,57,128,125,115,244,160,203,206,197,146,204]},"announce":[],"urlList":[]}}