{"title":"Maxx Belloccio - The Baron Of Darkness XXX DVDRip [.avi]","uid":12074533,"size":719089151,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b15507df3e848ef717d0fb071282b3425edde381&amp;dn=Maxx+Belloccio+-+The+Baron+Of+Darkness+XXX+DVDRip+%5B.avi%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"feeldabyte","files":4,"time":1435600572,"description":"\nScreens &amp; Info :\n\nPerformers: Angela Ferrini plays Domina\nAngela Santini plays a vampire in the catacomb\nBetty Anderson\nDiana Luden plays Laura\nEva Unger as Eva Balasz, plays the second girl in the catacomb\nIldiko Smits as Ildico, plays the first prostitute\nJudith Cohisca plays the third girl in the catacomb\nJudith Kostner as Judiht, plays the second prostitute\nMadalina Ray plays Katherine Dumont\nNicolette Harvat plays Michelle le Grand\nReha Herzog plays the woman in the house\nSilvia Tomas plays the second model (non-sex)\nStefanie Hogan plays the third model (non-sex)\nSusanna Mertz plays the first model (non-sex)\nSvetlana Zoran plays Beatrice\n\nA young woman wanders aimlessly through the park, pursued from the pitiful but also indignant looks of the people passing by. Her former beauty is hardly noticeable beyond her street-trash look. Distraught, she stares at the skies, muttering one name again and again: &quot;Pierre!&quot;...\nThe woman loses herself in the past, and the picture is changing into a night-black scene where a coffin is carried by some shady customers.\n1640: Jean-Pierre (Zensa Raggi), son of a baron, grows up carefree in protected surroundings. As becoming a man, he discovers the big love during an excursion: the Contessa (Cassandra Dora ). It surprises him, but not really disturbs him, that he can meet his beloved only at night. When invited to the castle of Prince Van Der Holen (Remigio), the Contessa wants to change him into what she herself is - a creature of the dark, a vampire. But her deep love does not allow this. She spares him and is all the more shocked when she can't prevent cruel Prince Van Der Holen accomplish the cruel bloody deed.\nFrom now on Jean-Pierre flits through the times as an undead bloodsucker, against his will he has to kill again and again. But one day he comes across the beautiful fashion designer Catherine (Madalina Ray), who just separates from her husband (Ron Jeremy). They fall passionately in love with each other - Catherine's life changes all in a sudden. Threat and desire are merging...\n\nHungarian Movie\n\nPick another one:\n &lt;a href=&quot;\nhttps://thepiratebay.se/user/feeldabyte/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/feeldabyte/&lt;/a&gt;","torrent":{"xt":"urn:btih:b15507df3e848ef717d0fb071282b3425edde381","amp;dn":"Maxx+Belloccio+-+The+Baron+Of+Darkness+XXX+DVDRip+%5B.avi%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b15507df3e848ef717d0fb071282b3425edde381","infoHashBuffer":{"type":"Buffer","data":[177,85,7,223,62,132,142,247,23,208,251,7,18,130,179,66,94,221,227,129]},"announce":[],"urlList":[]}}