{"title":"Saints and Sinners (BBC 2015 - Complete Series)","uid":11961382,"size":2006945314,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b1a28938e34a05c81a351d9f9b727075aa35ae15&amp;dn=Saints+and+Sinners+%28BBC+2015+-+Complete+Series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"davieboy1966","files":4,"time":1432567037,"description":"TV : Documentary : TV quality : English\n\nBroadcast on BBC Four\n\nDr Janina Ramirez explores how monasteries evolved from a cult of extreme isolation and self-deprivation into powerhouses of Anglo-Saxon art, industry and learning.\n\nPart 1\n19 Feb 2015\nJanina begins her journey on the desolate rock of Skellig St Michael off the east coast of Ireland, home to the oldest surviving monastery in the British Isles. She investigates the harsh lives led by these early monks, and tells the story of the arrival of hermetic Irish monasticism in Anglo-Saxon Northumberland. Monasteries such as Lindisfarne and Whitby became beacons of civilisation and literature in the barbaric Anglo-Saxon world, creating wondrous works of art including the Lindisfarne Gospels and St Cuthbert's pectoral cross.\n\nA rival form of regimented, communal monasticism was imported into southern Britain from Rome, and Janina reveals the holy struggle that ensued between these two opposing monastic ideals. The victors would transform the culture and landscape of England, until they too were destroyed by a new wave of barbarian invaders.\n\nPart 2\n26 Feb 2015\nThe golden age of the British monastery was during the medieval period, when monks transformed British society and rose to a position of immense power. Fighting back after centuries of defeat and neglect, a wave of new monasteries spread across the nation, with over 500 British monastic houses established by the 14th century. Far from the inward-looking recluses of legend, monks were exceptionally creative, and became pioneers in the fields of medicine, science, scholarship, industry, farming, art and music. They didn't turn their back on the medieval world, but helped transform it.\n\nYet as the monasteries mingled with the world outside their cloisters they began to take on its corruption. They had begun with a vow of poverty, but eventually came to own a third of the nation's land. This wealth, combined with the sins of individual monks, sealed their fate, and as the medieval period ended the monks were on the brink of a catastrophic and total collapse.\n\nFrom Viking-ravaged Lindisfarne to the astonishing achievements of Durham and Peterborough cathedrals (both built for monks), from cutting-edge hospitals to the rediscovery of the oldest collection of two-part music in the world, this is a story of astonishing success and spectacular artistic achievement that proved too good to last.\n\nPart 3\n5 March 2015\nIn the final episode of the series, Dr Janina Ramirez discovers how the immensely rich and powerful monasteries, that had dominated British society for a thousand years, were annihilated in less than five years.\n\nIn the 15th century, eight hundred monasteries in England owned one third of the nation's land. Many monks were living in palatial monasteries and were patrons of the finest art and architecture. Janina examines monastery kitchen records and the bones of a medieval monk to discover the truth behind accusations of monastic gluttony and vice. She also explores how the arrival of the printing press put paid to the monasteries' monopoly of publishing and education.\n\nJanina then traces the story of the dissolution of the monasteries under Henry VIII and Thomas Cromwell. She explores whether the dissolution was the violent action of a greedy and overbearing monarch or if it was the inevitable 'end of days' for a rotten and outmoded institution.\n\nShe uncovers stories of shocking corruption alongside examples of extraordinary pious sacrifice. Although not a single monastery survived the systematic liquidation, Janina shows the lasting impact Britain's millennium of monasteries had on our society and culture.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:b1a28938e34a05c81a351d9f9b727075aa35ae15","amp;dn":"Saints+and+Sinners+%28BBC+2015+-+Complete+Series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1a28938e34a05c81a351d9f9b727075aa35ae15","infoHashBuffer":{"type":"Buffer","data":[177,162,137,56,227,74,5,200,26,53,29,159,155,114,112,117,170,53,174,21]},"announce":[],"urlList":[]}}