{"title":"[ Chanel Preston ] [ Brazzers ] 6 Video Pack 1 [2015]","uid":12070907,"size":2053183948,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:b2ca24b7b21302cbfa255f9733c9e1f7dd14d117&amp;dn=%5B+Chanel+Preston+%5D+%5B+Brazzers+%5D+6+Video+Pack+1+%5B2015%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"visita","files":6,"time":1435512957,"description":"Whether she's pushing the envelope in a wild bondage scene, or getting gang-banged by a half dozen huge cocks, Chanel makes every scene look easy and fun. She says she can take anything you can throw at her, and once you see her in action, you'll believe it! Chanel's balls-to-the-wall performances earned her the well-deserved 2014 AVN Award for Most Outrageous Sex Scene. Also, Chanel's proud to say she's part of the exclusive club of porn stars who have taken two of the biggest black cocks working in porn today, and best of all, both those extreme scenes were anal! Back in 2011, Chanel was loving life as an exotic dancer when a friend recommended she try her hand at stripping down for the camera. With her curvaceous body and easygoing charisma, Chanel discovered she was a natural performer, and the offers to work started pouring in. In the course of a very successful career, Chanel has had the chance to embody many of the power-house femme fatales from your wildest geeky fantasies: Wonder Woman, Black Widow, and the womb-raiding Lara Croft. Chanel's always had a restless soul and an insatiable wanderlust, and has lived all over the place: she grew up in Alaska, moved to Hawaii for a stretch, and although she's settled in Los Angeles to be near the industry she loves, Chanel travels the world every chance she gets","torrent":{"xt":"urn:btih:b2ca24b7b21302cbfa255f9733c9e1f7dd14d117","amp;dn":"%5B+Chanel+Preston+%5D+%5B+Brazzers+%5D+6+Video+Pack+1+%5B2015%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2ca24b7b21302cbfa255f9733c9e1f7dd14d117","infoHashBuffer":{"type":"Buffer","data":[178,202,36,183,178,19,2,203,250,37,95,151,51,201,225,247,221,20,209,23]},"announce":[],"urlList":[]}}