{"title":"Nanotechnology in Advanced Electrochemical Power Sources","uid":12057123,"size":11498400,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b3355f93c3f8789580390644e4c33ad181d2873a&amp;dn=Nanotechnology+in+Advanced+Electrochemical+Power+Sources&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1435153829,"description":"ISBN 978-981-4303-05-7\n\nThe challenge of providing adequate power on an indefinite basis without causing long-term damage to the environment requires a versatile means of energy conversion and storage. As such, electrical energy storage is becoming more vital today than at any time in human history. Electrochemical systems, such as batteries, supercapacitors, fuel cells, and photoelectrochemical cells, can help meet this objective. Future generations of rechargeable lithium batteries will be required to power portable electronic devices, store electricity from renewable sources, and serve as a vital component to pursuing electric mobility in the future to reduce fossil fuel demand and mitigate environmental issues. In this context, engineering of new materials, especially at the nanoscale, has become imperative to achieve enhanced energy and power density to meet the future challenges of energy storage.\n\nThis book outlines the state of the art of nanoscale aspects of advanced energy storage devices, such as lithium-ion batteries, including microbatteries and electrochemical supercapacitors. It focuses on various fundamental issues related to device performance of various positive and negative electrode materials, with special reference to their nanoscale advantages. It also includes fundamentals and processing techniques with regard to synthesis, characterization, physical, and electrochemical properties, and applications of nanoscale materials pertaining to advanced electrochemical power sources. A variety of advanced nanomaterials, such as transition metal oxides, phosphates, silicates, and conversion electrodes, together with some special nanomaterials such as carbon nanotubes, nanorods, and mesoporous carbons are discussed by many notable authorities in the field","torrent":{"xt":"urn:btih:b3355f93c3f8789580390644e4c33ad181d2873a","amp;dn":"Nanotechnology+in+Advanced+Electrochemical+Power+Sources","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3355f93c3f8789580390644e4c33ad181d2873a","infoHashBuffer":{"type":"Buffer","data":[179,53,95,147,195,248,120,149,128,57,6,68,228,195,58,209,129,210,135,58]},"announce":[],"urlList":[]}}