{"title":"POtHS - Biblical Times - 53 - Soldier of Destiny (2012)","uid":12033042,"size":5846260842,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b46ed402599489d6b0dd26b192843cd19207aabc&amp;dn=POtHS+-+Biblical+Times+-+53+-+Soldier+of+Destiny+%282012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"POtHS11","files":70,"time":1434646371,"description":"POtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Biblical Times - 53 - Soldier of Destiny (2012)\n\nDescription\n\nSoldier of Destiny (2012):\n\nIn worn-torn Afghanistan, young marine Tyler's life is changed when he is saved by a fellow soldier, Quincy, who dies in doing so. Before he dies, he asks Tyler to find his sister who works in Africa. Tyler, torn with guilt, needs to find a way from behind enemy lines to get to Quincy's sister who is running a Christian Mission in Ethiopia, along with her husband, an ex-Marine cowboy-turned-Pastor, where they care for the desperate local people who are constantly terrorized by crazed guerrilla fighters.\nAlso included are our End-Times and Xtras folders\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nThese Torrents are currently on a Free Leech --  High Speed Server\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe The Above Statement and that the Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed...\n\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\n\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...hmmm sounds like some of us might be Immortal. (Ask your preacher about that)\n\n\nMay Yahweh Bless You as He has me. Seed long and Prosper from the Blessings of our Lord. I have asked the Father to Bless all those that Seed Long.  \n\nDo Not believe anything you find here, search the Scriptures daily to determine the TRUTH.  Other Torrents in this Series at\n \n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n                                              :thankyou:    :thankyou:   Thank You JESUS","torrent":{"xt":"urn:btih:b46ed402599489d6b0dd26b192843cd19207aabc","amp;dn":"POtHS+-+Biblical+Times+-+53+-+Soldier+of+Destiny+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b46ed402599489d6b0dd26b192843cd19207aabc","infoHashBuffer":{"type":"Buffer","data":[180,110,212,2,89,148,137,214,176,221,38,177,146,132,60,209,146,7,170,188]},"announce":[],"urlList":[]}}