{"title":"Intro to Yoga with Tamal Dodge x264 aac [MP4]","uid":11819072,"size":1054508596,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b513261f1fb2f1fbe0c5c666336c218b6d216158&amp;dn=Intro+to+Yoga+with+Tamal+Dodge+x264+aac+%5BMP4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"elessedilgirl","files":2,"time":1429216383,"description":"Yoga has an amazing way of stretching and strengthening the body while calming the mind and restoring energy. Filmed in a serene garden overlooking the Pacific Ocean, these two sessions offer a comprehensive introduction to yoga so that you can begin at any level and continually progress. The Fundamentals program will take you step-by-step through the basics of yoga breathing, foundation postures and short vinyasa flows. The Intermediate sequence will introduce the next stage of postures and flow through a series of full sun salutations. Both of these programs will build strength and tone muscle while they improve balance, increase flexibility, release tension and allow you to start realizing the positive impact that yoga can have on your life.\n\nRaised in his family's yoga ashram on the island of Hawaii, Tamal Dodge has practiced and taught yoga for most of his life. He is the co-founder of The Yoga Collective, one of the largest yoga studios in California, and has been featured in publications such as The New York Times, Self Magazine and Yogi Times. When he is not teaching at his studio, Tamal spends much of his time touring the country to share the benefits of yoga with people of all ages. His goal is not only to help people become physically fit but ultimately happier and more fulfilled.\n\nVideo; x264; 720*576 (16:9); 1818 kbps; 25.000 fps\nAudio; aac; 160 kbps; 2 ch; 48.0 Khz","torrent":{"xt":"urn:btih:b513261f1fb2f1fbe0c5c666336c218b6d216158","amp;dn":"Intro+to+Yoga+with+Tamal+Dodge+x264+aac+%5BMP4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b513261f1fb2f1fbe0c5c666336c218b6d216158","infoHashBuffer":{"type":"Buffer","data":[181,19,38,31,31,178,241,251,224,197,198,102,51,108,33,139,109,33,97,88]},"announce":[],"urlList":[]}}