{"title":"Reservoir Simulation - Mathematical Techniques in Oil Recovery","uid":11996001,"size":25468877,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b5d3d059b1c4293691c7b60c51bdde704445eb64&amp;dn=Reservoir+Simulation+-+Mathematical+Techniques+in+Oil+Recovery&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1433654583,"description":"ISBN 9780898716405\n\n\nThis book covers and expands upon material presented by the author at a CBMS-NSF Regional Conference during a ten-lecture series on multiphase flows in porous media and their simulation. It begins with an overview of classical reservoir engineering and basic reservoir simulation methods and then progresses through a discussion of types of flows single-phase, two-phase, black oil (three-phase), single phase with multicomponents, compositional, and thermal.\nThe author provides a thorough glossary of petroleum engineering terms and their units, along with basic flow and transport equations and their unusual features, and corresponding rock and fluid properties. The practical aspects of reservoir simulation, such as data gathering and analysis, selection of a simulation model, history matching, and reservoir performance prediction, are summarized.\n\nAudience This book can be used as a text for advanced undergraduate and first-year graduate students in geology, petroleum engineering, and applied mathematics; as a reference book for geologists, petroleum engineers, and applied mathematicians; or as a handbook for practitioners in the oil industry. Prerequisites are calculus, basic physics, and some knowledge of partial differential equations and matrix algebra","torrent":{"xt":"urn:btih:b5d3d059b1c4293691c7b60c51bdde704445eb64","amp;dn":"Reservoir+Simulation+-+Mathematical+Techniques+in+Oil+Recovery","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5d3d059b1c4293691c7b60c51bdde704445eb64","infoHashBuffer":{"type":"Buffer","data":[181,211,208,89,177,196,41,54,145,199,182,12,81,189,222,112,68,69,235,100]},"announce":[],"urlList":[]}}