{"title":"ISIS - The State of Terror   (2015 - Unabridged)","uid":12086804,"size":278208373,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b5f5fcbf44a837ba1ff52be9913d148d41685ff2&amp;dn=ISIS+-+The+State+of+Terror+++%282015+-+Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"davieboy1966","files":12,"time":1435929341,"description":"ISIS: The State of Terror\nAudio CDs in MP3 / English: MP3, 64 kb/s (2 ch) | Duration: 09:39:30 | ISBN-10: 1481532731 | 2015 | 265 MB\nGenre: History\n\nDrawing on their unusual access to intelligence sources, law enforcement, and groundbreaking research, two of America's leading experts on violent extremism and terrorism explain the genesis, evolution, and implications of today's most barbaric jihadist army, Islamic State - and how we can fight it.\n\n\nThough terrorist groups are a fixture of contemporary politics and warfare, the world has never witnessed the degree of sheer brutality demonstrated by the group know as ISIS - the Islamic State of Iraq and the Levant. Its sadistic disregard for human life, sophisticated use of social media, acquisition of territory, and ability to attract foreign fighters - many from modern Western democracies - is unprecedented.\n\nJessica Stern and J. M. Berger analyze the tools ISIS uses both to frighten innocent citizens and lure new soldiers - including the ''ghoulish pornography'' of their pro-jihadi videos, the seductive appeal of ''jihadic chic,'' and its startlingly effective social media expertise. While this jihadi army poses a significant threat, our response must be carefully calibrated; sending troops onto the battlefield could become the ideal recruiting tool, increasing ISIS' ranks.\n\nISIS: The State of Terror offers practical ideas on potential government responses, emphasizing that we must alter our present conceptions of terrorism and terrorists and react to the rapidly changing jihadi landscape, both online and off, as quickly as the terrorists do. As it lays out what our next move - as a country, as a government, as the world - should be, it offers a vital assessment of the future of counterterrorism and countering violent extremism.\n\nJessica Stern (Author)\nJ. M. Berger (Author)\n\n\n\nEnjoy and Seed!!\n\n\n\nPS. Thanks to original uploader on avxhome","torrent":{"xt":"urn:btih:b5f5fcbf44a837ba1ff52be9913d148d41685ff2","amp;dn":"ISIS+-+The+State+of+Terror+++%282015+-+Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5f5fcbf44a837ba1ff52be9913d148d41685ff2","infoHashBuffer":{"type":"Buffer","data":[181,245,252,191,68,168,55,186,31,245,43,233,145,61,20,141,65,104,95,242]},"announce":[],"urlList":[]}}