{"title":"01st Doctor DVDs (Stories 1 to 29) 1963-1966 from Doctor Who","uid":11971357,"size":192269570203,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:b61c9f098ec6dfe2d99dbcb110345d5d15bc579a&amp;dn=01st+Doctor+DVDs+%28Stories+1+to+29%29+1963-1966+from+Doctor+Who&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"PoshFrosh","files":59,"time":1432827672,"description":"Doctor Who: The First 40 Years, Vol 1 of 8: The First Doctor (William Hartnell) adventures, full DVD ISO rips NTSC\n\nISO rips of all the US Releases of the DVDs (including bonus discs) for Doctor Who - The complete stories of the 1st Doctor played by William Hartnell\n\nmost of these discs i ripped myself from netflix rentals\n\nThis release also includes all torrent tracker files and magnet links for the other doctors 2 through 8\n\nas always, please seed\n\n---------------------------------------------------------------------------------------------------\n\nDoctor Who: The First Forty Years: Volumes 1 &amp; 2: The First Two Doctors\nReadme File\n\nDoing these releases for Doctors 1 &amp; 2 were a little different than doctors 4 through 8.\nSince many of the episodes are missing, I wasn't able to simply rip all the DVDs.\nThese are several types of stories in this release:\n\nFor stories which have all episodes intact (including newly discovered stories as of 2014) I've included a straight ISO rip of the official BBC NTSC DVDs (similar to how I did it with Doctors 4 through 8). These include all of the menus, extras, subtitles, optional audio commentary, and optional text commentary exactly as includede on the DVD release, for the ultimate Classic Who viewing experience. I have used the Special Edition versions of the DVDs and included disc 2 wherever possible. Since many of these discs are going out of print and getting hard to find, I hope this is a great resource for fans.\n\nFor stories which have had their missing episodes animated, I've included straight ISO rips of those DVDs. \n\nFor stories which have some episodes missing, I've included straight VOB rips of the existing episodes from the &quot;Lost in the Time&quot; DVDs. Along with these I've included the best versions of the &quot;Loose Cannon&quot; reconstructions that I could find. I zipped the files together so that each story still takes up only one file. (I've also included the complete ISOs of the &quot;Lost in Time&quot; sets for completeness sake, even though this represents some reduplication). \n\nFinally, for stories which are entirely missing, I've included the best versions of the &quot;Loose Cannon&quot; reconstructions that I could find. I zipped the files together so that each story still takes up only one file. For &quot;Marco Polo&quot; two recons are included (a color and a black and white). And for &quot;Galaxy 4&quot; two recons are included, the Loose cannon (which is longer, but is of lower quality and is mostly stills) as well as the more recently released BBC recon (which includes the recently discovered episode 3 &quot;Airlock&quot; which has been built into a shorter recon for that release) from the Aztecs SE DVD (which is also included in the collection).\n\n[As of the time of this release, &quot;The Underwater Menace&quot; DVD has not been released. Therefore, this story is still missing the recently discovered episode 2 in DVD quality. I still optimistically hope they will release episode 2 and provide linking animation for this story at some point in the future, but alas, I was not able to include a DVD rip of this story. So for this story, I have included all recons in addition to episode 3 from the Lost in Time DVD as well as an Internet rip of Episode 2.]\n\nFinally, I've also included ebook files of the novels for all missing episodes.\n\nI hope that this constitutes the ultimate release of Doctors 1 and 2 (until more episodes are discovered).\n\nIf you enjoy this, please check out my other releases of Doctors 1 through 8, which I like to call &quot;Doctor Who: The First 40 Years&quot;. I've included the torrent tracker and magnet files of the other Doctors in this release.\n\nreleased: Mid 2015","torrent":{"xt":"urn:btih:b61c9f098ec6dfe2d99dbcb110345d5d15bc579a","amp;dn":"01st+Doctor+DVDs+%28Stories+1+to+29%29+1963-1966+from+Doctor+Who","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b61c9f098ec6dfe2d99dbcb110345d5d15bc579a","infoHashBuffer":{"type":"Buffer","data":[182,28,159,9,142,198,223,226,217,157,188,177,16,52,93,93,21,188,87,154]},"announce":[],"urlList":[]}}