{"title":"Earth Science - Decade by Decade (2008).pdf Gooner","uid":12028079,"size":14756908,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b65cf620536ae8de04f91b90ec40b75f2c95bea2&amp;dn=Earth+Science+-+Decade+by+Decade+%282008%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1434564529,"description":"Pages: 364 \nPublisher: Facts on File (J); 1 edition (February 2008)\nLanguage: English\nISBN-10: 0816055335\nISBN-13: 978-0816055333\n\nThe Earth science field began in the 20th century, but humans have been grappling with the nature of the planet on which they live since the dawn of their imagination. Although Earth science is typically seen as an &quot;umbrella&quot; term for a number of sciences, the 20th century ushered in the development of such fields as geochemistry, biogeochemistry, marine geology, and paleoceanography, forever changing and enhancing the study of Earth science. &quot;Earth Science: Decade by Decade&quot; explores this amazing and expansive field and examines the scientific and technologic advances that occurred during the 20th century. Chronicling such key events as Arthur Holmes' establishment of the geologic timescale, Alfred Wegener's theory of continental drift, the scientific discovery of plate tectonics, seismological discoveries that revealed Earth's inner structures, and geologic and paleontological discoveries that have changed how Earth scientists view the evolution of life on this planet, this essential volume monitors the progress of geoscientists as they continue to piece together Earth's vast history.\n\nAbout the Author\n\nChristina Reed is an author and freelance science writer. Her clients include Scientific American, New Scientist, Science, Nature, and the Intergovernmental Oceanographic Commission of UNESCO. In 2003, she worked for Director James Cameron as the science coordinator for his 3D IMAX movie Aliens of the Deep, venturing 1,000 meters below the surface of the Atlantic Ocean in the Russian Mir submersible","torrent":{"xt":"urn:btih:b65cf620536ae8de04f91b90ec40b75f2c95bea2","amp;dn":"Earth+Science+-+Decade+by+Decade+%282008%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b65cf620536ae8de04f91b90ec40b75f2c95bea2","infoHashBuffer":{"type":"Buffer","data":[182,92,246,32,83,106,232,222,4,249,27,144,236,64,183,95,44,149,190,162]},"announce":[],"urlList":[]}}