{"title":"Twisted Travel Tales - Eyes Wide Shut","uid":11961381,"size":86046,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b670629194659c84d40f8dfd75237fe9bda14884&amp;dn=Twisted+Travel+Tales+-+Eyes+Wide+Shut&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"twistedtraveltales","files":1,"time":1432567029,"description":"Twisted Travel Tales - Short Stories - Drugs, Raving and Ranting\n\nEyes Wide Shut\n\nBryce W James is a travel writer of the different sort, it has been some time since a non-fiction picaresque writer has made such an impact on the pulp readers' market. He is a surly sod in search of the alternative offers that you come across when on the road. You will usually find him, lost, a stranger in a strange land, over his head, out of his depth, and often struggling to stay alive, but always he'll be determined as ever to beat the feet and keep on down the Long Road. If you can smoke it, sniff it, drink it, or swallow it whole he's the type to give it a try (except scorpions and spiders, that's disgusting). Despite - or in spite of - all this though he has completed three picaresque pulp novellas already, one based in Brazil, another South East Asia, and his most recent installment in his Twisted Travel Tales series, 'Â£700 and a one way ticket to Amsterdam', which is based around his travels in Europe and lifestyle in London. With two more stories planned and the experiences already lived, we can expect much more from this prevalent author.\n\nBryce W James is based in London and spends his time sitting in front of the idiot box, getting his feet dirty on the dance floor, or drinking by himself whilst tapping away on his laptop.\n\nThere are loads of photos and videos from the twisted travel tales on his facebook account, so get in touch and say hello by sending a friend request with a quick introduction to ...... and maybe you too could join him on the road sometime. Bryce shall get back to you as soon as he can, and hey he pretty much lives on facebook. He always answers all mail.\n\n\n- Here is a link to the video I took during the first chapter of South East Asia, a tale of drugs and debauchery. Enjoy....\n\nREVIEWS:\n\n5.0 out of 5 stars Roving adventure! April 2, 2013\nBy Mark Porter\nFormat:Kindle Edition|Amazon Verified Purchase\nI honestly can't determine if this was a true story or embellished...honestly, I can't imagine someone consuming the amount of drugs ingested by the author, but damn did he appear to have one helluva interesting time!!\nThe writing is quick and light and with just the right amount of detail and emotion to make it feel like you're sitting next to him waiting for a toke...\n\n\n3.0 out of 5 stars Another world February 22, 2013\nBy Mansa\nFormat:Kindle Edition|Amazon Verified Purchase\nI almost quit after page two - put off by the bad language, the poor grammar etc which made it difficult to read. But I had nothing else to read so I ploughed on and I'm glad I did. Not a travel book in the normal sense but nevertheless an interesting description of a world that I know nothing about - drugs, raves and so on. Educational as much as it was entertaining.\n\n\n5.0 out of 5 stars Rough edged but with raw truth all the more powerful for it. 18 Feb 2013\nBy Ebony7\nFormat:Kindle Edition|Amazon Verified Purchase\nIts not a Lonely Planet thats for sure. What it is is a compassionate and roughshod look at what travelling is really about, if you take the time to open your eyes and accept the risks. Having spent 3 colourful months in SE Asia myself I can empathise with the authors work. Would have been quite happy to pay for the read. Even though it made me yearn to be travelling again. Good work Bryce","torrent":{"xt":"urn:btih:b670629194659c84d40f8dfd75237fe9bda14884","amp;dn":"Twisted+Travel+Tales+-+Eyes+Wide+Shut","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b670629194659c84d40f8dfd75237fe9bda14884","infoHashBuffer":{"type":"Buffer","data":[182,112,98,145,148,101,156,132,212,15,141,253,117,35,127,233,189,161,72,132]},"announce":[],"urlList":[]}}