{"title":"Paragon | Alpha 10.6 [WD]","uid":12111108,"size":618253588,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b8ba08af3c0fb413d98c632fbe12ddd641015a50&amp;dn=Paragon+%7C+Alpha+10.6+%5BWD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"WD-i","files":1,"time":1436575261,"description":"\nGame: Paragon\nDetected platform: PC\nRelease date: 13 May 2014\n\n---------------------- \n\n\nAbout the Game\n\n\nParagon is a sandbox space sim set in an alternative future heavily inspired by classic 80s sci-fi. Fight, trade and explore in a massive procedurally generated galaxy of millions of planets and stars. Amass money and power, upgrade or purchase new ships, and one day create your own small fleet with a base to call home.\nFeatures\nA Vast Universe - An enormous universe built to a realistic scale; a galaxy thousands of light years across filled with millions of planets and stars. \n\nCompletely Seamless - Transition through hyperjumps between stars, transit across star systems and land on planets, all with no loading screens to get in your way. \n\nA Fully Realised Starfaring Civilization - Across inhabited space freighters run the trade lanes, stations orbit lonely planets, and individual star captains wander the space between. \n\nDeep Backstory - In an alternative future in which the Cold War never ended, the player takes on the role of an independent ship captain trying to make their mark in an unforgiving galaxy riven with intrigue and conflict. From dropping special forces into hot zones to kidnapping weapons scientists, assassinating dissidents to gun running, take a side in the conflict between power blocs or make a fortune by playing both sides. \n\nIndividual Player Focus - An emphasis on creating a strong single player focused experience and the sort of universe that players can lose themselves in. \n\nEngaging Gameplay - An intuitive and visceral gameplay experience centered around giving players the freedom to achieve their objectives via whatever means they decide.\n\n---------------------- \n\nInstructions:\n\n1. Un-Zip to any location\n\n2. Run Paragon.exe\n\n3. ???\n\n4. SEED\n\n---------------------- \n\nIF YOU LIKE THE GUY BUY IT AND SUPPORT INDIE DEVS","torrent":{"xt":"urn:btih:b8ba08af3c0fb413d98c632fbe12ddd641015a50","amp;dn":"Paragon+%7C+Alpha+10.6+%5BWD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8ba08af3c0fb413d98c632fbe12ddd641015a50","infoHashBuffer":{"type":"Buffer","data":[184,186,8,175,60,15,180,19,217,140,99,47,190,18,221,214,65,1,90,80]},"announce":[],"urlList":[]}}