{"title":"Royal Shakespeare Company Two Gentlemen of Verona (2014)","uid":12114635,"size":465950152,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b8c0debab0ae11e183d2f29c81512ad677ef2910&amp;dn=Royal+Shakespeare+Company+Two+Gentlemen+of+Verona+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"loninappleton","files":2,"time":1436660217,"description":"Royal Shakespeare Company The Two Gentlemen of Verona by William Shakespeare (2014)\nPresented by RSC Live From Stratford Upon Avon\nNTSC (USA) version from Opus Arte\n\nRun time 2 hrs 22 minutes\n\nDirected for the stage  by Simon Godwin\nDirected for the Screen By Robin Lough\n\nPartial cast list:\n\nMark Arenda        Proteus\nMichael Marcus     Valentine\nPearl  Chanda      Julia\nLeigh Quinn        Lucetta  \nSarah MacRae       Silvia\nHost/ Outlaw       Molly Gromadzki     \nJonny Glynn        Duke of Milan\nRoger Morlidge     Launce\nCrab               (Launce's dog)\n\nPlus Musicians, Dancers and Outlaws\n\nSummary Description:\n\nA dramatization of William Shakespeare's comedy, in which two good friends find themselves in love with the same girl, daughter of the Duke of Milan, who has promised her to another.\n\nMy notes.\n\n   This production is presented in modern dress.  And yes there is a real dog in the show.  Stage configuration will be familiar to those who have fileshared my encode of David Tennant as Richard II (which is in this same series from RSC.)\n\n   Though there is less interplay with the audience than in one of the plays from the Globe Theatre (see my other fileshares) there are moments that bring this early comedy of Shakespeare alive.  Of note for me in the cast is Sarah MacRae who, if you follow these plays, has appeared in &quot;The Duchess of Malfi&quot; , &quot;Taming of the Shrew,&quot; and &quot;A Mid Summer Night's Dream.&quot;  MacRae plays Sylvia in The Two Gentlemen.  In this performance at the RSC you can see more range in this actress.  What makes it special is that she can do comic turns while in high fashion. \n \nIn a series such as these fileshares one can see fresh talent in the ensemble and look forward to each new performance. Watch for Leigh Quinn as Lucetta.  She appears early in the play with Julia.\n\nTwo Gentlemen and &quot;As You Like It&quot; have a few plot developments in common.  And in \nthese Shakespeare plays on video, Robin Lough has directed both for the screen.  It is always immediately apparent when, in the case of Lough in particular, the video director takes the care necessary to avoid what we see looking like the quick cutting of a sitcom on television.  The camera should disappear and not call attention to itself.  Lough has repeatedly accomplished this.  \n\n  As with the rest of my list I encourage the viewer to get the complete DVDs for your libraries so that many more might enjoy these productions.\n\n  A brief note on the transfer.  The file size in considerably smaller than I have been able to achieve previously.  Newer software has sade the encode smaller and so more accessible.  The viewer can select English subtitles using VLC and other players in The Two Gentlemen.\n\nNotes written July 11th, 2015","torrent":{"xt":"urn:btih:b8c0debab0ae11e183d2f29c81512ad677ef2910","amp;dn":"Royal+Shakespeare+Company+Two+Gentlemen+of+Verona+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8c0debab0ae11e183d2f29c81512ad677ef2910","infoHashBuffer":{"type":"Buffer","data":[184,192,222,186,176,174,17,225,131,210,242,156,129,81,42,214,119,239,41,16]},"announce":[],"urlList":[]}}