{"title":"Then We Came to the End - Joshua Ferris","uid":12015980,"size":882847,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b914ac4c95ff001616f6b4ea5838c808aae6644e&amp;dn=Then+We+Came+to+the+End+-+Joshua+Ferris&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1434315579,"description":"For anyone who has ever worked in an office, hating everything and everyone in it, yet fell apart when it was time to leave -- this book is for you. Heartbreaking, yet hysterically funny, Then We Came to the End is the definitive novel about the contemporary American workplace. \n\nWith an irresistibly casual writing style, Ferris makes readers a part of his fictional advertising agency from the moment we open the book. Through numerous impromptu conversations, colleagues come alive. We learn that Larry and Amber have had an affair, and that Amber is pregnant. We know that Chris Yop is panicking because he exchanged his office chair without permission, and that Joe Pope is universally despised because he got promoted and now everyone has to listen to him. No one likes Karen Woo because she's always trying to seem smarter than everyone else. And the head boss, Lynn, has cancer, but she doesn't want anyone to know. We understand that the agency is in trouble, and that the unstable Tom Mota is being laid off. We realize that anyone could be next. And we're dying to know what's going to happen. \n\nBy the time readers finish the book, they'll swear that Ferris has spent time in their own offices. And they'll thank him for capturing so knowingly what makes it so horrible, and what makes it our own","torrent":{"xt":"urn:btih:b914ac4c95ff001616f6b4ea5838c808aae6644e","amp;dn":"Then+We+Came+to+the+End+-+Joshua+Ferris","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b914ac4c95ff001616f6b4ea5838c808aae6644e","infoHashBuffer":{"type":"Buffer","data":[185,20,172,76,149,255,0,22,22,246,180,234,88,56,200,8,170,230,100,78]},"announce":[],"urlList":[]}}