{"title":"Computer Graphics Principles and Practice in C (2nd_Edition) PDF","uid":12315905,"size":276683981,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b9f3553174f2d1a6fd0705073b64d9ec5c1bea77&amp;dn=Computer+Graphics+Principles+and+Practice+in+C+%282nd_Edition%29+PDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BMW-X7","files":1,"time":1440994325,"description":"The best-selling book on computer graphics is now available in this C-language version. All code has been converted into C, and changes through the ninth printing of the second edition have been incorporated. The book's many outstanding features continue to ensure its position as the standard computer graphics text and reference. By uniquely combining current concepts and practical applications in computer graphics, four well-known authors provide here the most comprehensive, authoritative, and up-to-date coverage of the field. The important algorithms in 2D and 3D graphics are detailed for easy implementation, including a close look at the more subtle special cases. There is also a thorough presentation of the mathematical principles of geometric transformations and viewing. In this book, the authors explore multiple perspectives on computer graphics: the user's, the application programmer's, the package implementor's, and the hardware designer's. For example, the issues of user-centered design are expertly addressed in three chapters on interaction techniques, dialogue design, and user interface software. Hardware concerns are examined in a chapter, contributed by Steven Molnar and Henry Fuchs, on advanced architectures for real-time, high performance graphics. The comprehensive topic coverage includes: *Programming with SRGP, a simple but powerful raster graphics package that combines features of Apple's QuickDraw and the MIT X Window System graphics library. *Hierarchical, geometric modeling using SPHIGS, a simplified dialect of the 3D graphics standard PHIGS. *Raster graphics hardware and software, including both basic and advanced algorithms for scan converting and clipping lines, polygons, conics, spline curves, and text. *Image synthesis, including visible-surface determination, illumination and shading models, image manipulation, and antialiasing. *Techniques for photorealistic rendering, including ray tracing and radiosity methods. *Surface modeling with parametric polynomials, including NURBS, and solid-modeling representations such as B-reps, CSG, and octrees. *Advanced modeling techniques such as fractals, grammar-based models, particle systems. *Concepts of computer animation and descriptions of state-of-the-art animation systems. Over 100 full-color plates and over 700 figures illustrate the techniques presented in the book. 0201848406B04062001","torrent":{"xt":"urn:btih:b9f3553174f2d1a6fd0705073b64d9ec5c1bea77","amp;dn":"Computer+Graphics+Principles+and+Practice+in+C+%282nd_Edition%29+PDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9f3553174f2d1a6fd0705073b64d9ec5c1bea77","infoHashBuffer":{"type":"Buffer","data":[185,243,85,49,116,242,209,166,253,7,5,7,59,100,217,236,92,27,234,119]},"announce":[],"urlList":[]}}