{"title":"Forensics - Val McDermid (epub)","uid":11935298,"size":7684470,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ba1348da86b16c20f5455fd005de9ef3757c6f13&amp;dn=Forensics+-+Val+McDermid+%28epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SectorVector","files":1,"time":1431887322,"description":"Val McDermid - Forensics: The Anatomy of Crime\n\n\nThe dead talk. To the right listener, they tell us all about themselves: where they came from, how they lived, how they died - and who killed them. Forensic scientists can unlock the mysteries of the past and help justice to be done using the messages left by a corpse, a crime scene or the faintest of human traces. \n\n\nForensics uncovers the secrets of forensic medicine, drawing on interviews with top-level professionals, ground-breaking research and Val McDermid's own experience to lay bare the secrets of this fascinating science. And, along the way, she wonders at how maggots collected from a corpse can help determine time of death, how a DNA trace a millionth the size of a grain of salt can be used to convict a killer and how a team of young Argentine scientists led by a maverick American anthropologist uncovered the victims of a genocide.\n\n\nIn her crime novels, Val McDermid has been solving complex crimes and confronting unimaginable evil for years. Now, she's looking at the people who do it for real, and real crime scenes. It's a journey that will take her to war zones, fire scenes and autopsy suites, and bring her into contact with extraordinary bravery and wickedness, as she traces the history of forensics from its earliest beginnings to the cutting-edge science of the modern day.\n\n\nPublished in partnership with the Wellcome Collection, a free visitor destination that explores the connections between medicine, life and art.\n\n\nAuthor\n======\nVal McDermid grew up in a Scottish mining community then read English at Oxford. She was a journalist for sixteen years, spending the last three as Northern Bureau Chief of a national Sunday tabloid. She divides her time between Northumberland and Cheshire.\n\n\n\nPublisher: Profile Books Ltd\nPublished: Feb 5, 2015\nPages: 320\nAmazon Rating: 4.7/5.0","torrent":{"xt":"urn:btih:ba1348da86b16c20f5455fd005de9ef3757c6f13","amp;dn":"Forensics+-+Val+McDermid+%28epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba1348da86b16c20f5455fd005de9ef3757c6f13","infoHashBuffer":{"type":"Buffer","data":[186,19,72,218,134,177,108,32,245,69,95,208,5,222,158,243,117,124,111,19]},"announce":[],"urlList":[]}}