{"title":"Hydrogen Bonded Polymers","uid":12006375,"size":7473529,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ba584d718f13249d123d8e5d9e8c704e88ae1370&amp;dn=Hydrogen+Bonded+Polymers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1433884998,"description":"ISBN: 9783540685876\n\nControl of polymeric structure is among the most important endeavours of modern macromolecular science. In particular, tailoring the positioning and strength of intermolecular forces within macromolecules by synthetic me- odsandthusgaining structuralcontrolover the?nalpolymeric materials has become feasible, resulting in the ?eld of supramolecular polymer science. - sides other intermolecular forces, hydrogen bonds are unique intermolecular forces enabling the tuning of material properties via self-assembly processes -1 overawiderangeofinteractionstrengthrangingfromseveralkJmol tosev- -1 eraltensofkJmol . Centralfortheformationofthesestructuresareprecursor molecules of small molecular weight (usually lower than 10 000), which can assembleinsolidorsolutiontoaggregatesofde?nedgeometry. Intermolecular hydrogenbondsatde?nedpositionsofthesebuildingblocksaswellastheir- spectivestartinggeometryandtheinitialsizedeterminethemodeofassembly into supramolecular polymers forming network-, rodlike-, ?brous-, disclike- , helical-, lamellar- and chainlike architectures. In all cases, weak to strong hydrogen-bondinginteractionscanactasthecentralstructure-directingforce fortheorganizationofpolymerchainsandthusthe?nalmaterials'properties. Theimportantcontributionofhydrogenbondstotheareaofsupramole- lar polymer chemistry is de?nitely outstanding, most of all since the potency of hydrogen-bonding systems has been found to be unique in relation to other supramolecular interactions. Thus the high level of structural diversity of many hydrogen-bonding systems as well as their high level of direction- ity and speci?city in recognition-phenomena is unbeaten in supramolecular chemistry. The realization, that their stability can be tuned over a wide range of binding strength is important for tuning the resulting material prop- ties, ranging from elastomeric to thermoplastic and even highly crosslinked duroplastic structures and networks. On the basis of the thermal reversib- ity, new materials with highly tunable properties can now be prepared, - ing able to change their mechanical and optoelectronic properties with very smallchangesofexternalstimuli. Thusthe?eldofhydrogen-bondedpolymers forms the basis for stimuli responsive and adaptable materials of the future","torrent":{"xt":"urn:btih:ba584d718f13249d123d8e5d9e8c704e88ae1370","amp;dn":"Hydrogen+Bonded+Polymers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba584d718f13249d123d8e5d9e8c704e88ae1370","infoHashBuffer":{"type":"Buffer","data":[186,88,77,113,143,19,36,157,18,61,142,93,158,140,112,78,136,174,19,112]},"announce":[],"urlList":[]}}