{"title":"Girls Try Anal - Karla Kush, Cherie DeVille","uid":11847245,"size":1037854987,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:ba7485f8760c0b77a0aa0ea5a15e5ec2788bafd4&amp;dn=Girls+Try+Anal+-+Karla+Kush%2C+Cherie+DeVille&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"HighCode","files":1,"time":1429971024,"description":"After your download, don't Forget to SEED!\n...........................................\n    . ######   ###   ######  ##     # .....\n    . #     # #      #     # # #    # .\n    . #     # #    # #     # #  #   # .\n    . ######  #    # ######  #   #  # .\n    . #       #    # #  #    #    # # .\n    . #       #    # #   #   #     ## .\n..... #        ####       #           .\n...........................................\n  ........... :  SCREENSHOTS  :........... &lt;a href=&quot;\nhttp://imgclover.com/image/7NR&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgclover.com/image/7NR&lt;/a&gt; &lt;a href=&quot;\nhttp://imgclover.com/image/7NZ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgclover.com/image/7NZ&lt;/a&gt;\n\nThis is really hard for me to admit, especially with myself, but I\u0019m a little ashamed of some of the sexual choices I\u0019ve made in my life. Not that I\u0019m a slut or anything, but I think I could\u0019ve done a lot better with the choices I made.People can just feel my sexual tension and I can\u0019t say no to fulfill my sexual needs. But now I\u0019ve come to a crossroad where things are just boring. I needed help and really bad, but I also needed advice from someone who has way more experience than I do. I really needed someone who I could trust, who wouldn\u0019t judge me, and who better than my Stepmom, Cherie. I step into her room, where we talk over my experiences, but the more questions she asks, the more I become horny and want her to touch me. At first, my mom seemed reluctant, but I persuaded her with a kiss, then another one. She was all over me like sweet cherry pie. I give her exactly what she needs. I know this experience will be epic. While showing me how to finger her asshole, I keep rubbing her pussy slowly and I continue to finger her until she cums. Now it\u0019s my turn. I\u0019m so excited being this is my first time doing anal. She licks my asshole and puts in one finger. The feeling is exhilarating. While she fingers me, I keep playing with myself. Mommy says I\u0019m ready for more than one finger. Now there are two. Before I know it, I have an intense orgasm! She shows me her anal toy where I\u0019m practicing on her. Mommy is telling me I am doing such a great job and wants me to make her cum again! She takes out a pink glass dildo for me. I place my legs over my head and I\u0019m ready. She slowly makes circles around my asshole with the dildo I don\u0019t know how it\u0019s going to feel and the excitement is overbearing. My ass it so tight. Before I know it, it was all in! Cherie promises me that tomorrow, bigger and better things will be coming. I can\u0019t wait to be an expert!","torrent":{"xt":"urn:btih:ba7485f8760c0b77a0aa0ea5a15e5ec2788bafd4","amp;dn":"Girls+Try+Anal+-+Karla+Kush%2C+Cherie+DeVille","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba7485f8760c0b77a0aa0ea5a15e5ec2788bafd4","infoHashBuffer":{"type":"Buffer","data":[186,116,133,248,118,12,11,119,160,170,14,165,161,94,94,194,120,139,175,212]},"announce":[],"urlList":[]}}