{"title":"New Pearl Harbor Revisited (2008) David Ray Griffin","uid":11954560,"size":770792,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ba9d8d6951f3835b1887c2b9362526988e715a84&amp;dn=New+Pearl+Harbor+Revisited+%282008%29+David+Ray+Griffin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"romcomsrock","files":4,"time":1432341864,"description":"This is the best book on the September 11th tragedy. EPUB format, 700 KB.\nYou can also download the best movie on this subject: Operation Terror (2012), I uploaded this torrent to ThePirateBay too.\n\nBook description:\n\nIn 2004, David Ray Griffin published The New Pearl Harbor: Disturbing Questions about the Bush Administration and 9/11. Translated into several languages, it helped spark a worldwide movement demanding &quot;9/11 truth.&quot; Even as it became increasingly outdated, it continued to be widely cited as the best introduction to the issues.\n\nGriffin has now written The New Pearl Harbor Revisited, which provides a chapter-by-chapter updating of the information provided in that earlier book. It shows that the case against the official account constructed by independent researchers - who now include architects, engineers, physicists, pilots, politicians, and former military officers - is far stronger than it was in 2004, leaving no doubt that 9/11 was a false-flag operation, designed to give the Bush-Cheney administration a pretext to attack oil-rich Muslim nations.\n\nA Review from Publishers Weekly:\nStarred Review. Author and professor Griffith (9/11 Contradictions: An Open Letter to Congress and the Press) knows his work is referred to by officials and the media as conspiracy theory, and he has a rebuttal: &quot;the official theory is itself a conspiracy theory.&quot; In this companion volume to 2004's The New Pearl Harbor: Disturbing Questions About the Bush Administration and 9/11, Griffith provides corrections, raises new issues and discusses &quot;the two most important official reports about 9/11,&quot; the 9/11 Commission Report and the National Institute of Standards and Technology report on the Twin Towers, both &quot;prepared by people highly responsive to the wishes of the White House&quot; and riddled with &quot;omission and distortion from beginning to end.&quot; Griffith addresses many points in exhaustive detail, from the physical impossibility of the official explanation of the towers' collapse to the Commission's failure to scrutinize the administration to the NIST's contradiction of its own scientists to the scads of eyewitness and scientific testimony in direct opposition to official claims. Citing hundreds, if not thousands, of sources, Griffith's detailed analysis is far from reactionary or delusional, building a case that, though not conclusive, raises enough valid and disturbing questions to make his call for a new investigation more convincing than ever","torrent":{"xt":"urn:btih:ba9d8d6951f3835b1887c2b9362526988e715a84","amp;dn":"New+Pearl+Harbor+Revisited+%282008%29+David+Ray+Griffin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba9d8d6951f3835b1887c2b9362526988e715a84","infoHashBuffer":{"type":"Buffer","data":[186,157,141,105,81,243,131,91,24,135,194,185,54,37,38,152,142,113,90,132]},"announce":[],"urlList":[]}}