{"title":"The Hiddenness Argument: Philosophy's New Challenge to God","uid":12101402,"size":686910,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bb39255b9f0085d8fea332eeb8801535fa859001&amp;dn=The+Hiddenness+Argument%3A+Philosophy%27s+New+Challenge+to+God&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bookzilla","files":1,"time":1436321075,"description":"The Hiddenness Argument: Philosophy's New Challenge to Belief in God\n\n2015 pdf\n\n\n In many places and times, and for many people, God's existence has been rather less than a clear fact. According to the hiddenness argument, this is actually a reason to suppose that it is not a fact at all.\n\n The hiddenness argument is a new argument for atheism that has come to prominence in philosophy over the past two decades. J. L. Schellenberg first developed the argument in 1993, and this book offers a short and vigorous statement of its central claims and ideas. Logically sharp but so clear that anyone can understand, the book addresses little-discussed issues such as why it took so long for hiddenness reasoning to emerge in philosophy, and how the hiddenness problem is distinct from the problem of evil. It concludes with the fascinating thought that retiring the last of the personal gods might leave us nearer the beginning of religion than the end.\n\n Though an atheist, Schellenberg writes sensitively and with a nuanced insider's grasp of the religious life. Pertinent aspects of his experience as a believer and as a nonbeliever, and of his own engagement with hiddenness issues, are included. Set in this personal context, and against an authoritative background on relevant logical, conceptual, and historical matters, The Hiddenness Argument's careful but provocative reasoning makes crystal clear just what this new argument is and why it matters","torrent":{"xt":"urn:btih:bb39255b9f0085d8fea332eeb8801535fa859001","amp;dn":"The+Hiddenness+Argument%3A+Philosophy%27s+New+Challenge+to+God","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb39255b9f0085d8fea332eeb8801535fa859001","infoHashBuffer":{"type":"Buffer","data":[187,57,37,91,159,0,133,216,254,163,50,238,184,128,21,53,250,133,144,1]},"announce":[],"urlList":[]}}