{"title":"The Anthony Cumia Show 2015-05-28 Pierre Bernard Alia Janine","uid":11973144,"size":346645790,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:bbb1c11000cc56fe5fba9c15a542b48dc9db2e15&amp;dn=The+Anthony+Cumia+Show+2015-05-28+Pierre+Bernard+Alia+Janine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mothergoose58","files":2,"time":1432913869,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest(s): Pierre Bernard, Alia Janine\n\nEpisode 170 - Its Rat's 23rd birthday and Anthony tries to remember back to where he was at that age, we find out that TACS is holding Greg Gutfeld's website hostage, we watch an old clip from Conan with an &quot;angry&quot; Pierre Bernard, and hear about Ant's evening with CQ at Governor's. He then discusses minimum wage raising, automating jobs, goes through the states that legalized marijuana, religious states, look at part of a clip from The Book of Mormon, and hear from a couple of callers. Ant reads a news story that George Pataki has announced his run for President, briefly talk about Anthony Weiner and Sydney Leathers, look into the Marilyn Mosby &quot;hacking&quot; news, check in with Pierre Bernard who is by the bar doing a live cosplay drawing, Ant shows off his drawing skills, we see a hover board video, he talks about &quot;future inventions&quot; and robots, and go back to Pierre Bernard to find out how he got into drawing. Ant reminisces about the early days of the internet, we look at a street cam in Japan, listen to a Ted Cruz inspired song, hear a cop butthole licking story, KtC talks about a bribe attempt from his cop days, Ant expresses his love for mob stories and movies, we go back to Pierre who talks about his art, see some of his work, hear about his upcoming art event, and end with a KtC boat update.\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:bbb1c11000cc56fe5fba9c15a542b48dc9db2e15","amp;dn":"The+Anthony+Cumia+Show+2015-05-28+Pierre+Bernard+Alia+Janine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbb1c11000cc56fe5fba9c15a542b48dc9db2e15","infoHashBuffer":{"type":"Buffer","data":[187,177,193,16,0,204,86,254,95,186,156,21,165,66,180,141,201,219,46,21]},"announce":[],"urlList":[]}}