{"title":"Process Design for Reliable Operations - Norman R Lieberman","uid":12109382,"size":7837281,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bc794a8a171503d987e0dd0a605bc246205ec9e9&amp;dn=Process+Design+for+Reliable+Operations+-+Norman+R+Lieberman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1436489416,"description":"Process Design for Reliable Operations - Norman R Lieberman (Gulf Publishing, 1983).pdf\n\nISBN 0872017478\n\nProcess Design for Reliable Operations, 3rd edition, is a practical text that details design methods to improve the operating integrity of petroleum refineries and petrochemical plants. Subjects covered include continuous process equipment for vapor-liquid processing. Equipment covered includes:- Packed Distillation Towers, Trayed Distillatiion Towers, Distillation Tower Internals, Shell &amp; Tube Heat Exchangers-Pitfalls of Over-design, Vacuum Systems &amp; Surface Condensers, Reboilers &amp; Condensers, Centrifugal Pumps &amp; Compressors-Effect of Viscosity, Level Control &amp; Indication, Process Plant Safety, Sizing Knock-Out Drums, Hydrocarbon-Water separators, How start-up conditions influence Plant Design. The author Norman P. Lieberman, has 44 years of experience in design, operation and troubleshooting process equipment in refieries and petrochemical plants. Lieberman observes that having to operate equipment that he has designed is the best method to learn process design techniques. The new third edition has added new material based on Mr. Lieberman's latest 10 years of field troubleshooting process design experience. Specific new areas include boiler level control using the Molliere Diagram, improving tray mechanical integrity and process control concepts","torrent":{"xt":"urn:btih:bc794a8a171503d987e0dd0a605bc246205ec9e9","amp;dn":"Process+Design+for+Reliable+Operations+-+Norman+R+Lieberman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc794a8a171503d987e0dd0a605bc246205ec9e9","infoHashBuffer":{"type":"Buffer","data":[188,121,74,138,23,21,3,217,135,224,221,10,96,91,194,70,32,94,201,233]},"announce":[],"urlList":[]}}