{"title":"Advanced Concepts in Particle and Field Theory - Tristan Hubsch","uid":11999277,"size":23311557,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bc8491459cece0845bcd9f275af9dba0d3db5fbe&amp;dn=Advanced+Concepts+in+Particle+and+Field+Theory+-+Tristan+Hubsch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1433722990,"description":"Uniting the usually distinct areas of particle physics and quantum field theory, gravity and general relativity, this expansive and comprehensive textbook of fundamental and theoretical physics describes the quest to consolidate the basic building blocks of nature, by journeying through contemporary discoveries in the field, and analysing elementary particles and their interactions. Designed for advanced undergraduates and graduate students and abounding in worked examples and detailed derivations, as well as including historical anecdotes and philosophical and methodological perspectives, this textbook provides students with a unified understanding of all matter at the fundamental level. Topics range from gauge principles, particle decay and scattering cross-sections, the Higgs mechanism and mass generation, to spacetime geometries and supersymmetry. By combining historically separate areas of study and presenting them in a logically consistent manner, students will appreciate the underlying similarities and conceptual connections to be made in these fields","torrent":{"xt":"urn:btih:bc8491459cece0845bcd9f275af9dba0d3db5fbe","amp;dn":"Advanced+Concepts+in+Particle+and+Field+Theory+-+Tristan+Hubsch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc8491459cece0845bcd9f275af9dba0d3db5fbe","infoHashBuffer":{"type":"Buffer","data":[188,132,145,69,156,236,224,132,91,205,159,39,90,249,219,160,211,219,95,190]},"announce":[],"urlList":[]}}