{"title":"Antiques.Roadshow.S37E19.Lowther.Castle.1.mp4","uid":11855544,"size":654478553,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bc98c5919fd8400c5c23f32f6794ab2a8bc93e9d&amp;dn=Antiques.Roadshow.S37E19.Lowther.Castle.1.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xela_5","files":1,"time":1430152708,"description":"Antiques Roadshow UK - S37E19 - Broadcast Sunday 19 April.\n\n\nI create these using a programme called &quot;get-iplayer&quot; so the files are quite large. Also, if I upload during working hours, my upload speeds are not as great as they are off-peak, so please be patient initially.\n\n\nThe Antiques Roadshow pays a visit to Lowther Castle in Cumbria, once home to the flamboyant Earl of Lonsdale - known as 'the Yellow Earl' for his distinctive livery - where treasures include make-up from the glamorous era of the flappers, a mysterious letterbox and a stuffed dog with an aristocratic pedigree.\n\nHilary Kay is charmed by a 19th-century toy steamboat with a magnetic secret, the team are amused by a saucy illustration by Lawson Wood and the owner of an unusual letterbox receives a surprising valuation.\n\nJewellery specialist Joanna Hardy evokes the romance and glamour of high-society Manhattan as she admires a lipstick and compact set from Van Cleef &amp; Arpels, while a rare letter provides a bloody, first-hand account of the 1916 Easter Rising rebellion in Ireland.\n\nThere's also another chance to meet Bess, a stuffed terrier first seen on the Roadshow in 2011, as specialist Clive Stewart-Lockhart offers his thoughts on the antique taxidermy market - and whether Bess might once have belonged to the Earl of Lonsdale","torrent":{"xt":"urn:btih:bc98c5919fd8400c5c23f32f6794ab2a8bc93e9d","amp;dn":"Antiques.Roadshow.S37E19.Lowther.Castle.1.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc98c5919fd8400c5c23f32f6794ab2a8bc93e9d","infoHashBuffer":{"type":"Buffer","data":[188,152,197,145,159,216,64,12,92,35,243,47,103,148,171,42,139,201,62,157]},"announce":[],"urlList":[]}}