{"title":"The Upperfloor--tUF-37853 Addison Ryder, Simone Sonay and Ramon ","uid":11954555,"size":3822558537,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:bd644ba0d37ffbd1376ade849e31f61affec6d2d&amp;dn=The+Upperfloor--tUF-37853+Addison+Ryder%2C+Simone+Sonay+and+Ramon+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"merzedes","files":112,"time":1432341729,"description":"\n\n19 Year Old Slave Serves Hard Cock\n\nMay 22, 2015 - Performers: Simone Sonay ,  Ramon Nomar  and  Addison Ryder \n\n\nMed and HD MP4 + Pics.\n\n\nIt's a sexy brunch crowd full of new horny guests. They're there to see 19 year old natural Addison presented as fresh slave stock. On hand is our MILF slave Simone Sonay, who already has her slutty body locked into a stock table, leaving her pink ass and wet pussy exposed for abuse. She tries her best to advise Addison on manners with her head locked below the table top, but a big anal plug and strict cropping keep her fairly occupied. Addison stumbles through her tasks until a male guest takes pity on her and stuffs her newbie mouth with dick and pounds her against a table for everyone to see. \n\nThe Steward has prepared many fucking machines for the Brunch. Many beautiful local women start to mount the machines and fill the room with the sound of cumming. Soon it's a full blown orgy, with BDSM players and swingers fucking on all the furniture and playing sadistic games with canes and rope. Amidst the orgy, Simone teaches Addison run her tight pussy on a guest's dick, and has her own pussy painfully clamped as a punishment for her earlier performance. After being brought to a punishment orgasm, Simone uses Addison's face to sooth her pink and swollen cunt. \n\nBoth slaves are ready to be put on display and are tied together tightly and left in the middle of the room for use. Ramon takes turns with the slave's holes, bring Addison close to orgasm a violent fucking, then leaving her begging when he leaves to use Simone's ass. Steward takes pity on Addison's wiggling and deprived pussy and makes her squirt all over the floor and beg to serve the house. Simone meanwhile works her feminine charms to keep Ramon's thick cock in her ass until she is cumming and getting zapped for Addison's greedy stolen orgasms. \n\nFinal scene, we find Addison able to recite all the House Rules and properly beg for her orgasms. Simone is rewarded with a good hard anal fuck with Addison's fresh young face lapping at her clit. \n\nScreens &lt;a href=&quot;\nhttp://www.theupperfloor.com/site/shoot/37853-19-Year-Old-Slave-Serves-Hard-Cock.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theupperfloor.com/site/shoot/37853-19-Year-Old-Slave-Serves-Hard-Cock.html&lt;/a&gt;\nUploaded by Merzedes and Shallow2\n\n17 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\n\nJust keep on leaving us the nice comments below and we are happy :)\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttps://yuq.me/users/23/079/W2kwa6hEeP.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://yuq.me/users/23/079/W2kwa6hEeP.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg&lt;/a&gt;\n\nCheers :-)","torrent":{"xt":"urn:btih:bd644ba0d37ffbd1376ade849e31f61affec6d2d","amp;dn":"The+Upperfloor--tUF-37853+Addison+Ryder%2C+Simone+Sonay+and+Ramon+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd644ba0d37ffbd1376ade849e31f61affec6d2d","infoHashBuffer":{"type":"Buffer","data":[189,100,75,160,211,127,251,209,55,106,222,132,158,49,246,26,255,236,109,45]},"announce":[],"urlList":[]}}