{"title":"Learning Image Processing with OpenCV - Gloria Bueno Garcia","uid":11975597,"size":14337280,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bdfccf385c1b72e8874f8601c4bd1adc064b33a2&amp;dn=Learning+Image+Processing+with+OpenCV+-+Gloria+Bueno+Garcia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1433003888,"description":"Exploit the amazing features of OpenCV to create powerful image processing applications through easy-to-follow examples\n\nAbout This Book\n\nLearn how to build full-fledged image processing applications using free tools and libraries\nTake advantage of cutting-edge image processing functionalities included in OpenCV v3\nUnderstand and optimize various features of OpenCV with the help of easy-to-grasp examples\nWho This Book Is For\n\nIf you are a competent C++ programmer and want to learn the tricks of image processing with OpenCV, then this book is for you. A basic understanding of image processing is required.\n\nIn Detail\n\nOpenCV, arguably the most widely used computer vision library, includes hundreds of ready-to-use imaging and vision functions and is used in both academia and enterprises.\n\nThis book provides an example-based tour of OpenCV's main image processing algorithms. Starting with an exploration of library installation, wherein the library structure and basics of image and video reading/writing are covered, you will dive into image filtering and the color manipulation features of OpenCV with LUTs. You'll then be introduced to techniques such as inpainting and denoising to enhance images as well as the process of HDR imaging. Finally, you'll master GPU-based accelerations. By the end of this book, you will be able to create smart and powerful image processing applications with ease! All the topics are described with short, easy-to-follow examples","torrent":{"xt":"urn:btih:bdfccf385c1b72e8874f8601c4bd1adc064b33a2","amp;dn":"Learning+Image+Processing+with+OpenCV+-+Gloria+Bueno+Garcia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdfccf385c1b72e8874f8601c4bd1adc064b33a2","infoHashBuffer":{"type":"Buffer","data":[189,252,207,56,92,27,114,232,135,79,134,1,196,189,26,220,6,75,51,162]},"announce":[],"urlList":[]}}