{"title":"Total Body Collection with Caroline Pearce 3 DVD Set DVDRip MP4","uid":12060118,"size":2963245017,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:be0f1984a99c8645fa00763d7f5da1e946cb643b&amp;dn=Total+Body+Collection+with+Caroline+Pearce+3+DVD+Set+DVDRip+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"elessedilgirl","files":21,"time":1435232681,"description":"DVD 1 - TOTAL CARDIO BURN - These three 20 minute programmes with three different levels of intensity have been designed to create a strong and ripped body. Caroline's unique legs - arms - abs rotation system will work every part of your entire physique. Each circuit involves rotating strength exercises for lower body, upper body and abdominals (twice through) followed by her secret ingredient that will get your heart rate racing and metabolism fired up!\n\nDVD 2 - TOTAL BODY SCULPT gives you a dedicated workout for each of the 3 main areas of your body to individually tighten and firm your arms and shoulders, legs and bum and your midsection, giving you a slender and toned physique. Former International Athlete &amp; Gladiator, Caroline Pearce has specifically choreographed these 3 x 20 minute or less circuits to blast those stubborn and hard to transform areas. If you want chiselled arms, a flat tummy, great legs and a pert bottom then these targeted workouts are for you.\n\nDVD 3 - TOTAL CARDIO BLITZ has been designed to give you the best combination of fat blasting and body toning workouts in just 10 minutes or less. Former International Athlete &amp; Gladiator, Caroline Pearce has spent many years discovering the best ways to stay in shape. Using her sports scientist and heptathlon training experience, Caroline has created several unique systems to maximize your calorie burn and define your body. Her new ultra effective routines are designed to give you the best benefits in the shortest amount of time so you can burn and blitz away the fat in just 10 minutes!\n\nCaroline is a former International heptathlete and successful TV Presenter, reporter, commentator and event host. She is a published author and go-to fitness and nutrition consultant with a First Class Honours Degree in Sports Science and Master's Degree in Nutrition and Exercise Physiology from Loughborough University. You may also know her as 'Ice' from the revival of the hit TV show 'UK Gladiators'\n\nVideo; x264; 720*576 (16:9); 1818 kbps; 25.000 fps\nAudio; aac; 160 kbps; 2 ch; 48.0 Khz","torrent":{"xt":"urn:btih:be0f1984a99c8645fa00763d7f5da1e946cb643b","amp;dn":"Total+Body+Collection+with+Caroline+Pearce+3+DVD+Set+DVDRip+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be0f1984a99c8645fa00763d7f5da1e946cb643b","infoHashBuffer":{"type":"Buffer","data":[190,15,25,132,169,156,134,69,250,0,118,61,127,93,161,233,70,203,100,59]},"announce":[],"urlList":[]}}