{"title":"Catching Historys Criminals The Forensics Story s01e01 WEBRIP","uid":12039638,"size":668129688,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:be5f15e5efef4201e4f1298fb48f2074cc1a4742&amp;dn=Catching+Historys+Criminals+The+Forensics+Story+s01e01+WEBRIP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":4,"time":1434743784,"description":"Catching.Historys.Criminals.The.Forensics.Story.s01e01.A.Question.of.Identity.ENG.SUBS.WEBRIP\n\nFormat: MPEG-4\nSize: 832x468\nDisplayAspectRatio: 16:9\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\nGabriel Weston explores the history and development of forensic science. The first episode, of three, looks at the difficulty of identifying the body in a murder case.\n\nSherlock has his mind palace, Morse his music - every detective has an edge. For most, it's forensic science. This three-part series provides a rare and fascinating insight into the secret history of catching murderers, charting two centuries of the breakthroughs that have changed the course of justice. Surgeon and writer Gabriel Weston explores this rich history through some of the most absorbing, and often gruesome, stories in the forensic casebook - and looks ahead to how forensics will continue to solve the murders of the future.\n\nThe first episode looks at the difficulty of identifying the body in a murder case. The question of identity is a crucial start to the investigation. From charred bones to bodies completely dissolved in acid, with each horrific new case science has had to adapt to identify both the victim and the murderer. Investigating four breakthrough cases, Gabriel reveals the scientific innovations that tipped the scales of justice in favour of the detective - and caught the killers.\n\nFirstly, Gabriel investigates the use of teeth and bite marks to identify a victim or murderer, starting with a problematic case at Harvard Medical School in 1849. Next, she traces the use of entomology (the study of insects) to pinpoint the time of death - a crucial piece of evidence that helped identify both the killer and his victims when a gruesome collection of unidentifiable body parts was discovered in a river in Moffat in 1935.\n\nGabriel meets Professor Sir Alec Jeffreys, the geneticist who pioneered the technique of DNA profiling. Initially used to establish paternity in an immigration dispute, the application of this revolutionary discovery to the field of criminal investigation was soon established. In 1986 it led to a world first - a person caught and convicted solely on the basis of DNA evidence.\n\nTaking us right to the cutting edge of forensics, Gabriel then experiments with a new technique in development - molecular face fitting, which uses only a person's DNA to create an image of their face.\n\n[img]https://yuq.me/users/44/769/XmVxkYBvNS.png[/img]\n\n[img]https://yuq.me/users/44/769/IFe9DHBdjt.jpg[/img]","torrent":{"xt":"urn:btih:be5f15e5efef4201e4f1298fb48f2074cc1a4742","amp;dn":"Catching+Historys+Criminals+The+Forensics+Story+s01e01+WEBRIP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be5f15e5efef4201e4f1298fb48f2074cc1a4742","infoHashBuffer":{"type":"Buffer","data":[190,95,21,229,239,239,66,1,228,241,41,143,180,143,32,116,204,26,71,66]},"announce":[],"urlList":[]}}