{"title":"How to Choose a Medical Specialty - Fifth Edition","uid":11980771,"size":1890972,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bedaa13868f58cc850c8d5e8fa19f05a7ab8a476&amp;dn=How+to+Choose+a+Medical+Specialty+-+Fifth+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":4,"time":1433197574,"description":"What does it take to be an immunologist? A pediatrician? A plastic surgeon? Which specialty is best suited to your interests, abilities, and personality? When you are grappling with these questions, consult How to Choose a Medical Specialty. This resource has helped countless medical students to make informed choices and plan their residencies. The latest edition of the seminal reference for premedical and medical students, this guide describes every specialty and sub-specialty approved by the American Board of Medical Specialties. It provides questionnaires to help you assess how well suited you are for the specialties that you're considering. Personal insights from practitioners are included, giving you a realistic picture of what it is like to practice in each specialty. In addition to the book, there is a companion site at The Student Doctor Network that includes interactive questionnaires, links, and the latest information on each specialty. The Student Doctor Network (SDN) is the premier source for unbiased and independent information about health professions education. Our mission is to assist and encourage all students through the challenging and complex health care education proess and into practice. Our forums community is staffed entirely by volunteers and serves pre-health and medical students as well as residents, doctors, and other health professionals. SDN is published by the Coastal Research Group, a nonprofit 501(c)(3) tax-exempt educational organization. Anita D. Taylor, M.A. Ed. is Associate Professor Emeritus of Family Medicine and formerly Assistant Dean for Student Development at the Oregon Health &amp; Science University School of Medicine, Portland, Oregon. She is a graduate of Bryn Mawr College with a B.A. in sociology and Wake Forest University with a Master of Art's degree in Education and Counseling. She was selected by her faculty colleagues at the Oregon Health &amp; Science University School of Medicine as the recipient of the Faculty Excellence in Education Award in 2000. The American Academy of Family Physicians awarded her Honorary Membership in 2004. In April 2007 she received the Excellence in Education Award from the Society of Teachers of Family Medicine. The author of more than 40 articles in the medical literature, she has spoken on career planning and personal life development at international, national, and state meetings. The 5th edition of her book, &quot;How to Choose a Medical Specialty,&quot; was published in 2012","torrent":{"xt":"urn:btih:bedaa13868f58cc850c8d5e8fa19f05a7ab8a476","amp;dn":"How+to+Choose+a+Medical+Specialty+-+Fifth+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bedaa13868f58cc850c8d5e8fa19f05a7ab8a476","infoHashBuffer":{"type":"Buffer","data":[190,218,161,56,104,245,140,200,80,200,213,232,250,25,240,90,122,184,164,118]},"announce":[],"urlList":[]}}