{"title":"The Lost Ranger: A Soldier's Story by Noel Mehlo","uid":11954532,"size":32133445,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bf09c60f97d8c10fb6e606ac0515e4181d56fec4&amp;dn=The+Lost+Ranger%3A+A+Soldier%27s+Story+by+Noel+Mehlo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"PirateBook","files":1,"time":1432339393,"description":"The Lost Ranger is the story of United States Army Staff Sergeant Herbert Stanton Hull in the 5th Ranger Infantry Battalion during World War II. It is a story of valor and fortitude. It is a complete analysis of the history of the battalion from 1943 until September 1944. This is the story of his service. \n\nHe survived the bloody June 6, 1944 D-Day invasion on Omaha Beach. He was wounded by a landmine while assaulting a fort at Brest, France on September 2, 1944. The fighting was so severe that seventy-five percent of the unit became casualties where the collective memory of the unit was decimated. After lying on the battlefield for hours he was found by his fellow Rangers only to become lost. \n\nHe was physically lost to his unit and then administratively to the official records of the unit. After returning home from battle, he then tragically died ten years later leaving behind his wife and four young children. When he died in 1954, all detailed knowledge of his service died with him. \n\nHe became a lost Ranger. After exhaustive research, collaboration with historians and authors in the States and Europe, and through interviews with Ranger veterans and their families, this story details this specialized unit, where they went, what they did, and why they did it. More importantly, it examines how he was restored to history and brought home to a family who never really knew him.\n\nGenre: Non-Fiction, General","torrent":{"xt":"urn:btih:bf09c60f97d8c10fb6e606ac0515e4181d56fec4","amp;dn":"The+Lost+Ranger%3A+A+Soldier%27s+Story+by+Noel+Mehlo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf09c60f97d8c10fb6e606ac0515e4181d56fec4","infoHashBuffer":{"type":"Buffer","data":[191,9,198,15,151,216,193,15,182,230,6,172,5,21,228,24,29,86,254,196]},"announce":[],"urlList":[]}}