{"title":"Microsoft Office 2013 SP1 ProPlus v2015 x64 + Visio","uid":12045575,"size":3149735046,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bf664f76bb2a246654efce571d69516df4cff57a&amp;dn=Microsoft+Office+2013+SP1+ProPlus+v2015+x64+%2B+Visio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Hersetem","files":1,"time":1434845476,"description":"Microsoft Office 2013 SP1 - the best of software for working with documents of various types. It is composed of the best tools for business development, as well as to achieve maximum comfort in the learning process, maintaining household finances and other things. Whether it's business or home - it does not matter, Office 2013 simply must be installed on any self-respecting user who uses a PC not only for entertainment. Effective and easy-to-use tools help simple home users and small businesses significantly improve their productivity in all their activities, ranging from e-mail, scheduling and ending the day informative reports and stunning presentations.\n\nPackage :\n\nMicrosoft Office Professional Plus 2013 SP1\nMicrosoft Word 2013\nMicrosoft Excel 2013\nMicrosoft PowerPoint 2013\nMicrosoft Outlook 2013\nMicrosoft Publisher 2013\nMicrosoft Access 2013\nMicrosoft InfoPath 2013\nMicrosoft OneNote 2013\nMicrosoft Lins 2013\nMicrosoft SkyDrive Pro 2013\nMicrosoft Visio Pro 2013 SP1\nMicrosoft Project Pro 2013 SP1\n\nWhat's new :\n\nOpening Microsoft Office, you will immediately notice the new and fresh design. However, all the old and familiar features have not disappeared and were supplemented by new ones, which help to work more efficiently. New Office applications can also be used on smartphones, tablet PCs and cloud environments, even on computers without a specific set of Office. Now the important files will always be available to you, wherever you are and whatever device or used.\nUsing Office from any location\nInstall Office by using an account Microsoft.\nUse Office program on another computer.\nSave files to SkyDrive for easy access and sharing .\nUse your own personal way to set up, wherever you are.\nSaving files and share them in the cloud. Cloud storage is available at any time when you are connected to the Internet. Now you can easily save Office files on SkyDrive or on the organization's website, where you can work on documents Word, Excel spreadsheets and other Office files and make them available to other users. You can even work on a file simultaneously with colleagues.\nJoint Meeting. Join an online meeting using slides and PowerPoint, documents Word, Excel spreadsheets and OneNote notes together.\nof meeting participants can view the files, even if they have not installed a set of Office.\nMore options started. Instead of an empty file, you can select the last file or favorite template. OneNote allows you to enter and open notebooks from the Internet or from your computer.\nEasier saving and opening. You no longer need a long view and scroll through the dialog boxes. Your most used folders, you will see immediately. You can also attach the location that it was always available.\nSimplified file sharing. All parameters file sharing collected in Office programs in one place, which can be opened by selecting the File tab click Sharing.\n\nSystem Requirements :\n\nComputer and processor: 1 gigahertz (GHz) or higher, x86- or x64-bit. CPU with SSE2 instruction set Memory (RAM): 1 gigabyte (GB) RAM (32-bit.); 2 gigabytes (GB) RAM (64-bit) Hard Disk: 3.0 gigabytes (GB) of free space Display: graphics hardware acceleration requires a graphics card with support for DirectX10 and resolution of 1024 x 576 Operating System: Windows 7, Windows 8, Windows Server 2008 R2 or Windows Server 2012","torrent":{"xt":"urn:btih:bf664f76bb2a246654efce571d69516df4cff57a","amp;dn":"Microsoft+Office+2013+SP1+ProPlus+v2015+x64+%2B+Visio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf664f76bb2a246654efce571d69516df4cff57a","infoHashBuffer":{"type":"Buffer","data":[191,102,79,118,187,42,36,102,84,239,206,87,29,105,81,109,244,207,245,122]},"announce":[],"urlList":[]}}