{"title":"Billy the Kid by Daniel A. Edwards","uid":11954529,"size":2873648,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bfb101da4e59494546438efe9d9a48285ca9595e&amp;dn=Billy+the+Kid+by+Daniel+A.+Edwards&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"PirateBook","files":1,"time":1432339144,"description":"Billy the Kid: An Autobiography: The Story of Brushy Bill Roberts by Daniel A. Edwards\n\n\nIn 1882 a notorious outlaw and a childhood friend of Billy the Kid was released from prison where he had been serving time for killing a Texas Ranger. His freedom finally secured, the outlaw disappeared and was never heard from again. Never, that is, until 1948 when he came out of hiding after almost 70 years. \n\nIn the course of proving his identity to a court of law the outlaw revealed that his friend Billy the Kid was not killed by Pat Garrett but was still alive even to that day. \n\nAfter a period of research and persistence the young lawyer was finally led to a destitute old man in Texas who was named not William H. Bonney but William H. Roberts, although Bonney had been an alias that he had used. Roberts agreed to reveal himself as Billy the Kid if the lawyer would help him obtain a pardon so he could die a free man. \n\nYou see, the Kid was still wanted for murder so to come forward was to risk being sentenced and put to death, but this was a risk that William H. Roberts was willing to take. He told his story only one time, to one man. This is his story, now presented for the first time with new photographic evidence and research that supports his claim that he was the one true Billy the Kid of legend.\n\nGenre: Non-Fiction, General","torrent":{"xt":"urn:btih:bfb101da4e59494546438efe9d9a48285ca9595e","amp;dn":"Billy+the+Kid+by+Daniel+A.+Edwards","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfb101da4e59494546438efe9d9a48285ca9595e","infoHashBuffer":{"type":"Buffer","data":[191,177,1,218,78,89,73,69,70,67,142,254,157,154,72,40,92,169,89,94]},"announce":[],"urlList":[]}}