{"title":"Paris in the Past - From Fouquet to Daumier (Art Ebook).pdf","uid":12034574,"size":18256500,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c167659cf2ea99ff694edfad645c4028b3644504&amp;dn=Paris+in+the+Past+-+From+Fouquet+to+Daumier+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"STBGD","files":1,"time":1434667894,"description":"pdf / English / 1957 Skira / 160 pages / 17.4 MB\n\nFamous Places as seen by Great Painters. To convey the sense of Paris, to fathom its mysteries, to account for its prestige and fascination, we have called on the works, visionary or realistic, of all those artists past and present, from the masters of the Parisian workshops of the Middle Ages to those of the 20th-century School of Paris, who have found in this great city the &quot;climate&quot; best suited to the fulfillment of their vision. Their pictures, passing like a film, evoke five hundred years of eventful history and colorful daily life. Out of the changing aspects of the Paris of the past, the Paris of our time emerges and takes shape, not domineering or imperial, but a city that has always extended a hearty welcome to all men alike, a city whose grandeur has nothing forbidding about it, whose cheerful simplicity is gracious and winning. A unique site, with its islands anchored in the Seine and its crown of hills, Paris has been enriched and ennobled by countless architects and artists. The early city walls were pushed back little by little, and through the medieval maze of houses broad avenues were opened up and vast squares laid out. The art and architecture of Paris express to perfection the taste and spirit of a creative-minded, beauty-loving people","torrent":{"xt":"urn:btih:c167659cf2ea99ff694edfad645c4028b3644504","amp;dn":"Paris+in+the+Past+-+From+Fouquet+to+Daumier+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c167659cf2ea99ff694edfad645c4028b3644504","infoHashBuffer":{"type":"Buffer","data":[193,103,101,156,242,234,153,255,105,78,223,173,100,92,64,40,179,100,69,4]},"announce":[],"urlList":[]}}