{"title":"Plasticity and Creep of Metals","uid":12014099,"size":3308866,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c28158ecfc376069b326e7db44aeeada9f4bf183&amp;dn=Plasticity+and+Creep+of+Metals&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1434276534,"description":"ISBN 9783642212123\n\nThis book serves both as a textbook and a scientific work. As a textbook, the work gives a clear, thorough and systematic presentation of the fundamental postulates, theorems and principles and their applications of the classical mathematical theories of plasticity and creep. In addition to the mathematical theories, the physical theory of plasticity, the book presents the Budiansky concept of slip and its modification by M. Leonov. Special attention is given to the analysis of the advantages and shortcomings of the classical theories. In its main part, the book presents the synthetic theory of irreversible deformations, which is based on the mathematical Sanders flow plasticity theory and the physical theory, the Budiansky concept of slip. The main peculiarity of the synthetic theory is that the formulae for both plastic and creep deformation, as well their interrelations, can be derived from the single constitutive equation. Furthermore, the synthetic theory, as physical one, can take into account the real processes that take place in solids at irreversible deformation. This widens considerably the potential of the synthetic theory. In the framework of the synthetic theory such problems as creep delay, the Hazen-Kelly effect, the deformation at the break of the load trajectory, the influence of the rate of loading on the stress-strain diagram, creep at the changes of load, creep at unloading and reversed creep, have been analytically described. In the last chapter, the book shows the solution of some contemporary problems of plasticity and creep: Creep deformation at cyclic abrupt changes of temperature, The influence of irradiation on the plastic and creep deformation, Peculiarities of deformation at the phase transformation of some metals","torrent":{"xt":"urn:btih:c28158ecfc376069b326e7db44aeeada9f4bf183","amp;dn":"Plasticity+and+Creep+of+Metals","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c28158ecfc376069b326e7db44aeeada9f4bf183","infoHashBuffer":{"type":"Buffer","data":[194,129,88,236,252,55,96,105,179,38,231,219,68,174,234,218,159,75,241,131]},"announce":[],"urlList":[]}}