{"title":"Mary Berrys Absolute Favourites-S01E04-WebDL-HD-x264","uid":11992372,"size":514082568,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:c2de42208fa511286cf2761dc5ab8d2440ad2622&amp;dn=Mary+Berrys+Absolute+Favourites-S01E04-WebDL-HD-x264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"uggauga","files":2,"time":1433556336,"description":"Episode 4\n\nIn this delightful six part series, the nation's best-loved home cook draws on her wealth of cookery know-how to share a selection of her absolute favourite recipes. In each episode, Mary draws inspiration from a favourite place, one where she loves to spend time, and cooks up tried and tested crowd pleasers as well as a bounty of new dishes that are easy to make, yet guaranteed to impress all your family and friends.\n\nOne of Mary's pleasures is to shop for fresh, exciting, seasonal ingredients, and in this episode it's the local farmers' market that inspires Mary. There's nothing like meeting local producers and the feeling of knowing where your food comes from, and in this programme, Mary visits Guildford Famers' Market to source some wonderful fresh ingredients to take back to the kitchen.\n\nFirstly Mary prepares a delicious soup using one of her favourite seasonal vegetables - asparagus. Next it's a dinner party classic - chicken with lemon creme fraiche and asparagus. Farmers' markets are great places to source speciality goods like sunblushed tomatoes, fresh olives and chargrilled artichokes - all of which Mary uses in her spectacular five-market salad tapas.\n\nFor busy mum and dads on the go, Mary reveals a one-dish wonder - a delicious sausage supper that all the family will love. To finish she whips up a special pavlova with red market fruits - perfect for a special occasion and a spectacular end to any meal","torrent":{"xt":"urn:btih:c2de42208fa511286cf2761dc5ab8d2440ad2622","amp;dn":"Mary+Berrys+Absolute+Favourites-S01E04-WebDL-HD-x264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2de42208fa511286cf2761dc5ab8d2440ad2622","infoHashBuffer":{"type":"Buffer","data":[194,222,66,32,143,165,17,40,108,242,118,29,197,171,141,36,64,173,38,34]},"announce":[],"urlList":[]}}