{"title":"Encyclopedia of Earth Science (Facts on File) (2005).pdf Gooner","uid":12027212,"size":14595857,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c3b35632b5abc311a526d5d116ddc331ed6c2580&amp;dn=Encyclopedia+of+Earth+Science+%28Facts+on+File%29+%282005%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1434546605,"description":"Pages: 510 \nPublisher: Facts on File (January 2005)\nLanguage: English\nISBN-10: 0816049734\nISBN-13: 978-0816049738\n\nEncyclopedia of Earth Science provides a broad scope of important subjects in the field of Earth science - hydrology, structural geology, petrology, isotope geology, geochemistry, geomorphology, and oceanography. Containing approximately 700 entries, 19 prose essays, 110 line illustrations, and 100 black-and-white photographs, this comprehensive encyclopedia is perfect for high school and early college students. Hundreds of entries on concepts, theories and hypotheses, places and events, the major periods of geological time, people who have made significant contributions to the field, technology and instruments, occupations and careers, organizations, field locations, and other subjects round out this comprehensive volume. An ideal reference to the principal areas and issues related to this core area of science, Encyclopedia of Earth Science is extensively cross-referenced and indexed, bringing information quickly and easily to the fingertips of its readers. Entries include convection and the Earth's mantle; Charles Darwin; El Nino and the Southern Oscillation (ENSO); geochronology; Gondwana, Gondwanaland; Himalayan Mountains; jet streams; life's origins and early evolution; metamorphism; Pangea; uniformitarianism; and volcanic bomb","torrent":{"xt":"urn:btih:c3b35632b5abc311a526d5d116ddc331ed6c2580","amp;dn":"Encyclopedia+of+Earth+Science+%28Facts+on+File%29+%282005%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3b35632b5abc311a526d5d116ddc331ed6c2580","infoHashBuffer":{"type":"Buffer","data":[195,179,86,50,181,171,195,17,165,38,213,209,22,221,195,49,237,108,37,128]},"announce":[],"urlList":[]}}