{"title":"Channel.Patrol.Series.2.06of10.720p.HDTV.x264.AAC.MVGroup.org","uid":11881036,"size":1034642367,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:c4163fd55229f36200463159bb5a0520e77e88bb&amp;dn=Channel.Patrol.Series.2.06of10.720p.HDTV.x264.AAC.MVGroup.org&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"artistharry","files":1,"time":1430693180,"description":"Channel Patrol: Series 2\n\nTravel Documentary hosted by Richard Hawley, published by BBC in 2015 - English narration\n &lt;a href=&quot;\nhttp://docuwiki.net/images/9/91/Channel-Patrol-Series-2-Cover.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/images/9/91/Channel-Patrol-Series-2-Cover.jpg&lt;/a&gt;\n\nInformation\n------------------------------\n\nChannel Patrol: Series 2\nThe return of the Documentary series following the lives of those that use the English Channel for pleasure, those that earn a living from it, and most importantly those who keep it safe.\n\n\n1)  Part 1 \nIn the first edition, RNLI volunteers from Calshot are faced with the task of rescuing 25 people during the night when a giant car carrier, the Heogh Osaka, is grounded on a sandbank in the Solent. Meanwhile, a premature baby seal that was found washed up on the beach receives intensive care from the RSPCA team in Hastings.\n\n2)  Part 2 \nA maintenance crew sets to work on the Channel Tunnel while it is closed during the night and a helicopter is used to help resupply the Wolf Rock Lighthouse, which lies eight nautical miles off Land's End. Plus, a team of teenagers braves choppy waters and jellyfish to swim across the English Channel to France.\n\n3)  Part 3 \nMembers of the Royal Navy combat rough seas in the Channel after six months in the Gulf. The pilot of a high-speed catamaran ferry battles traffic between Southampton and the Isle of Wight, and loadmaster Shane Brearley attempts to lift a new Ã‚Â£700,000 luxury yacht from the water and load it for the next leg of the journey to its new owner.\n\n4)  Part 4 \nThe Royal Navy bomb squad unearths a deadly relic that has been sitting on a mantelpiece in Worthing, West Sussex, for the past 30 years. The weekly cargo ship arrives at Alderney in the Channel Islands, but the port's crane is put to the test with one item. Plus, a sailor navigates a 25ft-tall ship from its old berth in Amsterdam through the English Channel's busy shipping lanes.\n\n5)  Part 5 \nThe Royal Navy Air Squadron receives a distress call regarding teenagers stranded at the bottom of steep cliffs. New ferry captain Mark Miller takes the helm as the weather closes in, and at Southampton dock, engineers race to repair the port's giant forklifts as a backlog of customers mounts up.\n\n6)  Part 6 \nThe RNLI comes to the aid of stranded mariners, while unpredictable winter weather causes problems for the Frostbite Racing Series near Southampton and pet owners and their four-legged friends are caught up in the half-term rush at the Eurotunnel Pet Centre.\n\n7)  Part 7 \nA giant cargo ship braves treacherous shipping lanes during a 580-mile journey from Hamburg to Southampton. Plus, a local oyster farmer finds treasure in the deep and a bomb squad unearths a Second World War artillery shell discovered during building work on the Isle of Wight.\n\n8)  Part 8 \nA tiny tugboat steers a giant tanker safely into port, young British sailors attempt a speed record to France, and a man and his girlfriend are out in all weathers trying to muscle in on the whelk fishing market.\n\n9)  Part 9 \nA team from the Environment Agency discovers how carrying out flood defence work in the middle of winter can be tricky as conditions change near Camber Sands, East Sussex, and Royal Navy Sub Lieutenant Phil Reid carries out a spotting mission\n\n10)  Part 10 \nabove the sea. There is also a look at the logistics involved in feeding thousands of hungry customers every year on board a ferry.\nA maintenance crew negotiates its way through a seaway obstacle course to carry out repairs on a buoy with a broken light, and some university students get a taste of Navy life as they join in with a simulated counter narcotics and people-smuggling exercise. Meanwhile, a team of builders takes on the challenging task of turning a Victorian fort two miles out to sea into a luxury hotel - complete with 22 bedrooms, helipads, a sauna and a cabaret bar.\n\n\n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;91d9f8f6f9d1dda5bfa0&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video Bitrate: 2992 Kbps\n * Video Aspect Ratio: 1.778 (16:9)\n * Video Resolution: 1280 x 720\n * Audio Codec: AAC LC\n * Audio English\n * Audio Bitrate: 160 kb/sVBR 48 KHz\n * Audio Channels: Stereo 2\n * Run-Time: 45mins\n * Framerate: 25 fps\n * Number of Parts: 10\n * Container Mp4\n * Part Size: 980 MB\n * Source: HDTV\n * Encoded by: Harry65\n\nRelease Notes\nMerged Subtitles\n\nLinks\n------------------------------\n\n1)  Further Information \n * http://www.bbc.co.uk/programmes/b05s9kd4","torrent":{"xt":"urn:btih:c4163fd55229f36200463159bb5a0520e77e88bb","amp;dn":"Channel.Patrol.Series.2.06of10.720p.HDTV.x264.AAC.MVGroup.org","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4163fd55229f36200463159bb5a0520e77e88bb","infoHashBuffer":{"type":"Buffer","data":[196,22,63,213,82,41,243,98,0,70,49,89,187,90,5,32,231,126,136,187]},"announce":[],"urlList":[]}}