{"title":"Scale-up in Chemical Engineering - Marko Zlokarnik","uid":12111003,"size":2364852,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c439534e03122c25fb0010099c6fc2242ee438a0&amp;dn=Scale-up+in+Chemical+Engineering+-+Marko+Zlokarnik&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1436573180,"description":"Scale-up in Chemical Engineering - Marko Zlokarnik (Wiley-VCH, 2002).pdf\n\nISBN 3527302662\n\nA chemical engineer is generally concerned with the industrial implementation of processes in which chemical or microbiological conversion of material takes place in conjunction with the transfer of mass, heat, and momentum. The characteristics of these processes depend on their scale.\nThey include heterogeneous chemical reactions and unit operations. Understandably, chemical engineers have always wanted to find ways of simulating these processes to gain insights assising them while designing new industrial plants or trying to optimize existing plants.\nIrrespective of whether the model involved represents a &quot;scale-up&quot; or a&quot;scale-down&quot;, certain important questions always apply: How small can the model be? Is one model sufficient or should tests be carried out in models of different sizes? When must or when can physical properties differ? When must the measurements be carried out on the model with the original system of materials? Which rules govern the adaptation of the process parameters in the model measurements to those of the full-scale plant? Is it possible to achieve complete similarity between the processes in the model and those in its full-scale counterpart? If not: how should one proceed?\n\nThese questions touch on the fundamentals of the theory of models, which are based on dimensional analysis. Although they have been used in the field of fluid dynamics and heat transfer for more than a century - cars, aircrafts, vessels and heat exchangers were scaled up according to these principles - these methods have gained only a modest acceptance in chemical engineering.\nThis book attempts to fill this gap. It is aimed at students and practicing chemical engineers. It consists of two parts.\nThe first part presents the principles of dimensional analysis and of scale-up, based on it, in an easily comprehensible and transparent manner. These principles are illustrated by 23 examples concerning well-known operations from the field of chemical engineering.\nThe second part of the book presents selected examples of treatment of processes in the field of mechanical (11 samples), thermical (6 examples) and chemical (5 examples) process engineering by the dimensional analysis. The last chapter shows that this method can also be favourably applied to the motion processes in the living world (5 examples), leading to a better understanding of them","torrent":{"xt":"urn:btih:c439534e03122c25fb0010099c6fc2242ee438a0","amp;dn":"Scale-up+in+Chemical+Engineering+-+Marko+Zlokarnik","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c439534e03122c25fb0010099c6fc2242ee438a0","infoHashBuffer":{"type":"Buffer","data":[196,57,83,78,3,18,44,37,251,0,16,9,156,111,194,36,46,228,56,160]},"announce":[],"urlList":[]}}