{"title":"Antiques Roadshow S37E23","uid":11963612,"size":654280199,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c4e2096c4f119cb746d7d4c0d677bc5dabc2ef3a&amp;dn=Antiques+Roadshow+S37E23&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xela_5","files":1,"time":1432610723,"description":"The Antiques Roadshow UK S37E23\n\nThe Antiques Roadshow returns to Barrington Court in Somerset, where surprising finds include a revolver believed to have been owned by Wild West showman Buffalo Bill, a rock crystal brooch with magical properties and a mouthwatering collection of old moulds for making chocolate.\n\nFiona Bruce marvels at the miles of rare-wood panelling that adorn Barrington Court, collected by former owner and sugar baron Colonel Lyle, before the team get to grips with Victorian brooches filled with locks of hair and a 17th-century painting with a surprising line in humour.\n\nThe Roadshow's resident armourer, Robert Tilney, cannot resist a 20-shot revolver that is said to have belonged to Buffalo Bill, while a pair of signal flags provide a moving insight into the Normandy landings of the Second World War.\n\nA pair of ceramic figures in Russian dress reveal the surprising story of an intrepid Englishman who set up a porcelain factory in Moscow in the 18th century, while jewellery specialist Geoffrey Munn is entranced by an intricately engraved rock crystal with magical properties and a fine portrait of a woman wearing it.\n\nFinally, a collection of rare confectionery moulds linked to German manufacturer Anton Reich will put a smile on the face of chocoholics everywhere","torrent":{"xt":"urn:btih:c4e2096c4f119cb746d7d4c0d677bc5dabc2ef3a","amp;dn":"Antiques+Roadshow+S37E23","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4e2096c4f119cb746d7d4c0d677bc5dabc2ef3a","infoHashBuffer":{"type":"Buffer","data":[196,226,9,108,79,17,156,183,70,215,212,192,214,119,188,93,171,194,239,58]},"announce":[],"urlList":[]}}