{"title":"BBC Documentaries Animals Unexpected ENG SUBS WEBRIP","uid":12021374,"size":512334023,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c527ffd492fda78ad64f68f0dbfff1e91451c06e&amp;dn=BBC+Documentaries+Animals+Unexpected+ENG+SUBS+WEBRIP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":4,"time":1434446276,"description":"BBC.Documentaries.s2015e143.Animals.Unexpected.ENG.SUBS.WEBRIP\n\nFormat: MPEG-4\nSize: 832x468\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\nAll over the world, animals are turning up in strange and unexpected places. Some are showing up thousands of miles from their natural homes - like African hippos now running riot in South America. Other native animals are turning up on our doorsteps - like black bears taking dips in swimming pools. These events are happening more and more across the world, and biologist Lucy Cooke wants to find out what's going on, so she's turning detective.\n\nAnimals Unexpected follows her investigation as she travels from the remote peaks of the Italian Alps to the heart of New York, in search of animals where they just shouldn't be! She discovers wolf-like creatures in the Big Apple, North American raccoons in Berlin and ancient sea creatures flocking around vast billowing power stations.\n\nLucy uncovers the latest research about the superpowers that enable these animals to survive and thrive in new and unexpected places - from lock-picking raccoons to giant pythons that are the masters of staying hidden. Ultimately she discovers how we humans are changing the world - and how animals are reacting in ways we could never have predicted.\n\nThis is a very modern tale of our increasingly unnatural history","torrent":{"xt":"urn:btih:c527ffd492fda78ad64f68f0dbfff1e91451c06e","amp;dn":"BBC+Documentaries+Animals+Unexpected+ENG+SUBS+WEBRIP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c527ffd492fda78ad64f68f0dbfff1e91451c06e","infoHashBuffer":{"type":"Buffer","data":[197,39,255,212,146,253,167,138,214,79,104,240,219,255,241,233,20,81,192,110]},"announce":[],"urlList":[]}}