{"title":"Process Engineering and Design Using Visual Basic - Arun Datta","uid":12109805,"size":19558038,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c529ddd012b0a0c54cd7c22947145baa6dc16ce3&amp;dn=Process+Engineering+and+Design+Using+Visual+Basic+-+Arun+Datta&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1436543772,"description":"Process Engineering and Design Using Visual BasicÂ® - Arun Datta (CRC, 2008).pdf\n\nISBN: 9781420045420\n\nSoftware tools are a great aid to process engineers, but too much dependence on such tools can often lead to inappropriate and suboptimal designs. Reliance on software is also a hindrance without a firm understanding of the principles underlying its operation, since users are still responsible for devising the design.\n\nIn Process Engineering and Design Using Visual Basic, Arun K. Datta provides a unique and versatile suite of programs along with simultaneous development of the underlying concepts, principles, and mathematics. Each chapter details the theory and techniques that provide the basis for design and engineering software and then showcases the development and utility of programs developed using the material outlined in the chapter. This all-inclusive guide works systematically from basic mathematics to fluid mechanics, separators, overpressure protection, and glycol dehydration, providing basic design guidelines based on international codes. Worked examples demonstrate the utility of each program, while the author also explains problems and limitations associated with the simulations","torrent":{"xt":"urn:btih:c529ddd012b0a0c54cd7c22947145baa6dc16ce3","amp;dn":"Process+Engineering+and+Design+Using+Visual+Basic+-+Arun+Datta","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c529ddd012b0a0c54cd7c22947145baa6dc16ce3","infoHashBuffer":{"type":"Buffer","data":[197,41,221,208,18,176,160,197,76,215,194,41,71,20,91,170,109,193,108,227]},"announce":[],"urlList":[]}}