{"title":"The Oxford Companion to 20th Century Art.pdf","uid":12103790,"size":182427338,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c5b0303de3ec22b58aecb4e7b4321a69fc041311&amp;dn=The+Oxford+Companion+to+20th+Century+Art.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"STBGD","files":1,"time":1436398752,"description":"The Oxford Companion to Twentieth-Century Art\nOxford University Press | 1981 | ISBN 0198661193 | Eng | 806 pages | PDF | 174 MB\n\nThe Oxford Companion to Twentieth Century Art provides readers at every level with a wealth of material and information on the art of our time. No other reference book or guide to twentieth-century art covers so wide a range of subjects, or supplies so much detail, as this one-volume assemblage, based on previously scattered information from inaccessible histories, monographs, and widely dispersed exhibition catalogs. Complementing The Oxford Companion to Art, this new Companion treats in far greater depth the artists, ideas, movements and trends of painting, sculpture, and the graphic arts of this century up to the mid 1970s. While it contains mainly entries on individual artists, the contributors also include articles on movements and schools, styles and new technical terms, ranging from Dada and Surrealism to Body Art and Computer Art. It offers separate accounts of art in the United States, Britain, and in the major European countries, as well as articles by leading authorities on the art and artists of Africa, Australia, Canada, Latin America, Mexico, South Africa, and the USSR. The contributors concentrate particularly on the aims and aesthetic theories of individual artists and groups. Including 300 carefully-chosen illustrations--nearly half in color--and a selective bibliography, The Oxford Companion to Twentieth-Century Art will guide students of art and general readers intelligently through the exuberant jungle of contemporary art","torrent":{"xt":"urn:btih:c5b0303de3ec22b58aecb4e7b4321a69fc041311","amp;dn":"The+Oxford+Companion+to+20th+Century+Art.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5b0303de3ec22b58aecb4e7b4321a69fc041311","infoHashBuffer":{"type":"Buffer","data":[197,176,48,61,227,236,34,181,138,236,180,231,180,50,26,105,252,4,19,17]},"announce":[],"urlList":[]}}