{"title":"eForensics and Investigations for Everyone - Eamon P. Doherty","uid":12008734,"size":2294780,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c5bac8bfa15741429039ce276056f4e7a3277f15&amp;dn=eForensics+and+Investigations+for+Everyone+-+Eamon+P.+Doherty&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1434042854,"description":"This book discusses a variety of topics such as cell phone seizure and examination, electrical fire investigation, potential vulnerabilities when using historic electrical devices, interpersonal conduct in the Middle East, Russia, and the USA, intellectual property theft, spy cases, and various motivations for crime in a manner that everyone can understand. We also discuss various test equipment and software used for collecting evidence from both physical evidence and invisible radio frequency artifacts. We also discuss electronic equipment that is used to destroy various documents as well as both human and automated processes used to reconstruct small shreds of paper. We discuss real cases regarding document reconstruction such as the American Embassy in Iran and the recently discovered East German (secret police) Stasi shredded records. We also discuss the Hanssen spying case using a PDA and low tech techniques such as the dead drop. Lastly, Jeff Marsh, a brilliant man who became disabled due to an unfortunate accident, demonstrates with the help of Dr. Doherty, various devices such as clocks and mustard jars with concealed purposes that may be used by undercover surveillance professionals or private investigators in a variety of settings, once proper approval is given. Jeff also discusses recreation and conversation as a means of exercising our intellect and informally learning from other people","torrent":{"xt":"urn:btih:c5bac8bfa15741429039ce276056f4e7a3277f15","amp;dn":"eForensics+and+Investigations+for+Everyone+-+Eamon+P.+Doherty","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5bac8bfa15741429039ce276056f4e7a3277f15","infoHashBuffer":{"type":"Buffer","data":[197,186,200,191,161,87,65,66,144,57,206,39,96,86,244,231,163,39,127,21]},"announce":[],"urlList":[]}}