{"title":"Marine Pollution and Human Health","uid":12021636,"size":18003210,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c8af4172f1fc666e7bf6b68ce901708759ad9bb4&amp;dn=Marine+Pollution+and+Human+Health&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1434451137,"description":"ISBN 9781849732406\n\nThere is growing concern about the state of the world's oceans. The rapid growth of human populations in coastal regions has led to increasing dependence on marine resources. Beneficial features related to food supply and life style need to be balanced against the hazards presented by microbial pathogens, chemical pollutants, and toxic algal blooms. In this book, a group of experts from a range of backgrounds review the key aspects of the marine environment in relation to human health. An initial overview explains the need for integrating a range of disciplines, from physical oceanography and marine biology to molecular biology and epidemiology. Only by this approach can we hope to predict the consequences of environmental change and exploitation of natural resources upon our coastal ecosystems and, ultimately, on society and human health. Subsequent chapters then focus on more specialized topics. Firstly, waterborne pathogens are reviewed in detail and the microbial measures and policy implications important for protecting humans from exposure are described. Next, the consumption of contaminated seafood is considered along with its implications regarding the growth of aquaculture. Priority pollutants, emerging contaminants, and plastics are investigated as are the effects of climate change on pollution. Some phytoplankton produce biotoxins which accumulate in the flesh of filter-feeders such as bivalve molluscs. This creates a health risk when the shellfish are consumed by humans. The penultimate chapter, therefore, concentrates on harmful algal blooms (HABs) and the methodologies used to safeguard human health. The book concludes by proposing a holistic systems approach, such as Integrated Coastal Zone Management, to address the interconnected scientific challenges of increased human population pressure, pollution, over-exploitation of food resources, and the urgent need for effective public health solutions to be developed from politically and environmentally meaningful policies","torrent":{"xt":"urn:btih:c8af4172f1fc666e7bf6b68ce901708759ad9bb4","amp;dn":"Marine+Pollution+and+Human+Health","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8af4172f1fc666e7bf6b68ce901708759ad9bb4","infoHashBuffer":{"type":"Buffer","data":[200,175,65,114,241,252,102,110,123,246,182,140,233,1,112,135,89,173,155,180]},"announce":[],"urlList":[]}}