{"title":"Sinclair Lewis - Nobel Prize in Literature, 1930 (20 books)","uid":11997302,"size":46186525,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c91c306c1820594c903c2f9a1aa75a0e4b220c71&amp;dn=Sinclair+Lewis+-+Nobel+Prize+in+Literature%2C+1930+%2820+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"workerbee","files":39,"time":1433695875,"description":"\nSINCLAIR LEWIS (1885-1951) was an American novelist, short-story writer, and playwright.  In 1930, he became the first American writer to receive the Nobel Prize in Literature, which was awarded &quot;for his vigorous and graphic art of description and his ability to create, with wit and humor, new types of characters.&quot;\n\nHis works are known for their insightful and critical views of American capitalism and materialism between the wars.  He is also respected for his strong characterizations of modern working women.  H.L. Mencken wrote of him, &quot;[If] there was ever a novelist among us with an authentic call to the trade ... it is this red-haired tornado from the Minnesota wilds.&quot;\n\nHis first novel, OUR MR. WRENN (1914) is a gently satiric account of a meek New York clerk traveling in Europe.  Lewis wrote four more novels and achieved only modest success.  But MAIN STREET (1920) caused a sensation and brought him immediate fame.  The book is a withering satire on the dullness and lack of culture that exist in a &quot;typical&quot; American small town, and the narrow-mindedness and self-satisfaction of its inhabitants.\n\nBABBITT (1922) focuses even more effectively Lewis' idea of a &quot;typical&quot; small city businessman, George F. Babbitt.  The novel describes the futile attempt of its central character to break loose from the confining life of a &quot;solid American citizen&quot; -- a middle-class, middle-aged realtor, civic booster, and club joiner.  Possibly no two works of literature did more to make Americans aware of the limitations of their national life and culture than did MAIN STREET and BABBITT.\n\nWith a sharp, satiric eye and a superb gift for mimicry, Lewis continued to examine other aspects of what he considered national inadequacy.  ARROWSMITH (1925) describes the frustrations of an idealistic young doctor in conflict with corruption, jealousy, meanness, and prejudice.  The novel won the 1926 Pulitzer Prize, which Lewis declined because he felt that it was not awarded for literary merit but for the best presentation of &quot;wholesome&quot; American life.\n\nLewis closed out the decade with DODSWORTH (1929), a novel about the most affluent and successful members of American society.  He portrayed them as leading essentially pointless lives in spite of great wealth and advantages.  After winning the Nobel Prize in 1930, Lewis wrote eleven more novels.  The best remembered is IT CAN'T HAPPEN HERE (1935), a novel about the election of a fascist to the American presidency.\n\nIn addition to his major novels, this torrent includes a selection of Lewis' short stories (I'M A STRANGER HERE MYSELF) and essays (THE MAN FROM MAIN STREET), the latter of which reproduces the text of his Nobel Prize address.\n\n\nThe following books are in PDF or ePUB format as indicated:\n\n* ARROWSMITH (HarperPerennial, 2012) -- ePUB\n\n* BABBITT (Bantam Classics, 1998).  Introduction by John Wickersham. -- ePUB\n\n* BABBITT (Barnes &amp; Noble, 2005).  Introduction and Notes by Kenneth Krauss. -- ePUB\n\n* BABBITT (HarperPerennial, 2012) -- ePUB\n\n* BABBITT (Oxford World's Classics, 2010).  Edited with an Introduction and Notes by Gordon Hutner. -- PDF\n\n* BETHEL MERRIDAY (Jonathan Cape, 1940) -- PDF\n\n* DODSWORTH (HarperPerennial, 2012) -- ePUB\n\n* FREE AIR (HarperPerennial, 2012) -- ePUB\n\n* GIDEON PLANISH (Jonathan Cape, 1943) -- PDF\n\n* THE GOD-SEEKER (Popular Library, 1948) -- PDF\n\n* I'M A STRANGER HERE MYSELF &amp; OTHER STORIES (Dell, 1962).  Selected by Mark Schorer. -- PDF\n\n* IT CAN'T HAPPEN HERE (Signet, 2014).  Introduction by Michael Meyer and a New Afterword by Gary Scharnhorst. -- ePUB\n\n* MAIN STREET (Barnes &amp; Noble, 2003).  Introduction and Notes by Brooke Allen. -- ePUB\n\n* MAIN STREET (HarperPerennial, 2012) -- ePUB\n\n* MAIN STREET (Modern Library, 1999).  Introduction by Carol Kennicott. -- ePUB\n\n* THE MAN FROM MAIN STREET: Selected Essays &amp; Other Writings, 1904-1950 (Pocket Books, 1963).  Edited by Harry E. Maule and Melville H. Cane. -- PDF\n\n* OUR MR. WRENN (Grosset &amp; Dunlap, 1914) -- PDF\n\n* PREMIUM COLLECTION: 7 Novels: Our Mr. Wrenn / The Trail of the Hawk / The Job / The Innocents / Free Air / Main Street / Babbitt (Timeless Wisdom, 2014) -- ePUB\n\n* THE PRODIGAL PARENTS (Doubleday, 1934) -- PDF\n\n* WORK OF ART (Collier, 1934) -- PDF\n\n_____________________________________________________________________________\n\n\n&gt;&gt; CONTACT ME\nYou may reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\n         &lt;a href=&quot;\nhttps://pirates-forum.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/User-workerbee&lt;/a&gt;  \n\n&gt;&gt; PLEASE HELP TO SEED!\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:c91c306c1820594c903c2f9a1aa75a0e4b220c71","amp;dn":"Sinclair+Lewis+-+Nobel+Prize+in+Literature%2C+1930+%2820+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c91c306c1820594c903c2f9a1aa75a0e4b220c71","infoHashBuffer":{"type":"Buffer","data":[201,28,48,108,24,32,89,76,144,60,47,154,26,167,90,14,75,34,12,113]},"announce":[],"urlList":[]}}