{"title":"The flash seoson 1 episode 21 - Grodd lives  720p Mp4","uid":11896691,"size":1315177255,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:ca43b6013cae0ffd59e7bca0f7fb262890f6ba50&amp;dn=The+flash+seoson+1+episode+21+-+Grodd+lives++720p+Mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bakerskater23","files":2,"time":1431181469,"description":"My The flash episode 21 description\n\nHaven't seen it yet but I'm pretty sure that Eboard Thawne will continue to cause trouble, Grodd will probably kidnap Joe and some metahumans will be released. \n\n\nWikepedia's The flash episode 21 description\n\nBarry scours the city looking for Eddie, but must take a break to stop a robbery at the gold reserve. When Barry confronts the would be thief, they are both disoriented by an unknown psychological attack. Back at the lab, Barry describes the attack to Caitlin and Cisco when Iris walks in, confronting Barry about being the Flash. The thief attacks again, but Barry is able to stop him. The thief turns out to be General Eiling, who was under the mind control of the gorilla Grodd. With a lead from Iris, Barry, Joe, and Cisco head into the sewers to look for Grodd. The trio realize that Grodd is getting smarter and larger, and during an attack Barry is knocked unconscious while Joe is kidnapped by Grodd. Cisco and Caitlin build Barry a device that will prevent Grodd from attacking him psychically. It works, but Grodd is too powerful and during a fight the device is damaged. Barry is able to fight off Grodd's psychic attack and trick him into jumping in front of an on-coming train. Elsewhere, Wells works on a device that will allow him to return to his time","torrent":{"xt":"urn:btih:ca43b6013cae0ffd59e7bca0f7fb262890f6ba50","amp;dn":"The+flash+seoson+1+episode+21+-+Grodd+lives++720p+Mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca43b6013cae0ffd59e7bca0f7fb262890f6ba50","infoHashBuffer":{"type":"Buffer","data":[202,67,182,1,60,174,15,253,89,231,188,160,247,251,38,40,144,246,186,80]},"announce":[],"urlList":[]}}