{"title":"The Last Days of . . . . (Channel 5 - 2015 - Complete Series)","uid":11961284,"size":2940417482,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cb1d093e8a49c72407c777492b276264ab47ab10&amp;dn=The+Last+Days+of+.+.+.+.+%28Channel+5+-+2015+-+Complete+Series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"davieboy1966","files":9,"time":1432562936,"description":"TV : Documentary : TV quality : English\n\n\nThe Last Days of... S01E01 (9 April 2015) [mp4]\n\nChannel: Channel 5\nDate: 9 April 2015\nTime: 20:00 to 21:00\n\n&quot;Episode 1: Mary Queen of Scots&quot;\nWriters, thinkers and historians explore the downfall and legacy of six giants of history. In this episode, John Guy, Kate Williams, Robert Hutchinson and others battle out the legacy of Britain's most tragic queen. Was Mary Queen of Scots, brutally beheaded at only 44, a victim of her cousin Elizabeth's treachery, or the author of her own destruction?\n\n\n\n\nThe Last Days of... S01E02 (16 April 2015) [mp4]\n\nChannel: Channel 5\nDate: 16 April 2015\nTime: 20:00 to 21:00\n\n&quot;Episode 2: Rasputin&quot;\nWriters, thinkers and historians explore the downfall and legacy of Rasputin, the Siberian peasant who rose from obscurity to the pinnacle of power in Tsarist Russia. Was he motivated by sex addiction? Or was he a seer who only wanted the best for Russia? Historian Helen Rappaport and academic Dominic Lieven are among contributors who discuss the true legacy of this remarkable and mysterious figure.\n\n\n\n\nThe Last Days of... S01E03 (23 April 2015) [mp4]\n\nChannel: Channel 5\nDate: 23 April 2015\nTime: 20:00 to 21:00\n\n&quot;Episode 3: Charles I&quot;\nWriters, thinkers and historians explore the downfall and legacy of six giants of history. Writer and actor Mark Gatiss, academic Hannah Dawson and human rights barrister Geoffrey Robertson are among those debating the life and death of Charles I. Was he a noble royal martyr, prepared to lose his life for God and country, or a vain and deluded man who could not save himself?\n\n\n\n\nThe Last Days of... S01E04 (7 May 2015) [mp4]\n\nChannel: Channel 5\nDate: 7 May 2015\nTime: 20:00 to 21:00\n\n&quot;Episode 4: Jesus Christ&quot;\nA cast of writers, thinkers and historians explore the downfall and legacy of six giants of history, to re-tell the stories that seem so familiar, but are packed with unexpected twists and turns. In this episode, was Jesus crucified because it was ordained? Or because he was a religious radical and a threat to Roman rule? Bishop Tom Wright and award-winning writer Naomi Alderman examine the evidence and reveal their interpretations of the real man behind the most powerful story on earth.\n\n\n\n\nThe Last Days of... S01E05 (14 May 2015) [mp4]\n\nChannel: Channel 5\nDate: 14 May 2015\nTime: 20:00 to 21:00\n\n&quot;Episode 5: Guy Fawkes&quot;\nDocumentary series in which an expert panel of novelists and historians debate well-known events and people in history. Was the Gunpowder Plot of 1605 a spectacular act of rebellion, or a fanatical act of terrorism? Retelling the last days in the life of Guy Fawkes, counter-extremism expert Haras Rafiq, Alice Hogge and Ronald Hutton make the case for and against the man whose actions continue to set the country ablaze every year over 400 years after his death.\n\n\n\n\nThe Last Days of... S01E06 (21 May 2015) [mp4]\n\nChannel: Channel 5\nDate: 21 May 2015\nTime: 20:00 to 21:00\n\n&quot;Episode 6: The Murder of Julius Caesar&quot;\nMore than 2,000 years after the event, the assassination of Roman dictator Julius Caesar still fascinates like no other act of political violence. Novelist Robert Harris, historian Neil Faulkner and classicist Maria Wyke are among the experts examining whether it was the necessary execution of a tyrant who would stop at nothing in his pursuit of power, or a cowardly murder. Last in the series.\n\n\n\n\n\nand as a Bonus from the BBC in 2013 (including a terrible dating error which is repeated no less than 4 times!)\n\nThe Last Days of Anne Boleyn - BBC2\n\n\nAnne Boleyn is one of the most famous and controversial women in British history. In 1536, she became the first queen in Britain's history to be executed. The brutal speed of her downfall, and the astonishing nature of the charges against her - treason, adultery, even incest - makes her story shocking even to this day.\n\nYet whilst we know how Anne died, the story of why she had to go and who authored her violent end has been the subject of fiery debate across six centuries. In a radical new approach to televised history, a stellar cast of writers and historians, including Hilary Mantel, David Starkey, Philippa Gregory and others, battle out the story of her last days and give their own unique interpretations of her destruction.\n\nPart of the BBC's Tudor Court Season\n\nHDTV&gt;AVCx264\nFilesize......: 202Mb\nRuntime.......: 00:58:55\nVideo Codec...: AVC\nVideo Bitrate.: 478Kbps\nFrame Size....: 720x404\nFrame Rate....: 25fps\nAudio Codec...: AAC\nAudio Bitrate.: 128Kbps\nAudio Freq....: 48KHz\nAudio Channels: Stereo\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:cb1d093e8a49c72407c777492b276264ab47ab10","amp;dn":"The+Last+Days+of+.+.+.+.+%28Channel+5+-+2015+-+Complete+Series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb1d093e8a49c72407c777492b276264ab47ab10","infoHashBuffer":{"type":"Buffer","data":[203,29,9,62,138,73,199,36,7,199,119,73,43,39,98,100,171,71,171,16]},"announce":[],"urlList":[]}}