{"title":"Without a Trace - Lesley Pearse","uid":11962317,"size":592796,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cb78ffc05cffcd5824c5279aead0d1799f681149&amp;dn=Without+a+Trace+-+Lesley+Pearse&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1432585023,"description":"International number one bestselling author Lesley Pearse brings a compelling story of courage, friendship and love in her brand new novel Without a Trace.\n\nCoronation Day, 1953.\n\nIn the Somerset village of Sawbridge, young shopkeeper Molly Heywood slips away from the celebrations to her friend's cottage and makes a shocking discovery: Cassie is dead and her six-year-old daughter Petal has vanished without a trace.\n\nIn her grief, Molly seeks help from her childhood friend George, now the village policeman, but no one can find Petal. The only clue is a letter from London, where Cassie once lived. Despite George's reluctance and her growing feelings for him, Molly resolves to go to London in the hope of discovering the missing child.\n\nArriving in the big city, Molly quickly learns it's a dangerous place for a country girl on her own. But there's hope too - in the Blitz-ruined East End, she unexpectedly finds friendship with strangers from Cassie's past and, with handsome, mysterious workman Charley, the possibility of something more.However, the closer Molly gets to the truth, the more perilous her journey becomes. She has given up everything - her home, happiness and a chance at love - all to find Petal. But is she also risking her life?\n\nFrom the number one UK bestselling author Lesley Pearse comes Without a Trace, a gripping story of bravery, secrets and love.\n\nPraise for Without a Trace\n\n'Epic romantic drama set in post-war London' Heat Magazine\n\n'A heart-warming and evocative tale that is a real delight to read' Sun\n\n'A narrative that gallops along, this is quintessential Pearse that will delight her army of readers' Daily Mail\n\n'Must have' Sunday Express","torrent":{"xt":"urn:btih:cb78ffc05cffcd5824c5279aead0d1799f681149","amp;dn":"Without+a+Trace+-+Lesley+Pearse","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb78ffc05cffcd5824c5279aead0d1799f681149","infoHashBuffer":{"type":"Buffer","data":[203,120,255,192,92,255,205,88,36,197,39,154,234,208,209,121,159,104,17,73]},"announce":[],"urlList":[]}}