{"title":"The Dead And The Gone","uid":11887351,"size":192659,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cbd8cf77e11a3d2e0881b1f84fbded3e0902b9d1&amp;dn=The+Dead+And+The+Gone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sucres","files":1,"time":1430874014,"description":"Hey, this is my first file.\nRemember to seed :D\nThis is the Book The Dead &amp; The Gone by Susan Beth Pfeffer\n-------------------------------------------------------------------------------------\nThe Dead and the Gone is a young adult science fiction dystopian novel by Susan Beth Pfeffer. Released in hardcover in May 2008, it is the second book in The Last Survivors, following Life as We Knew It and preceding This World We Live In.\n-------------------------------------------------------------------------------------\n&quot;The Dead and the Gone&quot; is a dark and frightening tale about the Earth following a catastrophe that leaves the world torn and society fragmented. It is a story of faith, hope, desperation, and sacrifice that follows one family, the Morales, through their trials and tribulations. They are led through the chaos by Alex Morales, a seventeen-year-old young man who discovers through the novel that he is stronger than he realized, and that his faith, along with his family, can survive.\n\n&quot;The Dead and the Gone&quot; is the story of the Morales family's struggles following the catastrophic asteroid collision with the moon that causes massive flooding, tsunami's, earthquakes, volcanoes, and other natural disasters that leave the world completely unstable. Alex Morales is seventeen years old when the disaster happens and his mother and father are both gone at the time of the event and continue to be missing throughout the novel. Alex has two younger sisters, religious fourteen-year-old Briana, and spoiled twelve-year-old Julie, who become his wards. All three siblings are religious, but Briana takes her faith to a new level as she aspires to become a nun. Julie, on the other hand, begins the novel as a bratty child who cares little for others. Alex believes strongly in God, but struggles as his world continues to collapse around him. Through the course of the novel, Alex learns to fend for his family by any means, including stealing from the ever increasing dead with his new friend, Kevin Daley. The items they steal are sold to Harvey, a black market profiteer, in exchange for food and other items necessary to survive.\n\nWhen Brianna is sent to a convent farm in the country, Alex and Julie are left to fend for themselves and learn to live with one another in harmony. Julie slowly begins to understand serving the family, and Alex feels tenderness for his sister. But when volcanic ash begins to cover the sun and fill the air, Brianna returns, having developed severe asthma. Alex is again forced to care for three, which now includes an ill sister. Using Kevin's resources combined with his own and those of his wealthy friends, Alex is able to manage for a period of time. When Kevin is killed and Brianna dies after being trapped in an elevator, Alex is near his end. However, as Alex finds throughout the novel, when he turns to his faith and the church, there is hope as Father Mulrooney and Sister Rita devise a plan to carry both Alex and Julie to safety. While &quot;The Dead and the Gone&quot; is not a happy novel, it is a novel about the power of family, faith, friendships, and courage. It is a lesson in humility as well as thankfulness for one's life, regardless of circumstances","torrent":{"xt":"urn:btih:cbd8cf77e11a3d2e0881b1f84fbded3e0902b9d1","amp;dn":"The+Dead+And+The+Gone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbd8cf77e11a3d2e0881b1f84fbded3e0902b9d1","infoHashBuffer":{"type":"Buffer","data":[203,216,207,119,225,26,61,46,8,129,177,248,79,189,237,62,9,2,185,209]},"announce":[],"urlList":[]}}