{"title":"Million Dollar Mermaid (1952) DVD5 - Esther Williams, Victor Mat","uid":10712146,"size":5441228800,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ce651f8b3aefb8af205943f65cbfb8f071a72c7e&amp;dn=Million+Dollar+Mermaid+%281952%29+DVD5+-+Esther+Williams%2C+Victor+Mat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"SaM","files":-1,"time":1407373413,"description":"Million Dollar Mermaid (1952) DVD5 - Esther Williams, Victor Mature [DDR]\n\nMillion Dollar Mermaid (also known as The One Piece Bathing Suit in the UK) is a 1952 Metro-Goldwyn-Mayer biographical musical film of the life of Australian swimming star Annette Kellerman. It was directed by Mervyn LeRoy and produced by Arthur Hornblow Jr. from a screenplay by Everett Freeman. The music score was by Adolph Deutsch, the cinematography by George J. Folsey and the choreography by Busby Berkeley.\nGeorge J. Folsey received a 1953 Oscar nomination for Best Cinematography, Color.\nThe film stars Esther Williams, Victor Mature, and Walter Pidgeon, with David Brian and Donna Corcoran.\n\n    CAST:-\n    Esther Williams as Annette Kellerman\n    Victor Mature as James Sullivan\n    Walter Pidgeon as Frederick Kellerman\n    David Brian as Alfred Harper\n    Donna Corcoran as Annette Kellerman at age 10\n    Jesse White as Doc Cronnol\n    Maria Tallchief as Pavlova\n\nDirected by Mervyn LeRoy\nProduced by Arthur Hornblow, Jr.\nWritten by Everett Freeman\nMusic by Alexander Courage (orchestrator)\nRunning time 115 minutes\n\nMOVIE REVIEW:-\nIn the late 19th Century, a polio-stricken Australian girl, Annette Kellerman (Esther Williams), swims as a means to improve her health. Her father, Frederick (Walter Pidgeon), who owns a music conservatory, accepts a teaching position in England.\nAboard ship, Annette encounters the American promoter James Sullivan (Victor Mature) and his associate Doc Cronnol (Jesse White), who are taking a boxing kangaroo called Sidney with them to London.\nThe teaching position falls through and Jimmy suggests promoting Annette in a six-mile swim to Greenwich. She volunteers to make it 26 miles instead. Word spreads of the swim and Annette's feat makes news.\nJimmy suggests they can make a fortune by going to New York and appearing in Alfred Harper's (David Brian) water ballet at the Hippodrome. They are not offered a job in the show, so Annette goes to Boston for a highly publicized swim and gets in hot water for wearing a one-piece suit too revealing for its time.\nShe and Jimmy have a misunderstanding and part ways. Harper has a change of heart and makes Annette headliner of his New York show. Lonely after the death of her father, Annette goes to Florida at the behest of Doc to try to dissuade Jimmy from flying in an air race with a $50,000 prize. It does not go well.\nAs time passes, Harper falls in love with Annette while she travels to Hollywood to make a film. Jimmy and Doc turn up, this time promoting a dog called Rin Tin Tin that they hope to star in the movies.\nA water tank bursts during the making of Annette's film, causing her serious injury, Spinal Hematoma. With her future in doubt, Harper steps aside when he sees for himself how much Annette and Jimmy are in love.\n&quot;Million Dollar Mermaid&quot; not only became Esther Williams' nickname around Hollywood, but it became the title of her autobiography (New York: Simon and Schuster, 1999), co-written with Digby Diehl. Williams has often called this her favorite film. \n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4514 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec:  AC3\nAudio Bitrate: 448kb/s CBR 48000 Hz\nAudio Streams: 6\nAudio Languages: English\nRunTime: 115 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]   \nDuration: 115 mins","torrent":{"xt":"urn:btih:ce651f8b3aefb8af205943f65cbfb8f071a72c7e","amp;dn":"Million+Dollar+Mermaid+%281952%29+DVD5+-+Esther+Williams%2C+Victor+Mat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce651f8b3aefb8af205943f65cbfb8f071a72c7e","infoHashBuffer":{"type":"Buffer","data":[206,101,31,139,58,239,184,175,32,89,67,246,92,191,184,240,113,167,44,126]},"announce":[],"urlList":[]}}