{"title":"Samurai and Ninja: The Real Story Behind the Japanese (2015)","uid":12055295,"size":1852685,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ce952d22f720833d77c36423f5f7c767a0f2d72b&amp;dn=Samurai+and+Ninja%3A+The+Real+Story+Behind+the+Japanese+%282015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bookzilla","files":1,"time":1435107213,"description":"Samurai and Ninja: The Real Story Behind the Japanese Warrior Myth That Shatters the Bushido Mystique\n\nepub\n\n\n The myths of the noble Samurai and the sinister Ninja are filled with romantic fantasy and fallacy. Samurai and Ninja expert Antony Cummins shatters the myths and exposes the true nature of these very real and very lethal medieval Japanese warriors. The Samurai and Ninja were in fact brutal killing machines trained in torture and soaked in machismo. Many were skilled horsemen and sword-fighting specialists, while others were masters of subterfuge and sabotage. Some fought for loyalty, others for personal gain. What these warriors all shared in common was their unflinching personal bravery, skill and brutality. In Samurai and Ninja, Cummins separates myth from reality and shows why the Japanese were the greatest warriors of all time: He describes the Samurai and the Ninja as they really were in earlier times when battles raged across Japan not in later times when war became obsolete and Japanese warriors became philosophers, scholars and courtiers. He describes the social context of the day and the feudal world into which the warriors were trained to fight and die for their lords. He exposes the essentially brutal nature of warfare in medieval Japan. This book is illuminated by many rare Japanese manuscripts and texts which are translated into English for the very first time","torrent":{"xt":"urn:btih:ce952d22f720833d77c36423f5f7c767a0f2d72b","amp;dn":"Samurai+and+Ninja%3A+The+Real+Story+Behind+the+Japanese+%282015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce952d22f720833d77c36423f5f7c767a0f2d72b","infoHashBuffer":{"type":"Buffer","data":[206,149,45,34,247,32,131,61,119,195,100,35,245,247,199,103,160,242,215,43]},"announce":[],"urlList":[]}}