{"title":"Napoleon.2015.s01e01.ENG.SUBS.WEBRIP","uid":12008790,"size":666802212,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d03f07ba0e8c6b3ee094077498c108ada596c1c9&amp;dn=Napoleon.2015.s01e01.ENG.SUBS.WEBRIP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":4,"time":1434045358,"description":"Napoleon.2015.s01e01.ENG.SUBS.WEBRIP\n\nFormat: MPEG-4\nSize: 832x468\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\nThe first of three documentaries telling the story of Napoleon. With access to a unique archive of Napoleon's personal letters, many of which have never been published before, historian Andrew Roberts journeys through the history and geography of Europe to bring this story vividly to life as he retraces the footsteps of the legendary leader himself. The films shed new light on Napoleon as an extraordinarily gifted military commander, a mesmeric leader whose private life was, contrary to popular belief, littered with disappointments and betrayals.\n\nFrom lowly Corsican Army officer to first consul of France, this episode charts the rise of Napoleon Bonaparte to leader of the French nation in the late 1790s. It tells of Napoleon's military triumphs in Italy, Eqypt and against anti-revolutionaries on the streets of Paris, his marriage to Josephine Beauharnais and leadership of the military coup of 1799 that swept him into power.\n\nIt shares in his ambition as an army officer and his highly progressive modernisation of the country during the early years of his dictatorship, but then also an acute sensitivity in the man, a personality trait that in later years would prove to be an Achilles heel to his power.\n\nThe film is presented by British historian Andrew Roberts, and shot on location in St Helena, France and Italy","torrent":{"xt":"urn:btih:d03f07ba0e8c6b3ee094077498c108ada596c1c9","amp;dn":"Napoleon.2015.s01e01.ENG.SUBS.WEBRIP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d03f07ba0e8c6b3ee094077498c108ada596c1c9","infoHashBuffer":{"type":"Buffer","data":[208,63,7,186,14,140,107,62,224,148,7,116,152,193,8,173,165,150,193,201]},"announce":[],"urlList":[]}}