{"title":"HISTORY OF POP AND ROCK MUSIC - part 584","uid":12113806,"size":373557220,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d0b1b48e779358ed1cde4c407fbfcae9eb3afb4a&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+584&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pupovaczlatko","files":8,"time":1436637571,"description":"\n\n\n                                  PART  584\n\n\n                     NORAH JONES  -   Don't Know Why  (2002) \n                     NORAH JONES  -   Sunrise   (2004)\n                     NORAH JONES  -   What Am I To You   (2004)\n\n\n\n                     &quot;Don't Know Why&quot; is a song written by Jesse Harris which originally appeared on his 1999 album, &quot;Jesse Harris &amp; the Ferdinandos&quot; . It was the second single by American singer-songwriter Norah Jones from her debut studio album &quot;Come Away with Me&quot;  (2002). Although Jones's version only peaked at number thirty on the U.S. Billboard Hot 100, it was a critical success for her that helped establish her as a respected new artist, and subsequently her album sold extremely well. The single went on to win three Grammy Awards in 2003 for Record of the Year, Song of the Year, and Best Female Pop Vocal Performance. It remains Jones's biggest hit single in the United States to date, and her only one to reach the Top 40 of the Billboard Hot 100. The single was also a hit internationally and reached Top 10 in several countries. The song charted at 459 in Blender magazine's 500 Greatest Songs Since You Were Born.\n\n                  &quot;Sunrise&quot; is the first single of Norah Jones' multi-platinum album &quot;Feels like Home&quot;. It reached #4 in Canada and #30 in the United Kingdom. Despite failing to chart on the Hot 100, the single was certified gold by the RIAA for sales of 500,000 copies. The song won Best Female Pop Vocal Performance at the 2005 Grammy Awards. In the same year, it was featured in Because of Winn-Dixie and on the compilation album Now That's What I Call Music! 15.\n\n                 &quot;What Am I to You?&quot; is the second single from &quot;Feels like Home&quot; from Norah Jones.The song is a country song and is the second track on her album. The song features The Band musicians Levon Helm on drums and Garth Hudson on the organ. It originally appeared as a Japanese bonus track on her previous album","torrent":{"xt":"urn:btih:d0b1b48e779358ed1cde4c407fbfcae9eb3afb4a","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+584","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0b1b48e779358ed1cde4c407fbfcae9eb3afb4a","infoHashBuffer":{"type":"Buffer","data":[208,177,180,142,119,147,88,237,28,222,76,64,127,191,202,233,235,58,251,74]},"announce":[],"urlList":[]}}