{"title":"Attraction to Seduction","uid":12045741,"size":398237,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d288ec1e836f9cd31bb0640d5411651e9b9bbec0&amp;dn=Attraction+to+Seduction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1434894234,"description":"I am sharing with you the secrets that\nwomen do NOT what you to know, why? Because with the insights,\ntechniques, methods and skills that I am handing you in a step by step\nand detailed format, you will be attracting women into your bed whom you\ninitially thought would never sleep with you.\nNo cheesy pick up lines\nNo gimmicky pick up artist tricks\nNo vague advice\nNo generic tips\n\nPowerful techniques that will make women lust after you\nHonest insights in to what women want\nThe secrets that will turn her on\nThe insight into the female mind\nThe ability to deal with any negative reactions and turn them around to a positive result\nMyth busting! I will expose the garbage you have been hearing for years and give you the truth you need on how to seduce women\nThe skills to get out of the friend zone\nHow to overcome her last minute doubts\nThe methods that will make her want to sleep with you the SAME NIGHT.\nThe knowledge that will FREE YOU FROM ENDING UP AS THE NICE GUY.\n\nSince\nmy last DVD set was released back in 2011 (The 10 hook lead system)\nwhich focuses primarily on building up conversations with women and\ngaining their interest and both emotional and psychological investment, I\nhave been literally inundated with emails asking me to create a set of\nDVDs which focus ONLY on attraction,seduction and sexual escalation.\n\nSo why did it take me so long?\n\nWell,\nthe truth is, I wanted to cram as much valuable information and\nmaterial in these new DVDs as possible,and I also wanted to perfect each\nskill and technique before revealing it!\nThe other reason for why I\ndelayed the development of these DVDs, was because I knew that the\nAttraction to Seduction DVDs would require my full commitment, and that\nwould mean I had to be 100 percent transparent and totally honest about\nextremely personal experiences and insights.\n\nAlthough I am a\nconfident woman and value my honesty intensely, revealing such detailed\ninsights and experiences of a sexual nature was at times difficult, but I\nmade the decision to go ahead and REVEAL ALL in order to really help\nyou get results with women.\n\nI showed parts of these DVDs to\nwomen, before releasing them, and every single on of those women,\nadmitted that what I was sharing was both practical and effective, and\nmade total sense to them!\n\nAll of the techniques and skills which\nare contained in these DVDs have been tried and tested, and I have total\nconfidence in all them, and I know, they will help you as they have\nhelped others, increasing your success rate with women!","torrent":{"xt":"urn:btih:d288ec1e836f9cd31bb0640d5411651e9b9bbec0","amp;dn":"Attraction+to+Seduction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d288ec1e836f9cd31bb0640d5411651e9b9bbec0","infoHashBuffer":{"type":"Buffer","data":[210,136,236,30,131,111,156,211,27,176,100,13,84,17,101,30,155,155,190,192]},"announce":[],"urlList":[]}}