{"title":"The.Bank.A.Matter.of.Life.and.Debt.s01e01.ENG.SUBS.WEBRIP","uid":12059167,"size":666760194,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d296f2de81c459f3b33eb04d6136d72f4bbe662f&amp;dn=The.Bank.A.Matter.of.Life.and.Debt.s01e01.ENG.SUBS.WEBRIP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":4,"time":1435199137,"description":"The.Bank.A.Matter.of.Life.and.Debt.s01e01.ENG.SUBS.WEBRIP\n\nFormat: MPEG-4\nSize: 832x468\nDisplayAspectRatio: 16:9\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\nArmed with boundless enthusiasm and some inspiration from Walt Disney, deputy bank manager Claire has got 12 weeks to improve the customer service score at NatWest in Huddersfield.\n\nThe first episode of this series - with unique, behind-the-scenes access to a high street bank and its customers - looks at NatWest's bid to win back its customers' trust.\n\nClare and her straight-talking team are desperate to succeed, but it is not going to be easy. Since the 2008 banking crash, faith in banks has slumped to an all-time low and some customers are quick to anger when it comes to banks. NatWest is owned by RBS, which was bailed out by the government and is still 79 per cent owned by the taxpayer.\n\nOne customer, Alan, is livid. He says a cheque has gone missing and he has missed out on a precious eBay auction. Chris feels that he has been given bad advice on a mortgage. With weekly automated phone calls, asking customers how satisfied they are, staff are under pressure to get it right.\n\nClaire and her team admit that the banks have got it wrong, but they say customers have to take responsibility too. Tracey is thousands of pounds in debt and facing repossession of her home. There is not much the bank can do to help. Sarah Iqbal sells life insurance at NatWest, but her father is the last person you would see in the bank. He has built his whole life around being super-frugal and avoiding debt.\n\nCan Claire and her team persuade the people of Huddersfield that NatWest is putting the customer first? And is it fair for customers to point the finger at the bank every time? What does the relationship between us and the bank tell us about us and our thorny relationship with money?\n\n[img]https://yuq.me/users/44/769/UG3Pi5ryI8.png[/img]\n\n[img]https://yuq.me/users/44/769/XrDgOBYePx.jpg[/img]","torrent":{"xt":"urn:btih:d296f2de81c459f3b33eb04d6136d72f4bbe662f","amp;dn":"The.Bank.A.Matter.of.Life.and.Debt.s01e01.ENG.SUBS.WEBRIP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d296f2de81c459f3b33eb04d6136d72f4bbe662f","infoHashBuffer":{"type":"Buffer","data":[210,150,242,222,129,196,89,243,179,62,176,77,97,54,215,47,75,190,102,47]},"announce":[],"urlList":[]}}