{"title":"Fred Neil-Sessions; audiophile vinyl rip, SME30 turntable","uid":12313920,"size":307614916,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d2f26aa7a0551db85e51f6b6b071f70954f3f460&amp;dn=Fred+Neil-Sessions%3B+audiophile+vinyl+rip%2C+SME30+turntable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rontoolsie","files":9,"time":1440956775,"description":"Listening to this, I wonder if Fred Neil knew these &quot;sessions&quot; were going to be released. If he didn't, that makes the album that much more impressive. If he did, I wonder why so much studio dialogue was left in the final cut.\n\nAs for the music, well, damn, the first three songs are gold. &quot;Felicity,&quot; is a concise, beautiful introduction to the album. &quot;Please Send Me Someone to Love&quot; is a definitive Fred Neil song. His baritone is one of the finest voices ever captured in a record groove, and Fred's twelve-string offers it the perfect companion. &quot;Merry-Go-Round,&quot; a sort of take on a Langston Hughes poem, is another vocal masterpiece, and contains excellent lyrics. \n\nThen the acoustic jamming starts. Some of the rhythms (and counter-rhythms) are pretty incredible; the musicianship, lively, as well as the singing, as always. But perhaps it is the substance of the songs that diminishes as the album kind of awkwardly shuffles towards its conclusion, a passionate song called &quot;Roll On Rosie.&quot; Whatever it is, it's not a huge deal; Sessions is still a rather good album.\n\nOne of Fred's most well-known songs is &quot;The Dolphins&quot; from Fred Neil. It was semi-famously covered by Tim Buckley shortly before his death. Interesting because, I think the two men share that experimental style of singing. Of course, Tim has a very high voice and Fred's is very low, but stylistically, they are very similar. I also hear tinges of The Allman Brothers Band in here. In fact, &quot;Looks Like Rain&quot; sounds like it could have been the basis for &quot;Revival,&quot; &quot;Black-Hearted Woman,&quot; or even &quot;Whipping Post,&quot; with its fairly uncertain meter. The Allmans derived many of their jams and riffs from pre-existing works, after all, and not just generic blues numbers either; they drew plenty from their contemporaries as well (eg., &quot;Mountain Jam,&quot; a take on Donovan's &quot;There Is a Mountain&quot;).\n\nI respect Fred Neil as a singer, songwriter, song interpreter, and guitarist, not to mention as a fearless experimenter. He's got the complete package, being an adept example of each--few artists can claim that. Sessions is by no means a perfect album, but it is possibly a perfect exhibition of Fred Neil's music.\n\nThe above was from a review I read, and came close enough to my own sentiments for me to use it here. \n\nThe LP was transcribed using the SME30 turntable, a Graham 2.2 tonearm, a Jan Allaerts cartridge and a $15,000 custom tube phono stage","torrent":{"xt":"urn:btih:d2f26aa7a0551db85e51f6b6b071f70954f3f460","amp;dn":"Fred+Neil-Sessions%3B+audiophile+vinyl+rip%2C+SME30+turntable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2f26aa7a0551db85e51f6b6b071f70954f3f460","infoHashBuffer":{"type":"Buffer","data":[210,242,106,167,160,85,29,184,94,81,246,182,176,113,247,9,84,243,244,96]},"announce":[],"urlList":[]}}