{"title":"Pete Rock - Petestrumentals 2 (2015)","uid":12058908,"size":141798475,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d340b3166a3284f6a0f56cf0d92a86144d539dd3&amp;dn=Pete+Rock+-+Petestrumentals+2+%282015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"daboyz1","files":21,"time":1435189808,"description":"Pete Rock\nPetestrumentals 2\n(2015)\n\n\nThis is dedicated to all the fans of true hip hop music. If you know who Pete Rock is, you probably already know what good hip hop is. If you are listening to iggy azalea, minaj, and lil' (dick) wayne, pull your head out of you ass and start learning about who the REAL artists are. The duo of Pete Rock &amp; CL Smooth are one of them!\n-The G-Unit\n\nIt's been almost 15 years since Pete Rock released the original Petestrumentals album on back in 2001, and listening to this long-gestating follow-up, it would appear that not a whole lot has changed in the interim. That's not to discount the potency or worthiness of the project, but as one of the best hip-hop producers of all time, Pete Rock not only stayed in his lane, he'd already dug it up and paved it himself; he's entitled to stay in it.\nBut while his source material is firmly rooted in the past, Petestrumentals 2 makes a couple of more contemporary statements. &quot;Dilla Bounce (R.I.P.)&quot; pays tribute to the late J Dilla, who was a clear sonic descendant of Rock's, nodding to his off-beat approach, and the 34-second interlude &quot;Justice (Brotherhood &amp; Understanding)&quot; uses archival dialogue to make a sobering commentary that could be applied to today's headlines, reaffirming that Pete Rock still has something to say","torrent":{"xt":"urn:btih:d340b3166a3284f6a0f56cf0d92a86144d539dd3","amp;dn":"Pete+Rock+-+Petestrumentals+2+%282015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d340b3166a3284f6a0f56cf0d92a86144d539dd3","infoHashBuffer":{"type":"Buffer","data":[211,64,179,22,106,50,132,246,160,245,108,240,217,42,134,20,77,83,157,211]},"announce":[],"urlList":[]}}