{"title":"Alien Boy: The Life and Death of James Chasse","uid":12085786,"size":524868475,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d359a0ccb9c49e177c6bab6d530658820a8a9e9e&amp;dn=Alien+Boy%3A+The+Life+and+Death+of+James+Chasse&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ptldx","files":2,"time":1435898460,"description":"In 2006 James Chasse was apprehended by three law enforcement officers in downtown Portland, Oregon in broad daylight. A dozen eyewitnesses watched in horror as the officers punched, kicked and tazed James repeatedly, then casually drank coffee with paramedics as he lay crumpled on the pavement with 16 broken ribs and a punctured lung. James had not committed a crime, so why did the officers attack him?\n\nWho was James Chasse? The officers told witnesses James was a drug dealer, a homeless person, a non-person, a ghost. But that wasnt true at all. James was an artist and a poet and a musician; he had a home and a family and friends who loved him. He was a small, shy, gentle person who had been living with schizophrenia for most of his life.\n\nParamedics at the scene signed off on James injuries, even as he begged for help, but when the officers took him to jail, nurses refused to admit him due to the severity of his injuries. He died en route to the hospital with his hands cuffed behind his back and a bag over his head, slumped in the back seat of a police car.\n\nAlien Boy: The Life and Death of James Chasse is a feature length documentary film about one mans struggle with schizophrenia and the extraordinary brutality that ended his life. It is the story of a city in denial that was forced to face the truth and learn, grow and change as a result. Alien Boy explores issues of impunity, police brutality, and mental illness.\n\nThere are people like James in every city in every country in the world who deserve to live without being marginalized, brutalized and forgotten. Perhaps Alien Boy will help the world take one more step toward understanding, tolerance and peace","torrent":{"xt":"urn:btih:d359a0ccb9c49e177c6bab6d530658820a8a9e9e","amp;dn":"Alien+Boy%3A+The+Life+and+Death+of+James+Chasse","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d359a0ccb9c49e177c6bab6d530658820a8a9e9e","infoHashBuffer":{"type":"Buffer","data":[211,89,160,204,185,196,158,23,124,107,171,109,83,6,88,130,10,138,158,158]},"announce":[],"urlList":[]}}