{"title":"Micro &amp; Nano-Engineering of Fuel Cells (CRC, 2015)","uid":12010939,"size":128236062,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d3f9812869c78dab08e2e1a1f60dac9de0359d9c&amp;dn=Micro+%26amp%3B+Nano-Engineering+of+Fuel+Cells+%28CRC%2C+2015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1434115215,"description":"ISBN 9780415644396\n\nFuel cells are clean and efficient energy conversion devices expected to be the next generation power source. During more than 17 decades of research and development, various types of fuel cells have been developed with a view to meet the different energy demands and application requirements. Scientists have devoted a great deal of time and effort to the development and commercialization of fuel cells important for our daily lives. However, abundant issues, ranging from mechanistic study to system integration, still need to be figured out before massive applications can be used. Miniaturization is one of the main bottlenecks for the advancement and further development of fuel cells. Thus, research on miniaturization of fuel cells as well as understanding the micro and nano structural effect on fuel cell performance are necessary and of great interest to solve the challenges ahead.\n\nIn this book, internationally acclaimed experts illustrate how micro &amp; nano engineering technology can be applied as a way of removing the restrictions presently faced by fuel cells both technically and theoretically. Through the twelve well designed chapters, major issues related to the miniaturization of different types of fuel cells are addressed. Theory focusing on micro and nano scale mechanics are outlined to better optimize the performance of fuel cells from laboratory scale to industrial scale. This book will be a good reference to those scientists and researchers interested in developing fuel cells through micro and nano scale engineering","torrent":{"xt":"urn:btih:d3f9812869c78dab08e2e1a1f60dac9de0359d9c","amp;dn":"Micro+%26amp%3B+Nano-Engineering+of+Fuel+Cells+%28CRC%2C+2015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3f9812869c78dab08e2e1a1f60dac9de0359d9c","infoHashBuffer":{"type":"Buffer","data":[211,249,129,40,105,199,141,171,8,226,225,161,246,13,172,157,224,53,157,156]},"announce":[],"urlList":[]}}