{"title":"Power Series with Triple H Workout","uid":12074881,"size":1113418152,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:d43e8a4423d14b8b946af706ea1bf42af30fa831&amp;dn=Power+Series+with+Triple+H+Workout&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MrTVGuy","files":8,"time":1435612036,"description":"Power Series with Triple H Workout System\n\nIf you're looking for a workout system to obliterate fat, and build ripped, rock-hard muscle then you've met your match! Enter center ring and join WWE champion and Superstar legend Triple H for a total-body challenge that will change your life. Created by world-renowned strength coach Joe DeFranco, this powerful system includes upper-body, lower-body, cardio, and mobility workouts, as well as a 4-week calendar, to maximize strength, endurance, flexibility, and function with raw, no-nonsense exercises. Rumble with the best and build a chiseled body fit for the fight.\n\nWarm-up (6 min): Power up and prepare to sweat in the elite WWE Performance Center with moves like seal jacks and Cossack stretches to prevent injury and improve performance.\n\nUpper Body 1 (16 min): Pound out power circuits of serious strength moves like dumbbell rows and Zot curls that use progressive reps to shed inches and lay down Superstar muscle.\n\nUpper Body 2 (18 min): Develop muscle endurance with functional bodyweight and dumbbell exercises like high-tension planks and shoulder shockers to build both stamina and mega muscle.\n\nLower Body (30 min): Experience muscle-mass mania with killer moves like single-leg Romanian dead lifts to improve balance, function, and strength with this intense three-set system.\n\nMuscle-Building Cardio (12 min): Give those extra pounds a serious smack down with four high-octane rounds of this cardio-strength circuit designed to pump the heart, shed fat, and carve lean muscle.\n\nMobility (14 min): Improve flexibility, reduce soreness, and recover from workouts faster with DeFranco's signature Agile 8 series of stretches and mobility drills.\n\nYou will need sets of dumbbells that range from light to heavy","torrent":{"xt":"urn:btih:d43e8a4423d14b8b946af706ea1bf42af30fa831","amp;dn":"Power+Series+with+Triple+H+Workout","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d43e8a4423d14b8b946af706ea1bf42af30fa831","infoHashBuffer":{"type":"Buffer","data":[212,62,138,68,35,209,75,139,148,106,247,6,234,27,244,42,243,15,168,49]},"announce":[],"urlList":[]}}