{"title":"Darkest Dungeon Build 9110","uid":12022100,"size":887752582,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d453b67099ed6a6213e6f4eae1c2a026fae5d3c2&amp;dn=Darkest+Dungeon+Build+9110&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"polan32","files":2,"time":1434459771,"description":"Update 9110: \nFix to AOE crit rolling. It should now work as described in the Gameplay notes below. \nBug where some crits were doing lower than max weapon damage should be fixed. Please post if you experience this bug again. \nFix to crash involving quitting to main menu\n\nGameplay \nHero Page cycling: You can now quickly flip through heroes on the Hero Panel/Character Sheet view by clicking the &quot;Next Hero&quot; / &quot;Previous Hero&quot; arrow icons at the bottom of the sheet or by pressing hotkeys (q) and (e). This works for current party in dungeon, roster, stagecoach, and graveyard. The list of heroes you can cycle through will be contextual to that setting. For example, while in the Stagecoach, it will cycle through available heroes to hire, while on the Embark screen, it will cycle through available heroes to put in the quest. Review and compare your heroes 153% faster than previous versions! \nNew class-specific trinkets for Arbalest and Man-at-Arms implemented. Gear up! (However, currently using placeholder art so you'll have to wait a bit longer to feast your eyes on their full glory!) \nAOE attacks now roll crits individually per target instead of all for one. This better reflects design intent and also insulates the party a bit from one nasty AOE crit reducing everyone to quivering meatbags. \nCrit heals now give some stress relief. Huzzah! \nCrit heals will no longer happen on 0 HP heals, potentially resulting in less snarky comments on the Internet. \nCrit heals now have different chance and effect multiplies for single heals vs AOE heals. Single heals have greater chance to crit compared to AOE heals. \nFix to Plague Doctor self-cure on Battlefield Medicine. Blights and bleeds B-gone! 3rd time's a charm, hopefully... \nBug fix: Friendly skill effects are now rolled per target instead of whole group. Examples of this are the Jester's Insipiring Tune and its stress relief. \nBrigand Fuseman now has an attack to use should the cannon be killed first. Remember, friends don't let friends die this way, though. \nReworded surprise-related buffs slightly in an attempt to make it more clear which things increase chance of the party being surprised or monsters being surprised.\n\nMisc \nComprehensive improvements to the pop-text queing system, which is how things like stuns, stress, heals, and so on show on actors. This should improve some cases where things appeared twice or appeared in strange order. \nTorch FX improvement \nMisc assorted bug fixes","torrent":{"xt":"urn:btih:d453b67099ed6a6213e6f4eae1c2a026fae5d3c2","amp;dn":"Darkest+Dungeon+Build+9110","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d453b67099ed6a6213e6f4eae1c2a026fae5d3c2","infoHashBuffer":{"type":"Buffer","data":[212,83,182,112,153,237,106,98,19,230,244,234,225,194,160,38,250,229,211,194]},"announce":[],"urlList":[]}}