{"title":"The Rosemary and Thyme Mystery Trilogy - Brian Eastman","uid":12041552,"size":529721446,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d4c7227a2f1375754a43a273f03ff18b0f17dd72&amp;dn=The+Rosemary+and+Thyme+Mystery+Trilogy+-+Brian+Eastman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"davieboy1966","files":31,"time":1434798699,"description":"Audio Books : Mystery and Suspense : Other quality : English\n\n\nAll are unabridged and recorded at 48kbps/44kHz Mono CBR Fhg MP3.\nThe author only wrote three titles in this series.\n\n\n\n#1. And No Birds Sing [2004], 7 hours 13 mins, Cassettes, Read by Roweena Cooper.\nLaura Thyme's husband has done to her what men sometimes do in the throes of midlife crisis - dumped her for a younger woman and done a bunk. Considering who to unload on she finds her choices sadly limited, and so leaves immediately to stay with an old friend of her husband's who she's sure will be sympathetic. Not quite so; in staying at the hotel close to the Trents she meets Rosemary Boxer who has had to the back teeth with the male of the species as well, for differing reasons. Rosemary, a university botanist, has been called out to visit an old student and give advice on some of his ailing trees. More ails than just the trees; Daniel is suffering from some unknown de-habilitating and horrific skin disease that has him confined to his mansion of his house, looked after in a precious manner by his snippet of a wife. There's more afoot, as is proved with the death of Sam Trent, business partner in the nursery business to the tragic Daniel. With new found comrade-in-arms Laura in tow (an ex policewoman herself, so very handy in these matters) Rosemary investigates what appears to her sharp eye to be the most suspicious of car crashes. There are too many accidents occurring around one little village and they all have connections to the manor house and it's odd occupants. The villagers all have their own ideas on this one and it's up to the two women to sort through the rubbish and find the truth. (AJ Thompson)\n\n#2. The Tree of Death [2005], 9 hours 3 mins, CD, Read by Maggie Ollerenshaw\nLaura Thyme's cousin's son has recently become ordained, and is now the vicar of several small country parishes, the largest being Baffington. When Laura goes to visit him, she meets several of the locals, and witnesses the sudden death of one of them. A year later, Laura and Rosemary are summoned to help with an ambitious Medieval Fayre, organized by the local celebrity and historian, Franklin Danvers. Their task is to refurbish the very neglected churchyard, where the finest feature is a huge old yew tree. On their first morning, they discover the body of a man under the tree, shot through the heart by an arrow. Unfortunately, most of the villagers had just received tuition in archery, and several of them had proved to be excellent shots! Laura and Rosemary disagree as to whom they suspect of the killing. Rosemary has taken a liking to a local biochemist with a big secret, but Laura mistrusts him. The estate manager, Lyall, also behaves mysteriously. Even the vicar appears to have motives, means and opportunity galore...The village of Baffington is thrown into chaos, as the murder reignites old rivalries, family difficulties and unacknowledged passions.\n\n#3. Memory of Water [2006], 8 hours 7 mins, CD, Read by Lucy Scott\nThe two Fraser cousins shared everything as boys, but when Martin inherits the family estate, Jim is left with nothing. He lives an embittered existence in a small cottage on the edge of the village, feared and shunned by the whole community. When Rosemary Boxer witnesses his apparent suicide by drowning there is a general feeling of relief amongst the local people. While Laura and Rosemary restore Martin Fraser's Elizabethan garden, assisted by a group of prisoners on day release, the question of Jim's death becomes increasingly complicated. Did he really kill himself? Is he really dead at all, wonders Rosemary, having discovered evidence suggesting that he might not be. Martin's behavior is increasingly puzzling, too. Is he still involved with Gwynne, his boyhood sweetheart? And how does her daughter Fern fit into the picture? And then there is the Stevens family, who do have some very exotic interests...The action rises to a dramatic climax centred on the river where Jim drowned. History seems intent on repeating itself, with Rosemary and Laura both in danger from a desperate man. Emotions run high to the last, fueling a story of deceit, misunderstanding and injustice...\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:d4c7227a2f1375754a43a273f03ff18b0f17dd72","amp;dn":"The+Rosemary+and+Thyme+Mystery+Trilogy+-+Brian+Eastman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4c7227a2f1375754a43a273f03ff18b0f17dd72","infoHashBuffer":{"type":"Buffer","data":[212,199,34,122,47,19,117,117,74,67,162,115,240,63,241,139,15,23,221,114]},"announce":[],"urlList":[]}}