{"title":"[ExploitedCollegeGirls] - 15.06.25 - Jasmine - [720p]","uid":12062814,"size":2061635703,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d683374a2a383afdd43141b303b7c57825e45c63&amp;dn=%5BExploitedCollegeGirls%5D+-+15.06.25+-+Jasmine+-+%5B720p%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Ctrlme","files":1,"time":1435323781,"description":"Screenshot(s): &lt;a href=&quot;\nhttp://imgctrl.com/image/QA&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/QA&lt;/a&gt; &lt;a href=&quot;\nhttp://imgctrl.com/image/QC&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/QC&lt;/a&gt; &lt;a href=&quot;\nhttp://imgctrl.com/image/QN&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/QN&lt;/a&gt;\n\nUpdated on Thursday, June 25, 2015\nFeaturing: jASMINE\nAge: 22\nHeight: 5'3&quot;\nFigure:34B-24-36\nEyes: Brown\nLikes: Adventure, Girls, Chalupas.\n\nIt's easy to look past Jasmine's rather odd hair color and butter face and focus on her amazing tight, tanned body (no tan lines either!) and girl next door sensuality because, heck, once her clothes are off you hardly notice her hair but you definitely notice her ample, bouncy tits and sexy round hips.\n\nThings start off with a little behind the scenes car interview, which leads to a behind the scenes car blowjob, which leads to MORE behind the scenes at the hotel with even more behind the scenes blowjob action in a chair. Jasmine has an unusual technique, but it's clear she loves performing oral and really loses herself in the act.\n\nAdrenaline junkie? Taco Bell bean rake driver? Facial virgin? Could just one phrase sum up Jasmine? Absolutely not! This shy seeming girl next door turns out to be both liberated and adventurous. From her deep throat car blowjob to an upside down throat fucking to her first ever facial (on camera even!), Jasmine is up for anything. If there's anything we truly love here at Ex Co Gi, it's a girl who's willing to try all 31 flavors when she gets on camera for us.\n\nAfter favoring Jay with so many lavish blowjobs, Jasmine gets some payback when our number one cum gun sets her on the bed and gives her the fucking she's been in need of for weeks. He starts off with a little face fucking, and after feeling Jasmine's throat from the inside he switched ends and fucks her very wet pussy in position after position. After getting pounded from behind, Jay moves her to Sideshow to lean in for some serious deep penetration and once again nearly makes Jasmine cum, but her nerves get the better of her and she just can't let go. &quot;Letting go&quot; is a problem Jay NEVER has and when he unleashes enough ropes to rig a pirate ship on Jasmine's lips, she can't help but smile through the glaze and wave","torrent":{"xt":"urn:btih:d683374a2a383afdd43141b303b7c57825e45c63","amp;dn":"%5BExploitedCollegeGirls%5D+-+15.06.25+-+Jasmine+-+%5B720p%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d683374a2a383afdd43141b303b7c57825e45c63","infoHashBuffer":{"type":"Buffer","data":[214,131,55,74,42,56,58,253,212,49,65,179,3,183,197,120,37,228,92,99]},"announce":[],"urlList":[]}}