{"title":"An Evil Love, The Life Of Frederick West - Geoffrey Wansell","uid":12023317,"size":456173,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d6a1a81e608729f1a62432c361903f009082abd7&amp;dn=An+Evil+Love%2C+The+Life+Of+Frederick+West+-+Geoffrey+Wansell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ZamKhan","files":1,"time":1434479855,"description":"&quot;He was a man devoid of compassion, consumed with sexual lust, a sadistic killer and someone who has opted out of the human race...the very epitome of evil&quot; -Richard Ferguson, QC, at the trial of Rosemary West\n\nDrawing on more than 100 hours of taped confessions and on his own handwritten autobiography whilst in jail, an account of the life of Frederick West, Britain's most notorious mass murderer, which also provides insight into the nature of pure evil.\n\nThere has never been a more relentless murderer in British penal history than the Gloucester builder Frederick West, who escaped justice by hanging himself in Winson Green Prison on 1 January 1995. Charged at the time of his death with the murder of twelve young women - including his first wife and two of his daughters - he was probably responsible for the deaths of many more in the course of his fifty-three years.\nDespite the massive coverage given to the trial and conviction of Rosemary West, Frederick West himself remains an enigma, his life shrouded in mystery. West, a nondescript little gnome of a man with a ready smile, demonstrated none of the characteristics usually associated with a serial killer.\n\nNow, for the first time, the full story of Frederick West's extraordinary life and death can be told, the secrets of his appalling crimes revealed.\n\nGeoffery Wansell has had unparalleled access to West's own explanations of his actions, including more than 150 hours of tape recordings West made. With the collaboration of the Official Solicitor, Wansell has also been given access to the views of the people who knew West throughout his life, including the social workers and psychiatrists who came into contact with him.\n\nThe book also draws on West's own 100 page 'autobiography' - I Was Loved By An Angel - written during the last weeks of his life, as well as many previously unpublished letters and photographs.\n\nGeoffrey Wansell's definitive biography of Frederick West gives unique insight into the mind of a serial killer, bringing not only an understanding of the motives behind his hideous crimes, but also an appreciation of the lessons society can learn from his behaviuor. The life of Frederick West is, inevitably, an examination of the nature of evil itself","torrent":{"xt":"urn:btih:d6a1a81e608729f1a62432c361903f009082abd7","amp;dn":"An+Evil+Love%2C+The+Life+Of+Frederick+West+-+Geoffrey+Wansell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6a1a81e608729f1a62432c361903f009082abd7","infoHashBuffer":{"type":"Buffer","data":[214,161,168,30,96,135,41,241,166,36,50,195,97,144,63,0,144,130,171,215]},"announce":[],"urlList":[]}}