{"title":"The Handbook of Journal Publishing","uid":12018757,"size":6125849,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d6d4f31152927c8ef0cce85891c64de2efa7a873&amp;dn=The+Handbook+of+Journal+Publishing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1434365911,"description":"ISBN 9781107020856\n\nThe Handbook of Journal Publishing is a comprehensive reference work written by experienced professionals, covering all aspects of journal publishing, both online and in print. Journals are crucial to scholarly communication, but changes in recent years in the way journals are produced, financed, and used make this an especially turbulent and challenging time for journal publishers - and for authors, readers, and librarians. The Handbook offers a thorough guide to the journal publishing process, from editing and production through marketing, sales, and fulfilment, with chapters on management, finances, metrics, copyright, and ethical issues. It provides a wealth of practical tools, including checklists, sample documents, worked examples, alternative scenarios, and extensive lists of resources, which readers can use in their day-to-day work. Between them, the authors have been involved in every aspect of journal publishing over several decades and bring to the text their experience working for a wide range of publishers in both the not-for-profit and commercial sectors","torrent":{"xt":"urn:btih:d6d4f31152927c8ef0cce85891c64de2efa7a873","amp;dn":"The+Handbook+of+Journal+Publishing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6d4f31152927c8ef0cce85891c64de2efa7a873","infoHashBuffer":{"type":"Buffer","data":[214,212,243,17,82,146,124,142,240,204,232,88,145,198,77,226,239,167,168,115]},"announce":[],"urlList":[]}}