{"title":"The Anthony Cumia Show 2015-05-26 Legion of Skanks Chuck Johnson","uid":11968091,"size":362867508,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d8e21e5c8614eded35cce7b4ec12cac26d3d9f2a&amp;dn=The+Anthony+Cumia+Show+2015-05-26+Legion+of+Skanks+Chuck+Johnson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mothergoose58","files":2,"time":1432748748,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest(s): Chuck C. Johnson, Big Jay Oakerson, Dave Smith, Luis J Gomez\n\nEpisode 168 - Tuesday begins with Ant talking about his eventful holiday weekend that included parties, pay-per-view, recording The Hammerfisting Podcast, and Bobo with his entourage. We hear about the &quot;Twitter drama&quot; with Black Earl, the violence in Baltimore over the weekend, an interview with (cop shooting) Marcus Wheeler's mom, the Chicago police scanner, the LGBT numbers rising for Opie and Jimmy, and a shooting at the Aquaducts Racetrack. Chuck Johnson joins TACS via Skype to discuss getting banned from Twitter, the hypocrisy of tweets, website leaks, trolling, people looking to destroy instead of debate, outlets for getting news, and on-line hate. Anthony moves to the poker table where Legion of Skanks announce they'll be joining the platform, the guys give Ant a gift, they talk about Bill Cosby, celebrities that have dealt with rape allegations, the Kurt Cobain documentary, dumpy chicks, and the Legion of Skanks explain their plans for being on the network. They then chat about wrestling, sports moments with balls, kinetic energy, inventions, repetitive questions, Biff from Back to the Future, they take a look at Monday's mail, and finish the show talking up Twitter threats, &quot;checking in&quot; on-line, thought crimes, factory workers, pro-American songs, changes in hip-hop, family values, and scissoring.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:d8e21e5c8614eded35cce7b4ec12cac26d3d9f2a","amp;dn":"The+Anthony+Cumia+Show+2015-05-26+Legion+of+Skanks+Chuck+Johnson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8e21e5c8614eded35cce7b4ec12cac26d3d9f2a","infoHashBuffer":{"type":"Buffer","data":[216,226,30,92,134,20,237,237,53,204,231,180,236,18,202,194,109,61,159,42]},"announce":[],"urlList":[]}}