{"title":"The Justification of Religious Violence (2014) pdf","uid":12101400,"size":2252745,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d96cf596fe38e97d2ddc687af00d7c2dfd47c957&amp;dn=The+Justification+of+Religious+Violence+%282014%29+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bookzilla","files":1,"time":1436320808,"description":"The Justification of Religious Violence (Blackwell Public Philosophy Series)\n\n\nHow are justifications for religious violence developed and do they differ from secular justifications for violence? Can liberal societies tolerate potentially violent religious groups? Can those who accept religious justifications for violence be dissuaded from acting violently? Including six in-depth contemporary case studies, The Justification of Religious Violence is the first book to examine the logical structure of justifications of religious violence. * Seeks to understand how justifications for religious violence are developed and how or if they differ from ordinary secular justifications of violence * Examines 3 widely employed premises used in religious justifications of violence cosmic war , the importance of the afterlife, and sacred values * Considers to what extent liberal democratic societies should tolerate who hold that their religion justifies violent acts * Reflects on the possibility of effective policy measures to persuade those who believe that violent action is justified by religion, to refrain from acting violently * Informed by recent work in psychology, cognitive science, neuroscience and evolutionary biology * Part of the Blackwell Public Philosophy Series","torrent":{"xt":"urn:btih:d96cf596fe38e97d2ddc687af00d7c2dfd47c957","amp;dn":"The+Justification+of+Religious+Violence+%282014%29+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d96cf596fe38e97d2ddc687af00d7c2dfd47c957","infoHashBuffer":{"type":"Buffer","data":[217,108,245,150,254,56,233,125,45,220,104,122,240,13,124,45,253,71,201,87]},"announce":[],"urlList":[]}}