{"title":"Sean Ford - Only Skin","uid":11868906,"size":67746309,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d9a48e584db698e2ed793c106251502dbbc3b429&amp;dn=Sean+Ford+-+Only+Skin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LeonardTSpock","files":4,"time":1430399484,"description":"Unfortunately, this is incomplete, and I'd really like to read the rest of it. I can't find much clear info on the individual issues, but there's a GN with about 100 more pages than we have here, so I'm guessing 2-3 more issues... or maybe the extra pages are only in the GN. This information must be &quot;out there&quot; somewhere, I'm just not sure where.\n\n--------------------------------------------------------------\n\nOnly Skin - New Tales of the Slow Apocalypse 1-4\n\nI believe the issues were self-published (the GN is Secret Acres), 2007-2009 (the GN is 2012), 37-48 pages (the GN is 268 or 272 pages - depending on the printing, of which there were two)\n\nWritten and Illustrated by Sean Ford\n\nOnly Skin is a grim exploration of the hallucinatory and tragic landscape of modern rural America, as seen through the eyes of a pair of orphaned siblings, searching for answers in a world filled with terrible, terrible questions. \n\nSean Ford s Only Skin is just the sort of comic book I like reading. Not only a tale of quirky surreal horror, intrigue, adventure and exquisite humor, this book has a great amount of heart. --Farel Dalrymple, of Omega the Unknown and Pop Gun War\n\nSean Ford creates a world that s both eerie and warmly mundane. Not an easy feat. --Alison Bechdel, author of the best-selling graphic memoir Fun Home\n\nOnly Skin slips like a scalpel through the permeable membrane between life and death, past and present, light and shadow, inside and outside. As evocative of Crockett Johnson's Barnaby as it is of David Lynch and Charles Burns, Sean Ford's uncanny debut graphic novel has its own take on what goes down in and at the edges of small town America. You'll have to let this one kiss your eyes, whisper in your ear, and slither into your head before it uncovers its ghosts and sheds its secrets. After all, it's only skin and so easily shed... --Stephen R. Bissette, Swamp Thing, Taboo, Tyrant, Teen Angels &amp; New Mutants\n &lt;a href=&quot;\nhttp://secretacres.com/?page_id=964&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://secretacres.com/?page_id=964&lt;/a&gt;","torrent":{"xt":"urn:btih:d9a48e584db698e2ed793c106251502dbbc3b429","amp;dn":"Sean+Ford+-+Only+Skin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9a48e584db698e2ed793c106251502dbbc3b429","infoHashBuffer":{"type":"Buffer","data":[217,164,142,88,77,182,152,226,237,121,60,16,98,81,80,45,187,195,180,41]},"announce":[],"urlList":[]}}