{"title":"Doug Dandridge - Exodus: Empires at War [1-2]","uid":12091783,"size":774091638,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d9f95fcf5243ae0ba51c2846534864137d5a3b1b&amp;dn=Doug+Dandridge+-+Exodus%3A+Empires+at+War+%5B1-2%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Cybotage","files":2,"time":1436068501,"description":"Exodus: Empires at War: Book 1\n\nHumanity's worst nightmare has again come out of the Dark. Can a human race in turmoil survive?\nWhen the human race faces extermination at the hands of an expanding species the last survivors travel a thousand years to reestablish the race ten thousands light years away. It is now a thousand years after the birth of the New Terran Empire. The race has aggressively expanded during that time, with a fleet that has never lost a war against an alien species. But the signs are there, the old enemy is back, and the Fleet will face its greatest challenge in a foe fifty times their size.\nScience fiction in the tradition of Anderson and Weber, where the physics of normal and hyperspace dictate the strategy and tactics. Enormous fleets battle across the immensity of space with advanced technologies. Can the proud human Fleet hold off the tide of an advancing enemy, rallying allies and deploying new tech? Or will the conquerors achieve what they could not two thousand years before, and end the existence of the upstarts.\n\nExodus: Empires at War: Book 2\n\nThe Saga Continues as the Ca'cadasan menace prepares to assault the New Terran Empire. A menace humankind fled across the Galaxy two thousand years before.\n\nHumankind has grown complacent, confident in the victories their fleet has won for them through the last thousand years over numerous alien races. But the Ca'cadasan Empire has continued to grow, and now the massive Imperialistic power has found the hated humans. The Emperor knew this was going to happen, but most of Parliament ignored his strident call. And the Prince Sean Lee Ogden Romanov, third in line for the throne, finds himself placed into a position he had never thought would come his way.\n\nThe fate of the Empire may rest on the abilities of one young man, and his skills at navigating the maze of Imperial politics amidst a war of extermination.\n\n\nFormat: MP3\nBitrate: 64 Kbps\nUnabridged","torrent":{"xt":"urn:btih:d9f95fcf5243ae0ba51c2846534864137d5a3b1b","amp;dn":"Doug+Dandridge+-+Exodus%3A+Empires+at+War+%5B1-2%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9f95fcf5243ae0ba51c2846534864137d5a3b1b","infoHashBuffer":{"type":"Buffer","data":[217,249,95,207,82,67,174,11,165,28,40,70,83,72,100,19,125,90,59,27]},"announce":[],"urlList":[]}}