{"title":"REO Speedwagon - Ridin' The Storm Out/Lost In A Dream[RMSTD]","uid":11995980,"size":204115160,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:da0152aad32cbc6391362d2561d64b73997b3fd9&amp;dn=REO+Speedwagon+-+Ridin%27+The+Storm+Out%2FLost+In+A+Dream%5BRMSTD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"LameDuck69","files":33,"time":1433646609,"description":"REO Speedwagon - Ridin' The Storm Out &amp; Lost In A Dream[1973,1974][2008][RMSTD]\n\n\n\nRidin' The Storm Out [1973]\n\n\n01. Ridin' the Storm Out  \n02. Whiskey Night  \n03. Oh Woman  \n04. Find My Fortune  \n05. Open Up  \n06. Movin'  \n07. Son of a Poor Man  \n08. Start a New Life  \n09. It's Everywhere  \n10. Without Expression (Don't Be the Man)\n\n\n\nLost In A Dream [1974]\n\n  \n11. Give Me a Ride (Rollercoaster)  \n12. Throw the Chains Away  \n13. Sky Blues  \n14. You Can Fly  \n15. Lost In a Dream  \n16. Down By the Dam  \n17. Do Your Best  \n18. Wild As the Western Wind  \n19. They're On the Road  \n20. I'm Feeling Good  \n-------------------------------------------\n**320 KBPS CBR\n**Cover Art\n-------------------------------------------\nREO Speedwagon (originally styled as R.E.O. Speedwagon) is an American rock band. Formed in 1967, the band cultivated a following during the 1970s and achieved significant commercial success throughout the 1980s. Hi Infidelity (1980) contained four US Top 40 hits and is the group's best-selling album, with over ten million copies sold.\n\nOver the course of its career, the band has sold more than 40 million records and has charted thirteen Top 40 hits, including the number ones &quot;Keep On Loving You&quot; and &quot;Can't Fight This Feeling&quot;. REO Speedwagon's mainstream popularity dissipated in the 1990s but the band remains a popular live act.\n--------------------------------------------------------------------------------\nEarly Years:\n------------\n\nWith their equipment being hauled to dates in a friend's station wagon, REO played bars and clubs all over the Midwest. The band's debut album, R.E.O. Speedwagon, was released on Epic Records in 1971. The most popular track on this record was &quot;157 Riverside Avenue&quot;. The title refers to the Westport, Connecticut address, where the band stayed while recording in Leka's studio in Bridgeport and remains an in-concert favorite.\n\nAlthough the rest of the band's line-up remained stable, REO Speedwagon switched lead vocalists three times for their first three albums. Luttrell left the band in early 1972, eventually becoming the vocalist for Starcastle. He was replaced by Kevin Cronin. Cronin recorded one album with the band, 1972's R.E.O./T.W.O. but left the band during the recording sessions for 1973's Ridin' the Storm Out because of internal conflicts.[4] Ridin' the Storm Out was completed with Michael Bryan Murphy on lead vocal. Murphy stayed on for two more albums, Lost in a Dream and This Time We Mean It, before Cronin returned to the fold in January 1976 and recorded R.E.O., which was released that same year.\n\nCronin's return came after Greg X. Volz turned down the position for lead vocalist due to his commitment to Christianity and Volz would instead go on to accept an offer made by Bob Hartman to join his band Petra as lead vocalist.\n\nIn 1977 REO convinced Epic Records that their strength was in their live performances. Epic agreed to let them produce their first live album, Live: You Get What You Play For, which was certified platinum.\n\nIn 1977 Philbin was replaced with Bruce Hall to record You Can Tune a Piano but You Can't Tuna Fish, released in 1978, which received FM radio airplay. The album was REO's first to make the Top 40, peaking at #29. The album sold over 2 million copies in the US, achieving double platinum status.\n\nIn 1979 the band took a turn back to hard rock with the release of Nine Lives.\n--------------------------------------------------------------------------------\nRidin' the Storm Out is the third studio album by REO Speedwagon, released in 1973. It peaked at number 171 on the Billboard 200 chart in 1981, and reaching platinum status in 1989. It was the first album to feature Mike Murphy on vocals. The sessions started out with Kevin Cronin, but he left the band before the album was finished, due to creative differences. The title track would later become a hit for the band on their live album, after Cronin had returned to the band. Cronin's original version of &quot;Son of a Poor Man&quot; is featured on the compilation albums A Decade of Rock and Roll: 1970-1980, and The Essential REO Speedwagon. &quot;Son of a Poor Man&quot; and &quot;Ridin' the Storm Out&quot; were featured on the live album Live: You Get What You Play For. &quot;Ridin' the Storm Out&quot; with Cronin on vocals is available as a downloadable track in the music video game Rock Band.\n\nThe song refers to the band being stuck in a harsh winter blizzard after a show in Boulder, Colorado at a bar called Tulagi's (now closed).\n-----------------------------------------------------------\n\nREO Speedwagon:\n---------------\n\nMike Murphy: Lead Vocals\nGary Richrath: Guitar, Lead Vocals on &quot;Find My Fortune&quot;\nGregg Philbin: Bass Guitar\nNeal Doughty: Keyboards, Synthesizer\nAlan Gratzer: Drums\n\n\nAdditional Musical Personnel(as listed in CD liner notes):\n----------------------------------------------------------\n\nJoe Walsh: Slide Guitar (on &quot;Whiskey Night&quot;, &quot;Open Up&quot; and &quot;Start A New Life&quot;)\nGuille Garcia: Percussion\nGene Estes: Percussion\n\n--------------------------------------------------------------------------------\nLost in a Dream is the fourth studio album by REO Speedwagon, released in 1974. It peaked at number 98 on the Billboard 200 chart in 1975, It was the second album to feature Mike Murphy on vocals. The title track was written by Murphy and future bassist Bruce Hall, who would join the band in 1978. The title track was featured on the compilation A Decade of Rock and Roll: 1970-1980. The album was in print on CD format in 1992 for two months before being quickly deleted.\n\nPersonnel:\n----------\n\nMike Murphy: lead vocals, guitar, Organ\nGary Richrath: guitar, Acoustic Guitar, Background Vocals lead vocals on &quot;Wild as the Western Wind&quot; (verses)\nGregg Philbin: bass guitar, Background Vocals\nNeal Doughty: keyboards\nAlan Gratzer: drums, background vocals","torrent":{"xt":"urn:btih:da0152aad32cbc6391362d2561d64b73997b3fd9","amp;dn":"REO+Speedwagon+-+Ridin%27+The+Storm+Out%2FLost+In+A+Dream%5BRMSTD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da0152aad32cbc6391362d2561d64b73997b3fd9","infoHashBuffer":{"type":"Buffer","data":[218,1,82,170,211,44,188,99,145,54,45,37,97,214,75,115,153,123,63,217]},"announce":[],"urlList":[]}}