{"title":"The Legend Of Heroes Trails In The Sky UPD","uid":11877237,"size":514117326,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:dac845c2cafedf0dffe54d786576b989001b4269&amp;dn=+The+Legend+Of+Heroes+Trails+In+The+Sky+UPD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vervederek","files":6,"time":1430578863,"description":"The Legend of Heroes: Trails in the Sky is the first of a new trilogy in the established The Legend of Heroes RPG series\n\nModern society owes much to a mystical technology known as &quot;orbal\n energy&quot;. Fifty years ago, during what's come to be known as the\n &quot;Orbal Revolution&quot;, the invention of this technology and the &quot;orb-\n ments&quot; developed from it led to a period of rapid human advancement,\n birthing innovations of all shapes and sizes, not the least of which\n was the airliner, or &quot;orbalship&quot; industry. Although the positive\n impact of this revolution is obvious, every coin has a flipside; for\n every beneficial device developed with these new materials, so too\n were advanced weapons and other implements of war. Thus, the land\n became mired with turmoil, and remains in such a state even now.\n Enter, the bracers: an organization established to serve as police\n and intermediaries alike, holding above all else the peace and safety\n of the lands under their jurisdiction. Whenever a citizen is in need\n of assistance, he or she may place a request at the local Bracer Guild\n and be it monster extermination, crime prevention or even peace talks\n among warring nations, the bracers will do whatever they can to resolve\n the matter cleanly and efficiently.\n Some matters require a gentler touch than others, however. When an\n orbalship transporting a legendary &quot;S-rank&quot; bracer named Cassius Bright\n suddenly goes missing, said bracer's daughter, Estelle, and adoptive\n son, Joshua, must join forces in search of him across the entire Kingdom\n of Liberl. And what they find along the way could change both of their\n lives forever...\n\n Instructions:\n\n -Install the update\n -Copy the crack\n -Enjoy","torrent":{"xt":"urn:btih:dac845c2cafedf0dffe54d786576b989001b4269","amp;dn":"+The+Legend+Of+Heroes+Trails+In+The+Sky+UPD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dac845c2cafedf0dffe54d786576b989001b4269","infoHashBuffer":{"type":"Buffer","data":[218,200,69,194,202,254,223,13,255,229,77,120,101,118,185,137,0,27,66,105]},"announce":[],"urlList":[]}}