{"title":"HISTORY OF POP AND ROCK MUSIC - part 583","uid":12101430,"size":916981820,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:db4a63317e7c84e383adb555e31fb6fb3e563aa1&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+583&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pupovaczlatko","files":11,"time":1436325160,"description":"\n\n                                     PART  583\n\n                    \n                              ROBERT CRAY  -   Smoking Gun   (1986) \n                              CROWDED HOUSE  -   Better Be Home Soon  (1988) \n                              CROWDED HOUSE  -  Weather with You  (1992) \n                              STEVE MILLER BAND  -  Wide River  (1993) \n\n\n\n           &quot;Smoking Gun&quot;  is a 1986 song by Robert Cray. It made #2 on the Mainstream Rock charts, and the next year made #22 on the Billboard Hot 100. In addition, for this song Cray was nominated for the 1987 MTV Video Music Awards for Best New Artist in a Video.\n\n          &quot;Better Be Home Soon&quot;  is a 1988 song written by Neil Finn and performed by New Zealand/Australian Rock band Crowded House. The song was released as a single in July 1988 by Capitol Records. It performed modestly on both the American and British charts, but managed to peak at number two on the Australian charts and number one for three weeks in the New Zealand charts. The song appeared on the album Temple of Low Men, which was also released in July 1988. In 2001, and the song was voted by members of APRA as the 33rd best New Zealand song of the 20th century. In 2005, following drummer Paul Hester's death, Neil Finn performed the song solo at the ARIA Awards while a montage of Hester's life was played in the background.\n\n           &quot;Weather with You&quot; is a 1992 song by rock group Crowded House. It was the third and most successful single released from the group's third studio album &quot;Woodface&quot;, reaching top fifty charts in six countries with a peak of #7 in the United Kingdom. The song was intended to be part of the Finn Brothers' unreleased 1990 debut, but after Capitol Records found the recordings, they were merged with a Crowded House session to become Woodface.\n\n           &quot;Wide River&quot; is the fifteenth album by American rock band the Steve Miller Band, released in 1993. The title track was their last Hot 100 hit. It would be Steve Miller Band's last studio album until Bingo! seventeen years later in June 2010","torrent":{"xt":"urn:btih:db4a63317e7c84e383adb555e31fb6fb3e563aa1","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+583","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db4a63317e7c84e383adb555e31fb6fb3e563aa1","infoHashBuffer":{"type":"Buffer","data":[219,74,99,49,126,124,132,227,131,173,181,85,227,31,182,251,62,86,58,161]},"announce":[],"urlList":[]}}