{"title":"BBC.Later.with.Jools.Holland.S46E07.Full.1080i.h264-NX","uid":11974050,"size":3817321388,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:dbcf75a82f685cfe7c08692de1d5aa92cf1a4147&amp;dn=BBC.Later.with.Jools.Holland.S46E07.Full.1080i.h264-NX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BasilBrush","files":1,"time":1432952457,"description":"29th May 2015 23:05 to 00:10 BBC2 HD\n\n\nJoining Jools on the final show of this series are Devon's global musical export Muse, debuting tracks from their upcoming seventh studio album Drones, which singer Matt Bellamy has described as the band 'going back to a more rock sound'.\n\nJazz and blues chanteuse Melody Gardot returns to the show to perform tracks from her upcoming fourth album Currency of Man, which sees her take on a new musical direction that harks back to 60s Nina Simone, the songs moving through fat fuzzed electric guitars, wailing horns, pulsing bass lines and direct lyrics.\n\nOriginally from Olympia, Washington, Sleater-Kinney were part of the riot grrrl scene of the late 90s and released seven albums until going on a hiatus in 2006. In 2015 they released their first album in a decade, No Cities to Love, to great acclaim, and the trio perform a couple of tracks from it on the show.\n\nJools also chats to Giorgio Moroder, producer extraordinaire and the man behind such hits as Donna Summer's I Feel Love and Phil Oakey's Together in Electric Dreams.\n\nAlso on the final show of the series is US folk music royalty and leading figure of the British folk revival Peggy Seeger, who performs a track from her recent Everything Changes album, which draws on her forte as a songwriter. Making her TV debut is London-based, dreamy balladeer Ala.Ni, whose songs hark back to the 40s and 50s, albeit with a personal, contemporary touch.\n\nCompleting the line-up is US blues musician and bona fide star here in his adopted country, Seasick Steve, who returns with more elemental blues boogie and folk, picking from his latest and Top 5 album Sonic Soul Surfer.\n\nTechnical Spec\nFilesize__: 3.55 GB\nRun-Time__: 64 min\nContainer_: TS\nVideo_____: h264 High L4.0 1920x1080i 25fps 6853Kbps\nAudio#1___: AC3 CBR 6ch 48KHz 384Kbps\nAudio#2___: MP2 CBR 2ch 48KHz 256Kbps\nSubtitle#1: Teletext\nSubtitle#2: DVB Subtitle","torrent":{"xt":"urn:btih:dbcf75a82f685cfe7c08692de1d5aa92cf1a4147","amp;dn":"BBC.Later.with.Jools.Holland.S46E07.Full.1080i.h264-NX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbcf75a82f685cfe7c08692de1d5aa92cf1a4147","infoHashBuffer":{"type":"Buffer","data":[219,207,117,168,47,104,92,254,124,8,105,45,225,213,170,146,207,26,65,71]},"announce":[],"urlList":[]}}