{"title":"Energy Efficiency: Benefits for Environment and Society","uid":11978876,"size":4922006,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc218fa64b0b92d8c3e26581839e090bd77b330a&amp;dn=Energy+Efficiency%3A+Benefits+for+Environment+and+Society&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ferdgust","files":1,"time":1433128534,"description":"This book discusses how energy efficiency benefits the global environment, national energy security, local pollution mitigation, natural resource conservation, and utility bill reduction. In addition, this book provides many hands-on skills and knowledge to identify and develop energy efficiency projects. The literature review shows that energy efficiency has become the first fuel in the world energy supply. With empirical analyses, this book indicates that without continued investment in energy efficiency, neither China nor the U.S. could achieve their carbon emission reduction targets that were announced on November 13, 2014 during the Beijing 2014 APEC meeting. The authors argue that energy efficiency will become the first tool to mitigate climate change. These include (1) identifying energy efficiency barriers, (2) developing energy policies, (3) investing in energy efficient technologies, (4) undertaking project cost-effectiveness analysis, (5) de-risking and financing energy efficiency projects; (6) developing and managing energy service companies, and (7) promoting urban transport efficiency. Two case studies in energy efficiency improvement in electrical motors and industrial boilers are also presented. This book is written for college and university students, practitioners, researchers, consultants, project developers, and policy makers who want to dedicate their professional careers in global energy efficiency improvement, climate change mitigation, local clean air initiatives, and energy bill reduction","torrent":{"xt":"urn:btih:dc218fa64b0b92d8c3e26581839e090bd77b330a","amp;dn":"Energy+Efficiency%3A+Benefits+for+Environment+and+Society","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc218fa64b0b92d8c3e26581839e090bd77b330a","infoHashBuffer":{"type":"Buffer","data":[220,33,143,166,75,11,146,216,195,226,101,129,131,158,9,11,215,123,51,10]},"announce":[],"urlList":[]}}