{"title":"Yoga in Hawaii with Lynne Oliver Vol 1 Tropical Park [MP4]","uid":11820966,"size":835544842,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:dcf75c6a2746c087752ad6e90ac08e47a63ad480&amp;dn=Yoga+in+Hawaii+with+Lynne+Oliver+Vol+1+Tropical+Park+%5BMP4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"elessedilgirl","files":2,"time":1429259331,"description":"This DVD is dedicated to strengthening the whole self, Mind, Body, Emotions and Spirit. It will encourage beginners to practice with safety and confidence and advanced students to look more carefully at their techniques. Filmed in Hawaii, the charisma of a beautiful environment with authentic nature sounds makes this a truly Holistic Experience. TROPICAL PARK INTRODUCTION TO BREATHING TECHNIQUES FOR FOCUS, MIND CONTROL AND INNER CONNECTION C Curve Breath Neck and Shoulders Butterfly triceps stretch and lateral bend Chest opener and lymphatic stimulation using core stability i.e. abs, obliques and psoas muscles Thoracic spinal twist for increased circulation to nerve endings SEATED FORWARD BEND To accommodate tight ham strings and minimise neck and shoulder tension HIP OPENER SECTION Rock the Baby Right angle adductor stretch and lower back opener Hip, back, thoracic stretch with aligned shoulders FIGURE 8 LOWER BACK ROCK Pelvic floor and hip stabilisation for improved strength in quads for knee protection Wave sequence, core stability based for lower backs and necks. Cervical spine and lower back stretch Crescent Moon side body stretch Figure 8 Back Rock Sacrum sequence to include stimulation for the thyroid with use of sound Swan Posture Pigeon Posture Relaxation.\n\nVideo; x264; 720*570 (4:3); 2412 kbps; 25.000 fps\nAudio; aac; 160 kbps; 2 ch; 48.0 Khz","torrent":{"xt":"urn:btih:dcf75c6a2746c087752ad6e90ac08e47a63ad480","amp;dn":"Yoga+in+Hawaii+with+Lynne+Oliver+Vol+1+Tropical+Park+%5BMP4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcf75c6a2746c087752ad6e90ac08e47a63ad480","infoHashBuffer":{"type":"Buffer","data":[220,247,92,106,39,70,192,135,117,42,214,233,10,192,142,71,166,58,212,128]},"announce":[],"urlList":[]}}