{"title":"Commodore: A Company On The Edge, by Brian Bagnall [ePub]","uid":12007747,"size":3987480,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dd1a411eeb6b7595df65dbf7fb3335eca1fb7c48&amp;dn=Commodore%3A+A+Company+On+The+Edge%2C+by+Brian+Bagnall+%5BePub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bey0nd","files":1,"time":1433975915,"description":"Filled with first-hand accounts of ambition, greed, and inspired engineering, this history of the personal computer revolution takes readers inside the cutthroat world of Commodore. Before Apple, IBM, or Dell, Commodore was the first computer manufacturer to market its machines to the public, selling an estimated 22 million Commodore 64s. Those halcyon days were tumultuous, however, owing to the expectations and unsparing tactics of founder Jack Tramiel. Engineers and managers with the company between 1976 and 1994 share their memories of the groundbreaking moments, soaring business highs, and stunning employee turnover that came with being on top in the early days of the microcomputer industry. This updated second edition includes additional interviews and first-hand material from major Commodore figures like marketing guru Kit Spencer, chip designer Bill Mensch, and Commodore co-founder Manfred Kapp.\n\n\nAbout the Author:\n\nBrian Bagnall is the author of numerous computer titles, including Core LEGO Mindstorms, On the Edge, and Maximum LEGO NXT. He is also a frequent contributor to Old-Computers.com, an online museum dedicated to recording and preserving computer history. He lives in Winnipeg, Manitoba.\n\n--------------------\nHardcover: 548 pages\nPublisher: Variant Press; 2nd edition (December 15, 2010)\nLanguage: English\nISBN-10: 0973864966\nISBN-13: 978-0973864960","torrent":{"xt":"urn:btih:dd1a411eeb6b7595df65dbf7fb3335eca1fb7c48","amp;dn":"Commodore%3A+A+Company+On+The+Edge%2C+by+Brian+Bagnall+%5BePub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd1a411eeb6b7595df65dbf7fb3335eca1fb7c48","infoHashBuffer":{"type":"Buffer","data":[221,26,65,30,235,107,117,149,223,101,219,247,251,51,53,236,161,251,124,72]},"announce":[],"urlList":[]}}