{"title":"Out There (Web Comic) - Complete through 2014 {WebComixFan}","uid":11986529,"size":152776360,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:defeeeb9b01f10ea36b5d7adbc1a2918a781d308&amp;dn=Out+There+%28Web+Comic%29+-+Complete+through+2014+%7BWebComixFan%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"WebComixFan","files":15,"time":1433367244,"description":"&quot;OUT THERE&quot; Web Comic\n\n&quot;Out There&quot; (outthere.keenspot.com) by R.C. Monroe focuses on the exploits of Miriam, a hedonistic, self-centered, self-destructive bartender with a good heart and a strong desire to change for the better, so long as the change doesn't interfere with her endless search for pleasure.  The strip features an ensemble cast, but it's mostly The Miriam Show, because she wouldn't have it any other way.  The humor in &quot;Out There&quot; is generally subtle and understated.  At its heart, the strip is a character drama, and its characters are well-developed, complex and realistic.  &quot;Out There&quot; ran as a black and white daily from June of 2006 through June of 2013, when it switched to a once-a-week color format and began alternating with two new once-a-week comics, &quot;In Here&quot; (an alternate continuity involving Miriam) and &quot;Cliche Flambe&quot; (in which Miriam and company break the fourth wall to present author rants about cliched phrases).  While &quot;Out There&quot; still updates regularly, though, the side strips seem to have faltered, as &quot;In Here&quot; hasn't been updated at all and &quot;Cliche Flambe&quot; has seen only a couple of scattered new strips since April of 2014.\n\nThis torrent collects &quot;Out There&quot; comics from the strip's premiere in 2006 through the end of 2014 in a series of CBR files, one for each year.  Also included are CBR files containing the &quot;In Here&quot; and &quot;Cliche Flambe&quot; side strips from 2013 and 2014","torrent":{"xt":"urn:btih:defeeeb9b01f10ea36b5d7adbc1a2918a781d308","amp;dn":"Out+There+%28Web+Comic%29+-+Complete+through+2014+%7BWebComixFan%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"defeeeb9b01f10ea36b5d7adbc1a2918a781d308","infoHashBuffer":{"type":"Buffer","data":[222,254,238,185,176,31,16,234,54,181,215,173,188,26,41,24,167,129,211,8]},"announce":[],"urlList":[]}}