{"title":"Never Fallin by Basix","uid":11834925,"size":8077575,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e10190808d7867f88575c5f3f15b7c40383b7ff6&amp;dn=Never+Fallin+by+Basix&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Basix92","files":1,"time":1429702267,"description":"Never Fallin is a modern anthem.  Young men and women, all over the world, are fighting the good fight, trying to keep their heads above water, all the while today's society is presenting road-block after road-block to thwart their efforts.  Never Fallin' is my defiant cry; promising that I will not allow myself to succumb to these modern obstacles.  Homage to Living Legends.\n\n\nLYRICS\n\nBasix Intro:\nMan, I'm never going down\nFucking busters, haha\nBasix!\nWhat up? Risk It All Records in the building\n\nBasix Verse:\nI'm never falling, always pouring out intense emotion\nExploring all that I've endured, causes sense explosion\nAnd I ain't said much, to give y'all a dizzy head rush\nConstantly flowing, but y'all know not where I'm going, hush\nAcceptance is a blessing, got to follow the road\nIt ain't a guessing game, grind in unstoppable mode\nWhen an issue unaddressed it can slow the gears\nHere's my confession, I've lived by the code for years\nLet the music take control and hold onto what's real\nFeel the vibe, never sell away your soul for a deal\nSo I ain't never falling down, never call him soft\nI intercept ambushes, better call it off\nThis is Basix up in boss mode, don't cross my path\nHate on me all you want, but please get off my ass\nBecause I ain't never falling off, I just follow through\nAnd that's today, yesterday, and tomorrow too,\n\n(Yeah, Sneeks)\n(Right!)\n\nSneeks Verse:\nI was brought up to keep the fight, Never sleep cuz\nIf you ever sleepin you end up wishing, So I keep on hustling\nKeep a small group of loved ones and I'll trust in that\nCuz they kept my mind right and Hip Hop saved my life\nAnd I don't gotta front cuz I'm known that we doing alright\nAnd I'm never falling, and I'm saying true levels so you know about it\nWith ambition there will never be no limit, keep on going higher\nStraight through the ceiling, so don't matter what they tell you\nJust keep your head up through all the rough, and you'll never be falling\n\nSolo Da Masta Verse:\nA boy became a sinner because the winner was his brother\nNow they asking have you seen him, where's he been and where's his lover\nBut he's got this thing that's in him, sweet like cinnamon, but bitter\nMight be spicy but the mix it so unique it's almost bitter, uh\nHis mind is uncontrollable, it's almost up to space\nHe's not high, he's just lost, you can see it in his taste\nHe likes what's weird, but he cannot reach\nYou can preach, but you won't teach nothing to little leach\nI say what's in my soul, sound style the concrete\nI can give you everything, man no sneak peak\nThat's what he says, putting on his headphones going straight to bed\n\nSpacely Verse:\nI got a lot shit that stays on my mind, \nI'm trying to be in first place, but I'm steadily behind.\nHonestly, I thought I would be signed,\nguess that's just a dream when you're constantly blind.\nReally, I truly don't know what to do\na lot of bullshit in the game has me askew.\nIn reality, things really aren't the same,\nthe games fucked up but we looking for change.\nProbably the reason why I get high to escape\nfrom my problems by putting them on stand by\nNow I'm, not saying I'm best,\nI'm just an individual who stays constantly stressed.\nAnd I'm blessed to be thinking about the drama,\nI'm trying to achieve peace, like the Dahli Lama...\nLike the Dahli Lama","torrent":{"xt":"urn:btih:e10190808d7867f88575c5f3f15b7c40383b7ff6","amp;dn":"Never+Fallin+by+Basix","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e10190808d7867f88575c5f3f15b7c40383b7ff6","infoHashBuffer":{"type":"Buffer","data":[225,1,144,128,141,120,103,248,133,117,197,243,241,91,124,64,56,59,127,246]},"announce":[],"urlList":[]}}