{"title":"Dr. Hook - Sharing The Night Together-The best of [1996]  FLAC","uid":12077404,"size":379450169,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e39bfe87973d527163952cf3bd99d9002ef6300c&amp;dn=Dr.+Hook+-+Sharing+The+Night+Together-The+best+of+%5B1996%5D++FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"keeybee","files":35,"time":1435670258,"description":"Please seed!\n\nDr. Hook - Sharing The Night Together - The best of Dr. Hook\nThis compilation 1996\n\nWith art work\n\n01  Dr. Hook - Sharing the Night Together - Better Love Next Time\n02  Dr. Hook - Sharing the Night Together - Sharing The Night Together\n03  Dr. Hook - Sharing the Night Together - Sexy Eyes\n04  Dr. Hook - Sharing the Night Together - When You're In Love With A\n                                            Beautiful Woman\n05  Dr. Hook - Sharing the Night Together - If Not You\n06  Dr. Hook - Sharing the Night Together - A Little Bit More\n07  Dr. Hook - Sharing the Night Together - Oh, Jesse\n08  Dr. Hook - Sharing the Night Together - Years From Now\n09  Dr. Hook - Sharing the Night Together - Sweetest Of All\n10  Dr. Hook - Sharing the Night Together - In Over My Head\n11  Dr. Hook - Sharing the Night Together - I Don't Feel Much Like Smilin'\n12  Dr. Hook - Sharing the Night Together - I Don't Want To Be Alone Tonight\n13  Dr. Hook - Sharing the Night Together - Only Sixteen\n14  Dr. Hook - Sharing the Night Together - All The Time In The World\n15  Dr. Hook - Sharing the Night Together - Everybody Is Making It Big But Me\n16  Dr. Hook - Sharing the Night Together - Storms Never Last\n17  Dr. Hook - Sharing the Night Together - More Like The Movies\n18  Dr. Hook - Sharing the Night Together - What About You\n19  Dr. Hook - Sharing the Night Together - A Couple More Years\n20  Dr. Hook - Sharing the Night Together - Makin' Love And Music","torrent":{"xt":"urn:btih:e39bfe87973d527163952cf3bd99d9002ef6300c","amp;dn":"Dr.+Hook+-+Sharing+The+Night+Together-The+best+of+%5B1996%5D++FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e39bfe87973d527163952cf3bd99d9002ef6300c","infoHashBuffer":{"type":"Buffer","data":[227,155,254,135,151,61,82,113,99,149,44,243,189,153,217,0,46,246,48,12]},"announce":[],"urlList":[]}}