{"title":"Oil Panic and the Global Crisis - Predictions and Myths","uid":12013569,"size":2889147,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e3e2abec5ac28e322e13141afc25ba1914ae78ad&amp;dn=Oil+Panic+and+the+Global+Crisis+-+Predictions+and+Myths&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1434268216,"description":"ISBN 9781405195485\n\nIs the world running out of oil? This book analyzes predictions of global oil depletion in the context of science, history, and economics.\nThere has been continuing alarm about the imminent exhaustion of earth's non-renewable resources. Yet, the world has never run out of any significant, globally traded, non-renewable resource. Is the world finally facing a non-renewable resource depletion catastrophe, or is the current concern just another one of a succession of panics? In this book, key assumptions and underlying arguments in the global oil-depletion debate are first summarized and then challenged. Facts about oil supply, production, and consumption are made accessible using concise and simple graphics.\n\nConcepts of resource depletion, end-use needs, technology leap-frogging, efficiency, and substitution are used to evaluate historical patterns of exploitation of non-renewable resources and to explore what history suggests about our future dependence on oil.\n\nThis book is aimed at a broad range of readers,from undergraduate students studying resource science and economics to anyone interested in understanding the context of the controversy over global oil depletion.\n\n&quot;It is a book serious students of the world oil market should read, not because Gorelick has all the answers but because his account is well reasoned, well informed, and argued honestly, with respect for responsible opposing viewpoints.&quot;","torrent":{"xt":"urn:btih:e3e2abec5ac28e322e13141afc25ba1914ae78ad","amp;dn":"Oil+Panic+and+the+Global+Crisis+-+Predictions+and+Myths","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3e2abec5ac28e322e13141afc25ba1914ae78ad","infoHashBuffer":{"type":"Buffer","data":[227,226,171,236,90,194,142,50,46,19,20,26,252,37,186,25,20,174,120,173]},"announce":[],"urlList":[]}}