{"title":"Stories-David Blue; audiophile vinyl rip, SME30 turtable","uid":12313916,"size":195151690,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e492306e857d8f125f229a46e30399b3b10e5662&amp;dn=Stories-David+Blue%3B+audiophile+vinyl+rip%2C+SME30+turtable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rontoolsie","files":8,"time":1440956642,"description":"With his fourth album, Stories, David Blue joined Asylum Records, the label headed by David Geffen that had been set up to shelter singer/songwriters like Jackson Browne. For Blue, it was another welcoming home after stints at similarly artist-friendly Elektra and Reprise, and Stories was a continuation of his explorations of the personal relationships of sensitive people. The opening song was called &quot;Looking for a Friend,&quot; and that was a good introduction to an album that was about the ups and downs of friendship and the loneliness that sets in when friends are not around. Musically, the album was divided between its two LP sides, each containing four songs. On the first four, the arrangements tended to be limited to two acoustic guitars, while the second half used more extensive instrumentation, including Pete Jolly's accordion on &quot;Marianne,&quot; the piano-with-strings &quot;Fire in the Morning&quot; (the chart done by Jack Nitzsche), the full-on rock band playing on &quot;Come on John,&quot; and piano/organ folk-rock for &quot;The Blues (All Night Long),&quot; with Ry Cooder adding slide guitar. Blue's lyrical reflections, expressed in his matter-of-fact baritone, touched on experiences that ranged from temporary romantic contentment to suicidal urges. &quot;It wasn't easy, when I think about it/Living in the house of changing faces,&quot; he sang in the chorus of &quot;House of Changing Faces,&quot; &quot;I still have the tracks to remind me what life was like, high and wasted/When I wanted to die.&quot; That wasn't the only song to allude to drug use. The most explicit was &quot;Come on John&quot; (previously recorded by Helen Reddy), a cautionary tale for a friend that left little doubt about its subject when it began, &quot;I've got a friend with a habit/A habit of runnin' away/He says he can't take it/But he takes it every day.&quot; Musically, the song had the feel of Bob Dylan's &quot;Ballad of a Thin Man,&quot; but for once Blue didn't sound so much like Dylan on Stories as he did like Leonard Cohen. In fact, there was one song that might have been a direct response to Cohen. It's hard not to at least speculate that &quot;Marianne&quot; may share a subject with Cohen's &quot;So Long, Marianne,&quot; particularly because of the musical similarity and because of the lines &quot;I knew her from another song her older poet, he'd wrote before/We played in the morning, laughing on the floor/Till he came a-knocking on the Lower East Side door.&quot; Although Blue, too, seemed not have stayed with her, he made a point of countering Cohen's farewell, singing in the chorus, &quot;Do not cry, you have helped me, I will not say goodbye.&quot; Whether or not this is the same Marianne, however, she is another friend described by Blue in a series of songs about a community of companions who love and lose each other, yet whatever their fates, he seemed grateful to them all. [Rhino's Wounded Bird subsidiary reissued Stories on CD in 2006.]\n\nThis LP was transcribed using the SME30 turntable, a Graham 2.2 tonearm, a Jan Allaerts cartridge and a custom built all-tube phono stage","torrent":{"xt":"urn:btih:e492306e857d8f125f229a46e30399b3b10e5662","amp;dn":"Stories-David+Blue%3B+audiophile+vinyl+rip%2C+SME30+turtable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e492306e857d8f125f229a46e30399b3b10e5662","infoHashBuffer":{"type":"Buffer","data":[228,146,48,110,133,125,143,18,95,34,154,70,227,3,153,179,177,14,86,98]},"announce":[],"urlList":[]}}