{"title":"Young Jesus Chronicles - A Cartoon Collection (Digital)","uid":11840403,"size":19300652,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e51ddfb7620a8a4b3b5fee3d84b19c635275af35&amp;dn=Young+Jesus+Chronicles+-+A+Cartoon+Collection+%28Digital%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LeonardTSpock","files":1,"time":1429853117,"description":"This actually made me laugh a few times. Cute and funny in a very irreverent way.\n\n------------------------------------------------------\n\nYoung Jesus Chronicles\n\nA Cartoon Collection by Spencer Smith and Mark Penta\n\nAndrews McNeel Publishing, 2010, 78 pages\n\nOriginally a self-published book, this lighthearted and clever collection of cartoons depicts Jesus as a modern youngster, and will appeal to anyone who paid attention in Bible school.\n\nThough biblical scholars have searched for centuries, little is known about the childhood of Jesus. Fortunately, this incomplete picture gives Spencer Smith and Mark Penta ample room for their entertaining and highly imaginative cartoon book Young Jesus Chronicles.\n\nWith a tongue-in-cheek premise that the book is the result of a recently unearthed account of Jesus's formative years as deciphered by Vatican-authorized experts (that is, cartoonists Smith and Penta), Young Jesus Chronicles is a clever and lighthearted collection of cartoons that celebrates the joy of puns and wordplay as much as it rewards you for paying attention in Sunday Bible school.\n\nWe may never know the answer to the question, WWJD (What Would Jesus Draw)? But there's a chance (albeit very slim) the answer might be a cartoon memoir of His childhood similar to Young Jesus Chronicles","torrent":{"xt":"urn:btih:e51ddfb7620a8a4b3b5fee3d84b19c635275af35","amp;dn":"Young+Jesus+Chronicles+-+A+Cartoon+Collection+%28Digital%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e51ddfb7620a8a4b3b5fee3d84b19c635275af35","infoHashBuffer":{"type":"Buffer","data":[229,29,223,183,98,10,138,75,59,95,238,61,132,177,156,99,82,117,175,53]},"announce":[],"urlList":[]}}