{"title":"Vietnam Firebases 1965-73: American and Australian Forces","uid":11932137,"size":18459453,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e543edd48450434ad127e8125273cb4298841a65&amp;dn=Vietnam+Firebases+1965-73%3A+American+and+Australian+Forces&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1431834808,"description":"Impressive in terms of scale and structure, the Fire Support Base became a dominant element in ground maneuver during the Vietnam War. Initially a mobile base, it soon evolved into a semi-permanent and more sophisticated fortress as a result of enemy counterattacks and bombardments.\n\nAs a consequence, the majority of US and other allied troops found themselves pinned down in defensive or support roles, rather than being free to conduct 'search and destroy' or other mobile missions. Thus, the first and foremost function of the Fire Support Base was defensive. Troops, machine guns, mortars, artillery, surveillance radars, and command centers all had to be dug into bunkers and fire trenches by nightfall of the first day. Around these positions there would be deep belts of barbed wire, generously scattered with several different types of mines and even, in a few cases after 1967, with a brand new series of electronic sensors to detect and locate the enemy at a distance.\n\nWith the benefit of the on-site howitzers, the FSB could also deliver offensive high volume fire, reaching as far as 14,600m and eliminating enemy firing sites, supporting friendly infantry operations, or simply participating in fire missions where exact targets were not known. In fact, the fort offered such a degree of support and protection that ground maneuver was eventually hampered by the troop's reluctance to leave the comfort and safety of the FSB.\n\nWith a description of the design, development and operational history of the Fire Support Base, this book provides the key to understanding one of the main assets of US battle strategy in the Vietnam War","torrent":{"xt":"urn:btih:e543edd48450434ad127e8125273cb4298841a65","amp;dn":"Vietnam+Firebases+1965-73%3A+American+and+Australian+Forces","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e543edd48450434ad127e8125273cb4298841a65","infoHashBuffer":{"type":"Buffer","data":[229,67,237,212,132,80,67,74,209,39,232,18,82,115,203,66,152,132,26,101]},"announce":[],"urlList":[]}}