{"title":"Game of Thrones S05E01-08 Unknown x264-Xclusive","uid":11980382,"size":3855908844,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e5d0818f100a11faeca5ba5ac45cbc618afb1ae1&amp;dn=Game+of+Thrones+S05E01-08+Unknown+x264-Xclusive&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"satrioze","files":2,"time":1433179776,"description":"S5, Ep1\n12 Apr. 2015\nThe Wars to Come\nCersei and Jaime adjust to a world without Tywin. Tyrion and Varys arrive at Pentos. In Meereen, a new enemy emerges. Jon is caught between two kings. \n\n\nS5, Ep2\n19 Apr. 2015\nThe House of Black and White\nArya arrives in Braavos. Jamie takes on a secret mission. Ellaria Sand seeks revenge for Oberyn's death. Stannis makes Jon a generous offer as the Night's Watch elects a new Lord Commander. Daenerys is faced with a difficult decision. \n\n\nS5, Ep3\n26 Apr. 2015\nHigh Sparrow\nTommen and Margaery wed. Arya has trouble adapting to her new life. Littlefinger reveals his plans to Sansa. Jon gives his first orders as Lord Commander. Tyrion and Varys arrive in Volantis. \n\n\nS5, Ep4\n3 May 2015\nSons of the Harpy\nJorah Mormont sets sail alongside his prisoner, Tyrion. Cersei makes a move against the Tyrells. Jaime and Bronn sneak into Dorne. Ellaria and the Sand Snakes make their plans. Melisandre tempts Jon. The Harpies attack. \n\n\nS5, Ep5\n10 May 2015\nKill the Boy\nDaenerys arrests the heads of Meereen's great families. Jon makes a difficult decision. Theon is forced to face Sansa. Stannis rides south. Tyrion and Jorah enter the ruins of Old Valyria. \n\n\nS5, Ep6\n17 May 2015\nUnbowed, Unbent, Unbroken\nArya is put to the test. Tyrion and Jorah are captured by slavers. Loras Tyrell is judged by the Sparrows. Jamie and Bronn face the Sand Snakes. Sansa marries Ramsay Bolton. \n\n\nS5, Ep7\n24 May 2015\nThe Gift\nJon heads east as trouble begins to stir for Sam and Gilly at Castle Black. Sansa asks Theon for help. Tyrion and Jorah are sold as slaves. Cersei savors her triumph over the Tyrells as new plots are developed in the shadows. \n\n\nS5, Ep8\n31 May 2015\nHardhome\nTyrion advises Daenerys. Sansa forces Theon to tell her a secret. Cersei remains stubborn. Arya meets her first target. Jon and Tormund meet with the Wildling Elders before the White Walkers attack","torrent":{"xt":"urn:btih:e5d0818f100a11faeca5ba5ac45cbc618afb1ae1","amp;dn":"Game+of+Thrones+S05E01-08+Unknown+x264-Xclusive","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5d0818f100a11faeca5ba5ac45cbc618afb1ae1","infoHashBuffer":{"type":"Buffer","data":[229,208,129,143,16,10,17,250,236,165,186,90,196,92,188,97,138,251,26,225]},"announce":[],"urlList":[]}}