{"title":"POtHS - The Word - 048 - Subtlety by Shieldoftheson","uid":12085793,"size":7513781958,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e65d598dc2799196c64e09223c817f2164f4a14e&amp;dn=POtHS+-+The+Word+-+048+-+Subtlety+by+Shieldoftheson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":124,"time":1435899165,"description":"This download includes the following sermons from shieldoftheson that discuss many important issues effecting the modern church.  We hope that these sermons will lift your spirits and bring you closer to our Lord and Savior. \n\nNo Other God:\nShieloftheson discusses the conditions of idol worship upon the minds of people.\n\nRebellion in Churches:\nThe secret evils of American church groups as presented by shieldoftheson.\n\nNews and Questions:\nA video about certain questions and news stories pertaining to the recent events in Hollywood.\n\nRender Unto God What Is God's:\nShieldoftheson discusses &quot;Why truth is not spoken at local churches.&quot;\n\nSerpent Seed Doctrine:\n&quot;Serpent Seed&quot; Doctrine gives listeners a fundamental overview of the original sin and the truth about the deceptions of a possible dual-seedline.\n\nSubtle Racism:\nThe nature of modern racism in America and elsewhere.  The subtle invasion or the invasion of subtlety?  Stop being deceived as this message is widespread amongst varying agendas to perverse the minds of the people.  Aside from the issue of racism, is this happening to you in other areas of your life?  Think hard and look at yourself from the outside inward and determine if you are acting as the person you believe.  These subtle traps exists all throughout society easily ensnaring the ideals and beliefs that govern our thoughts, actions and behaviors simply due to the feelings of belonging, importance or pleasure.  Yet all rely on one's unwillingness to correctly follow the word of God, replacing His word by that of man's and man's related misconceptions or grand &quot;what if's&quot; to sway our minds away from the many truths in God's word.  Where are you heading?  That is the ultimate question, please give it some thought.\n\nThe Joan Rivers Case:\nA look into the death of Joan Rivers and the answer to many questions that have arised lately pertaining to the industry, government and their influence on society.\n\nThe Urban Nightmare:\nShieldoftheson presents the truth about the history of the government controlled drug-trade and its global impact.\n\nUnderstanding the Times:\nThe struggles of Christians today.  A shieldoftheson discussion on the what's and why's that many Christians fail to comprehend and pastors seem to neglect.\n\nAlso includes folders of...\nSigns - Part 71:\nA folder series compiled of various short clips presenting recent apocalyptic signs occurring around the world today to help us identify the state of affairs ushering the end of days.  View what's been happening in our time and descern for yourself the onset of Revelations and what still may lay ahead before the comming of our Lord.  \n\nShorts:\nA variety of videos describing recent events and short exerts of sermons\n\nXtras folder:\nNoteworthy current news and events","torrent":{"xt":"urn:btih:e65d598dc2799196c64e09223c817f2164f4a14e","amp;dn":"POtHS+-+The+Word+-+048+-+Subtlety+by+Shieldoftheson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e65d598dc2799196c64e09223c817f2164f4a14e","infoHashBuffer":{"type":"Buffer","data":[230,93,89,141,194,121,145,150,198,78,9,34,60,129,127,33,100,244,161,78]},"announce":[],"urlList":[]}}