{"title":"Southeast Asia - An Introductory History - Milton Osborne","uid":11962313,"size":2370853,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e6763e4a16f2896282b79fe2a56819ca36b2c093&amp;dn=Southeast+Asia+-+An+Introductory+History+-+Milton+Osborne&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1432584946,"description":"The first edition of Southeast Asia: An introductory history was published in 1979 and immediately filled a need for travellers and students interested in a tantalisingly different part of the world. Subsequent editions (translated into Japanese, Khmer, Korean and Thai) have continued to document with great perception the enormous changes and dramatic growth experienced in the region.Dr Milton Osborne has been a resident, student and fascinated observer of Southeast Asia for over 50 years. This familiarity has resulted in a highly readable and lively chronicle. While giving due regard to the early history of the region, Osborne concentrates on the changes that have taken place since the eighteenth century: the impact of colonial rule, economic transformations of the 19th and 20th centuries, the emergence and triumph of the independence movements, the impact of social change and the pivotal roles played by religion, ethnic minorities and immigrant groups. He also provides an introduction to the art of the region and a comprehensive guide to literature about Southeast Asia.Clearly written and extensively illustrated this eleventh edition of Southeast Asia: An introductory history remains a classic in the field.'While deepening our understanding of Southeast Asia, this fine introduction reminds us of the importance of history itself. ' - Anthony Milner, Basham Professor of Asian History, Australian National University","torrent":{"xt":"urn:btih:e6763e4a16f2896282b79fe2a56819ca36b2c093","amp;dn":"Southeast+Asia+-+An+Introductory+History+-+Milton+Osborne","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6763e4a16f2896282b79fe2a56819ca36b2c093","infoHashBuffer":{"type":"Buffer","data":[230,118,62,74,22,242,137,98,130,183,159,226,165,104,25,202,54,178,192,147]},"announce":[],"urlList":[]}}