{"title":"Breaking.Borders.Series.1.04of10.Tears.and.Tunnel.of.Hope.in.Sar","uid":12049564,"size":1012952461,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:e85438cba0188a9093d373e33c53b7400e8d174e&amp;dn=Breaking.Borders.Series.1.04of10.Tears.and.Tunnel.of.Hope.in.Sar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"artistharry","files":1,"time":1434972224,"description":"Breaking Borders: Series 1\n\nSociopolitical Documentary hosted by Mariana van Zeller and Michael Voltaggio, published by Travel Channel UK in 2015 - English narration\n    &lt;a href=&quot;\nhttp://docuwiki.net/images/2/2e/Breaking-Borders-Series-1-Cover.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/images/2/2e/Breaking-Borders-Series-1-Cover.jpg&lt;/a&gt;\n\nInformation\n------------------------------\n\nBreaking Borders: Series 1\nBreaking Borders follows seasoned journalist Mariana van Zeller and acclaimed chef Michael Voltaggio as they travel into conflict zones to get the story behind the story. Together, they have a unique and challenging goal: To gather people from all sides of the conflict to break bread and explore the issues that divide them.\nIn each episode, van Zeller and Voltaggio take viewers on a journey through a different country in conflict. They meet people affected by the unrest, while exploring the history and culture that has created it. As van Zeller digs deeper into the issues, Voltaggio goes on a culinary adventure, collecting ideas and ingredients to create an unbelievable meal inspired by the people he has met.\n\n\n1)  Mother of All Conflicts \nMariana van Zeller and Michael Voltaggio travel to Israel and Palestine to bring both sides together for a meal and conversation. They get caught in the streets of Hebron among locals, soldiers and settlers as they explore the holiest sites on Earth.\n\n2)  Bloody Saturday in Ireland \nMariana and Michael travel to Northern Ireland to bring Catholics and Protestants together for a meal and conversation. They witness heated clashes during marching season, sip on Guinness and dine in the Crumlin Road Jail.\n\n3)  Detained in Egypt \nMariana van Zeller and Michael Voltaggio visit Egypt to bring guests with rivaling views on the country's future together for a meal and debate. They are confronted by the police, have their passports confiscated and ride camels near the pyramids.\n\n4)  Tears and Tunnel of Hope in Sarajevo \nJournalist Mariana van Zeller and Chef Michael Voltaggio visit Sarajevo, Bosnia and Herzegovina, to see how 3 groups coexist after ethnic cleansing wiped out thousands. They walk down Sniper Alley, visit the Tunnel of Hope, and hear the story of the &quot;Romeo and Juliet&quot; of Sarajevo.\n\n5)  Dying for the American Dream \nJournalist Mariana van Zeller and chef Michael Voltaggio drive to the US-Mexico border to see a conflict that exists in our own backyard: immigration. Mariana and Michael talk to men who search for illegal immigrants and hear stories of migrants trying to cross the border.\n\n6)  Tortured Past and Present in Kashmir \nMariana and Chef Michael visit Kashmir to learn about the conflict that threatens its existence: to be part of India, part of Pakistan or its own independent state. Mariana and Michael walk through heavily guarded streets and visit a floating market.\n\n7)  Vintage Cars Cigars and New Freedom in Cuba \nThe last TV crew to enter Cuba before the announcement of the 50-year embargo being lifted, Mariana van Zeller and Michael Voltaggio go to the communist island to talk about the state of the nation, what has changed, and the future expectations and hopes.\n\n8)  Gorillas and Growth in Rwanda \nMariana and Michael travel to Rwanda, which experienced unprecedented genocide in 1994. They visit the Nyamata Church, where thousands of Tutsis were killed, and trek through the mountains to get up-close with the amazing gorilla.\n\n9)  Fields and Dreams in Cambodia \nAfter Pol Pot's reign of terror, Mariana van Zeller and Michael Voltaggio visit a rebuilding Cambodia. They travel to the Killing Fields, where millions of citizens were murdered; feed roaming moneys in Angkor; and dine with Pol Pot's assistant.\n\n10)  Cyprus Island of Hope \nMariana and Michael go to Cyprus, an island nation where religious violence split a city in 2, creating tension and the need for United Nations protection. They explore an abandoned airport, fish near a ghost town and dine in the buffer zone.\n\n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;7038191718303c445e41&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt;\n * Video Bitrate: 3185 Kbps\n * Video Aspect Ratio: 1.778 (16:9)\n * Video Resolution: 1280 x 720\n * Audio Codec: AAC LC\n * Audio English\n * Audio Bitrate: 160 kb/s VBR 48 KHz\n * Audio Channels: Stereo 2\n * Run-Time: 43mins\n * Framerate: 23.970 fps\n * Number of Parts: 10\n * Container Mp4\n * Part Size: 965 MB average\n * Source: HDTV\n * Encoded by: Harry65\n\n1)  Further Information \n * [https://www.tvrage.com/shows/id-48088 www.tvrage.com]","torrent":{"xt":"urn:btih:e85438cba0188a9093d373e33c53b7400e8d174e","amp;dn":"Breaking.Borders.Series.1.04of10.Tears.and.Tunnel.of.Hope.in.Sar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e85438cba0188a9093d373e33c53b7400e8d174e","infoHashBuffer":{"type":"Buffer","data":[232,84,56,203,160,24,138,144,147,211,115,227,60,83,183,64,14,141,23,78]},"announce":[],"urlList":[]}}