{"title":"Assassin's Creed Pirates v1.4.0","uid":10821011,"size":1877160576,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:e8a491ab014cadeba4c962a35d1f2d58e4f13fe3&amp;dn=Assassin%27s+Creed+Pirates+v1.4.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dougstamper","files":-1,"time":1408533151,"description":"\nPlay as Alonzo Batilla, a young and ambitious captain, a pirate eager to take on the fiercest of enemies...\n\nBreak all the rules, challenge empires and make your own fortune!\n\nENGAGE IN BRUTAL NAVAL COMBATS\nFight in real-time naval battles all over the Caribbean Sea.\nChoose from a wide range of weapons to destroy your enemies and become a true pirate legend!\n\nBUILD UP YOUR CREW AND YOUR SHIP\nAcquire the most iconic boats of the Golden Age of Piracy; ranging from the smallest gunboat to the Man O'War floating fortress\nUpgrade your vessel using the massive bounty plundered from your encounters\nRecruit the finest crew members and learn more than 50 new pirating techniques to become a better captain and the true master of naval combat.\n\nDISCOVER GROUNDBREAKING 3D VISUALS ON MOBILE AND TABLETS\nChanging weather conditions directly impact the gameplay and redefine every landscape.\nBeware of storms and of the treacherous fog that will conceal your enemies until the last moment!\nBask in the West-Indies sunshine, admire beautiful sunsets and sail through the night along breathtaking coastlines.\n\nEXPLORE THE IMMENSITY OF THE CARRIBEAN\nSail throughout a vast array of islands as you explore a Caribbean huge map\nEnjoy more than 50 story and side missions, search for nearly one hundred treasures and lost parchments and compete with your friends for the highest bounty.\n\nEMBARK ON AN EPIC QUEST FOR A LEGENDARY TREASURE\nLive an adventure that will reveal the truth about La Buse's mysterious lost treasure.\nCross paths with Assassins and Templars and take part in their age-old struggle.\nMeet the most notorious and colorful pirates of the era, including Sam Bellamy, Ben Hornigold and Blackbeard!\n\nAssassin's Creed Pirates is fully compatible with tablets.\n\nGame available in: English, French, Italian, German, Spanish, Brazilian Portuguese, Chinese, Japanese, Korean and Russian.\n\nWhat's new in this version :\n- Major Update with new gameplay features: Go Whale Hunting and Collect 50 species of Caribbean fish!\n- Unlock 2 New Ships and battle 6 impressive historical Bosses\n- Challenge yourself to remain the last one standing in the new Survival Mode\n- Unlock the New Playground and complete brand-new missions\n\n\nBy Doug Stamper","torrent":{"xt":"urn:btih:e8a491ab014cadeba4c962a35d1f2d58e4f13fe3","amp;dn":"Assassin%27s+Creed+Pirates+v1.4.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8a491ab014cadeba4c962a35d1f2d58e4f13fe3","infoHashBuffer":{"type":"Buffer","data":[232,164,145,171,1,76,173,235,164,201,98,163,93,31,45,88,228,241,63,227]},"announce":[],"urlList":[]}}