{"title":"The flash seoson 1 episode 23 - Fast enough 720p MP4","uid":11952588,"size":713860128,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e9cf80430f96c285cf659ff12e61b961edf816bf&amp;dn=The+flash+seoson+1+episode+23+-+Fast+enough+720p+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bakerskater23","files":2,"time":1432224146,"description":"The flash - Fast enough - episode 23 - seoson Finale\n\nBarry visits Wells where Wells describes their relationship in the future, why he killed Barry's mother, and why he ultimately had to help Barry become the Flash. Wells also propositions Barry, requesting help creating a wormhole where Wells can return to his time, while also allowing Barry to go back in time to save his mother. Barry and the team are conflicted, as this could alter the timeline in an undeterminable way. Barry decides to go through with it, so Wells informs him that he will need to turn the particle accelerator on and then super speed at the right velocity into a hydrogen particle to create a wormhole. Barry will have less than 2 minutes to change the past, or the wormhole will create a black hole that could destroy the world. Barry successfully travels back in time, but his future self motions him not to save their mother. Instead, Barry identifies himself and reassures Nora that he is safe in the future before she dies. Barry returns and stops Wells from returning to his time. Before Wells can kill Barry, Eddie shoots himself causing Wells, as he is reverted back into Eobard, to be erased from existence. The team is unable to prevent the black hole from being created, and Barry super speeds into it in an effort to stop it","torrent":{"xt":"urn:btih:e9cf80430f96c285cf659ff12e61b961edf816bf","amp;dn":"The+flash+seoson+1+episode+23+-+Fast+enough+720p+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9cf80430f96c285cf659ff12e61b961edf816bf","infoHashBuffer":{"type":"Buffer","data":[233,207,128,67,15,150,194,133,207,101,159,241,46,97,185,97,237,248,22,191]},"announce":[],"urlList":[]}}