{"title":"Evitaï¼š The Motion Picture Music Soundtrack","uid":12071056,"size":262585288,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e9fdba2d9181b72d34dd95c1e8696d4329904a11&amp;dn=Evita%EF%BC%9A+The+Motion+Picture+Music+Soundtrack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Big-Papi","files":38,"time":1435516168,"description":"Source: 1996 CD\n \n[img]https://yuq.me/users/15/891/5sj0Nrtbfi.png[/img]\n \n\n\nBy Marijan Bosnar\n \n[quote]Over the years Andrew Lloyd Webber has made many musicals, some more successful and appealing to the public than the others. Most people will, however, agree that &quot;Evita&quot; remains one of his most satisfying works to this date. Numerous reasons confirm this statement. Just like in its predecessor &quot;Jesus Christ Superstar&quot;, &quot;Evita&quot; is almost entirely sung-through; the lyrics are witty and appropriate; the subject matter is again a personality larger-than-life who rises from obscurity and dies at the peak of its fame, thus becoming a legend; the score is captivating and appealing to the listener, at home or in the theatre.\n\nAnd yet the road to the movie version of Evita was a rocky one: It took 20 years of negotiations with different studious, directors (Francis Ford Coppola was in the game at one point), and actresses (both Meryl Streep and Michelle Pfeiffer were considered) to make it happen. When it was finally in the bag, Alan Parker took the director's seat and Oliver Stone helped with the adaptation. Before the movie came about, we had 3 major recordings of Evita: the 1976 concept with Julie Covington, the 1978 London cast highlights album starring Elaine Paige and the 1979 Broadway cast full album with a Tony-winning Patti LuPone; all three of them excellent in their own right. This 2-disc movie soundtrack can join them as another fine recording of the material. The story of Evita is widely known, but for those who are new to this let's repeat the essentials: We follow the life story of Eva Duarte Peron, wife of post-World war two president of Argentina, Juan Peron. However, the musical is very loosely based on the actual life of the real Evita. The story follows Evita from the day of her death in July 1952, and then we have flashbacks until that moment, covering her coming to Buenos Aires, alleged love affairs, meeting Peron, being the first lady and dying of cancer at 33.\n\nThis recording contains almost entire movie, minus the few irrelevant sequences. It boasts with several advantages. First, the whole score sounds extremely fresh and polished, probably because it uses a much larger orchestra than the recordings mentioned above and since re-orchestrations were done in a best possible way, not threatening the integrity of the score. The epic sound of this recording remains thusly unmatched, both in the musical and the chorus parts.\n\nThen, it shows how wisely the changes were made in order to adapt the stage version for the big screen. So we have some parts included from the concept recording that were later omitted in the stage version, mainly, &quot;The lady's got potential&quot;, a very powerful number, explaining Juan Peron's climb to power, here used with new lyrics written by Tim Rice, instead &quot;The art of the possible&quot;, which worked much better visually on the stage. Some additional omissions were made, for example, &quot;Eva's sonnet&quot; was left out completely, and a song called &quot;Another suitcase in another hall&quot;, originally sung by Peron's mistress, is here sung by Eva, but it works perfectly, since the lyrics blend with her character as well. Some lyrics, too critical towards the Perons, were also dropped. A brand new song was written by Lloyd Webber and Rice for the character of Eva, called &quot;You must love me&quot;, a beautiful ballad that rightfully won the 1997 Best Song Academy Award. It proves that ALW and Tim Rice were the best of collaborators.\n\nOne of the reasons that makes this movie and the recording so successful is its perfect cast. There were numerous doubts when it was announced that Madonna will play the lead in the movie version. I've never been much of her fan, but one has to hand it to her here: she handled the role in the best way. Her voice may not have the strength of Patti LuPone, but she can certainly hold a tune. What's more, she does it really good, especially as the movie evolves and her melodies become more demanding. She actually managed to find the appropriate dose of insecurity (&quot;Another suitcase in another hall&quot;, &quot;Waltz for Eva and Che&quot;), determination (&quot;A new Argentina&quot;) and sadness (&quot;Eva's final broadcast&quot;, &quot;Lament&quot;). Besides, if you see the movie, you'll find her acting quite plausible as well. Her male counterparts were also prudently chosen. Who would have guessed that Antonio Banderas can actually sing in a good manner? His Che rocks and he is as good and strong in his vocals and performances as were David Essex and Colm Wilkinson. Jonathan Pryce, the famous Engineer from Miss Saigon, is a dignified Peron, but his potential is mostly unused, because Peron is only a supporting character. And let us not forget Jimmy Nail as the sleazy tango singer Augustin Magaldi. Each of the principal singers managed to find its vocal uniqueness in a best possible way.\n\nThe CD comes with a couple of black and white movie photos and an excellent sound quality, but unfortunately, the lyrics are not included.\n\nFor those of you who are getting acquainted with the story of Eva Peron for the first time I must point out: Bear in mind that this musical is only loosely based on the life of the real Evita. As much as Tim Rice's lyrics are craftily made, they lack a lot of historical accuracy. As a historian I became very interested in Eva Peron's life story so I did some research after seeing the movie. It turned out that the authors based their entire work on a single book called EVITA: THE WOMAN WITH A WHIP by Mary Main. It was based on rumors, lies and myths, written with the single purpose of slandering Eva Peron as much as possible. It contains no footnotes and no bibliography. The authors used it mainly because it was one of the few books available on the subject in the English language during the 70-is. So one should be very careful in making any conclusions based on the musical or the movie alone.\n\nSo, conclusively, this Evita soundtrack and the whole movie show just how musicals are supposed to be transferred from the stage to the screen, with the changes done in a most satisfying way. Also, it emphasizes just how important the right casting is. Some of the reasons why many fans of Lloyd Webber's &quot;The phantom of the opera&quot; (myself included) felt that the movie version of it wasn't satisfying were the fact that Gerard Butler just didn't have the right vocal equipment for the score, nor the looks (he looked more like Elvis Presley than like the Phantom), combined with some poorly made changes to the material. It's amazing how much a badly chosen cast can ruin the best musical materials. We can only hope that Lloyd Webber won't make the same mistakes with his upcoming movie version of &quot;Sunset Boulevard&quot;. This brings us back to Evita movie soundtrack. All the pieces of the puzzle were assembled rightly and it really shows. Because of that, the musical theatre fans should find an empty spot on their CD shelves with no trouble.[/quote]\n \n[b]&quot;Argentina la la la&quot;[/b]\n[image=izHAYl6a7T]","torrent":{"xt":"urn:btih:e9fdba2d9181b72d34dd95c1e8696d4329904a11","amp;dn":"Evita%EF%BC%9A+The+Motion+Picture+Music+Soundtrack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9fdba2d9181b72d34dd95c1e8696d4329904a11","infoHashBuffer":{"type":"Buffer","data":[233,253,186,45,145,129,183,45,52,221,149,193,232,105,109,67,41,144,74,17]},"announce":[],"urlList":[]}}