{"title":"Electrical Machines: Mathematical Fundamentals of Machine Topolo","uid":11965008,"size":7503874,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ea0cbe3a573a7ea85d08cf35d7d0a6154469a2b3&amp;dn=Electrical+Machines%3A+Mathematical+Fundamentals+of+Machine+Topolo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NoctDeath","files":2,"time":1432650063,"description":"Title: Electrical Machines: Mathematical Fundamentals of Machine Topologies\nSeries: Mathematical Engineering\nAuthor: Dieter Gerling\nFormat: PDF\nHardcover: 472 pages\nPublisher: Springer; 2015 edition (September 18, 2014)\nLanguage: English\nISBN: 9783642175831\n\nElectrical Machines and Drives play a vital role in industry with an ever increasing importance. This fact necessitates the understanding of machine and drive principles by engineers of many different disciplines. Therefore, this book is intended to give a comprehensive deduction of these principles. Special attention is given to the precise mathematical deduction of the necessary formulae to calculate machines and drives, and to the discussion of simplifications (if applied) with the associated limits. So the book shows how the different machine topologies can be deduced from general fundamentals, and how they are linked.\n\nThis book addresses graduate students, researchers and developers of Electrical Machines and Drives, who are interested in getting knowledge about the principles of machine and drive operation and in detecting the mathematical and engineering specialties of the different machine and drive topologies together with their mutual links. The detailed, but compact mathematical deduction, together with a distinct emphasis onto assumptions, simplifications and the associated limits, leads to a clear understanding of Electrical Machine and Drive topologies and characteristics","torrent":{"xt":"urn:btih:ea0cbe3a573a7ea85d08cf35d7d0a6154469a2b3","amp;dn":"Electrical+Machines%3A+Mathematical+Fundamentals+of+Machine+Topolo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea0cbe3a573a7ea85d08cf35d7d0a6154469a2b3","infoHashBuffer":{"type":"Buffer","data":[234,12,190,58,87,58,126,168,93,8,207,53,215,208,166,21,68,105,162,179]},"announce":[],"urlList":[]}}