{"title":"Biology of Women - 5th Edition (2012).pdf Gooner","uid":12064815,"size":42981514,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eb996f60687caa50fd813f0e950c07d8970d36fe&amp;dn=Biology+of+Women+-+5th+Edition+%282012%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1435361847,"description":"Publisher: Cengage Learning; 5 edition (January 1, 2012)\nLanguage: English\nISBN-10: 143540033X\nISBN-13: 978-1435400337\n\nCentered on the health of the human female throughout her lifespan, BIOLOGY OF WOMEN, 5th Edition remains the standard in the field. Written for both the medical professional and the non-major student, the authors have crafted the most scientifically relevant and contemporary book on the market today. The Fifth Edition of BIOLOGY OF WOMEN covers topics from the female reproductive system to the psychobiological and socio-cultural factors that influence a woman's nutrition and physical activity. Distinctive features include case studies, and historical, economic and social perspectives on the lives and health of women.\n\nAbout the Author\n\nTheresa M. Hornstein teaches both online and traditional classes, including cell biology, microbiology, path physiology, and botany, in the Biology Dept. at Lake Superior College in Duluth, MN. Her research interests include vermicomposting on campus, comparisons of online and in-class student success, the FIRE thinking model, edible landscaping, and natural dye products. Her outside interests include murder mysteries and fiber arts.\n\nJeri Lynn Schwerin has a Master of Science degree in Biology from University of Massachusetts, Amherst, and a Bachelor of Science degree in Biology from University of Minnesota, Duluth. She has taught and developed online science courses at Lake Superior College since 2001. She has also developed field studies courses for Lake Superior College and provided environmental outreach education about Lake Superior on board the University of Wisconsin, Superior's research vessel, the LL Smith Jr. Her interests include making pottery and photography","torrent":{"xt":"urn:btih:eb996f60687caa50fd813f0e950c07d8970d36fe","amp;dn":"Biology+of+Women+-+5th+Edition+%282012%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb996f60687caa50fd813f0e950c07d8970d36fe","infoHashBuffer":{"type":"Buffer","data":[235,153,111,96,104,124,170,80,253,129,63,14,149,12,7,216,151,13,54,254]},"announce":[],"urlList":[]}}