{"title":"Starcraft + 1151 Patch","uid":12102612,"size":680335821,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ece4a987c039d6969ebfa0661551cc487f6cdb0d&amp;dn=Starcraft+%2B+1151+Patch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"djupload","files":7,"time":1436361502,"description":"Starcraft offers a lengthy single-player campaign featuring ten missions for its three diverse races, totaling 30 single-player missions in all (there's also an unsupported veteran campaign included as part of the campaign editor). The story is compelling enough to make playing through all three worthwhile, and the campaign difficulty is tiered so that each is more challenging than the last. While this may seem like an uninteresting point, it helps Starcraft to avoid the problem that has plagued every other game in the genre: Each side is not the same. You don't have to go through a set of training missions once you've already mastered one side. The missions themselves mainly stick to the &quot;gather, build, and conquer&quot; philosophy, but there are a few innovative missions thrown in, and Blizzard has added some narrative elements to the missions themselves that help to keep things interesting. With the exception of the installation missions (in which you are given a handful of units to raid an enemy base, an attempt to break from the mold that is only occasionally successful), the missions are well designed. The solo player also has the option of skirmish missions, though the computer opponents have the annoying ability to see everything you are doing and defend accordingly, making the dreaded &quot;rush&quot; tactic one of the only viable means of emerging victorious","torrent":{"xt":"urn:btih:ece4a987c039d6969ebfa0661551cc487f6cdb0d","amp;dn":"Starcraft+%2B+1151+Patch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ece4a987c039d6969ebfa0661551cc487f6cdb0d","infoHashBuffer":{"type":"Buffer","data":[236,228,169,135,192,57,214,150,158,191,160,102,21,81,204,72,127,108,219,13]},"announce":[],"urlList":[]}}