{"title":"Beachbody RevAbs Workout","uid":12074853,"size":3229868199,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:ed8c32b9b30529d39885f8bd1d5833bc9b6fd03e&amp;dn=Beachbody+RevAbs+Workout&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MrTVGuy","files":20,"time":1435611126,"description":"If you want to get rock hard, sexy, touchable abs, then you want RevAbs, the program that absolutely guarantees the tight, toned, sexy abs of your dreams. The RevAbs fat-burning, strength-building, ab-chiseling workouts include four cardio interval workouts that will rev your metabolism to burn fat fast as you strengthen and sculpt your abs. Five core workouts continue to scorch belly fat and carve your abs by strengthening your entire mid section. Three strength training workouts will build re-muscle while every move tightens, tones and defines those abs. Why is RevAbs so effective? The secret is Abcentrics - Brett's proven training technique -- the right combination of very specific movements that work together so every moment of exercise is burning fat, shrinking your waistline and chiseling your six-pack at the same time. You make every move count and get a RevAbs result: the abs you've always wanted--fast!\n\nThis torrent does not include the advanced workouts Ultimate 8 Pack and Ab Addition. You would have to replace those in the workout calendar","torrent":{"xt":"urn:btih:ed8c32b9b30529d39885f8bd1d5833bc9b6fd03e","amp;dn":"Beachbody+RevAbs+Workout","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed8c32b9b30529d39885f8bd1d5833bc9b6fd03e","infoHashBuffer":{"type":"Buffer","data":[237,140,50,185,179,5,41,211,152,133,248,189,29,88,51,188,155,111,208,62]},"announce":[],"urlList":[]}}