{"title":"Everyone Loves a Good Train Wreck: Why We Can't Look Away","uid":11964193,"size":235603,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:efdbc4aa9820d0020cffd8224c0408a361e12fb4&amp;dn=Everyone+Loves+a+Good+Train+Wreck%3A+Why+We+Can%27t+Look+Away&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bookzilla","files":1,"time":1432640814,"description":"2012 epub\n\nWhether we admit it or not, we're fascinated by evil. Dark fantasies, morbid curiosities, Schadenfreude: as conventional wisdom has it, these are the symptoms of our wicked side, and we succumb to them at our own peril. But we're still compelled to look whenever we pass a grisly accident on the highway, and there's no slaking our thirst for gory entertainments like horror movies and police procedurals. What makes these spectacles so irresistible? In Everyone Loves a Good Train Wreck, the scholar Eric G. Wilson sets out to discover the source of our attraction to the gruesome, drawing on the findings of biologists, sociologists, psychologists, anthropologists, philosophers, theologians, and artists. A professor of English literature and a lifelong student of the macabre, Wilson believes there's something nourishing in darkness. To repress death is to lose the feeling of life, he writes. A closeness to death discloses our most fertile energies. His examples are legion and startling in their diversity. Citing everything from elephant graveyards and Susan Sontag's On Photography to the Tiger Woods sex scandal and Steel Magnolias, Wilson finds heartening truths wherever he confronts death. In Everyone Loves a Good Train Wreck, the perverse is never far from the sublime. The result is a powerful and delightfully provocative defence of what it means to be human - for better and for worse","torrent":{"xt":"urn:btih:efdbc4aa9820d0020cffd8224c0408a361e12fb4","amp;dn":"Everyone+Loves+a+Good+Train+Wreck%3A+Why+We+Can%27t+Look+Away","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efdbc4aa9820d0020cffd8224c0408a361e12fb4","infoHashBuffer":{"type":"Buffer","data":[239,219,196,170,152,32,208,2,12,255,216,34,76,4,8,163,97,225,47,180]},"announce":[],"urlList":[]}}