{"title":"The Jerky Boys 320cbr (Big Papi) 1993 Prank Call Comedy Skits","uid":11823612,"size":97570985,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:f05f53a88623c995b4ccbe20b1bf0e580c1236a3&amp;dn=The+Jerky+Boys+320cbr+%28Big+Papi%29+1993+Prank+Call+Comedy+Skits&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Big-Papi","files":25,"time":1429386205,"description":"Source: 1993 CD\n \n[img]https://yuq.me/users/15/891/7Zgm1BT3R8.png[/img]\n \n \n \n \nBy K. Brown\n[quote]The Jerky Boys were my first exposure to the &quot;crank call&quot; CD phenomenon, and at their best, the Jerky Boys perform better than many of their crank-calling peers who have followed suit with their CD releases of their own. What I like about these Jerky releases is that most of their calls leave the person on the other line puzzled or bewildered. This, in my opinion, is what makes these pranks fun, as opposed to some of their counterparts (Musacha, Tom Mabe), who have a crass and mean spirit behind many of their calls. It's as if they intend to upset their victims rather than merely &quot;play a prank.&quot; This is not to say that Los Jerkys have never made mean spirited calls that have turned me off..yes, they are guilty! But the majority of their work on the first three CDs have these rich and hysterical characters looking for the wrong kind of help in all the right places. Prime examples on this first CD would be the nasal voiced Sol Rosenburg calling to arrange an eye exam, Tarbosh &quot;The Egyptian Magician&quot; explaining in broken English his magic act to a club owner, and Jack Tors, the Gay Runway Model, trying to convince a talent agent that his performance art used in runway is appropriate! Prank phone call CDs are not everybody's cup of tea. If the cup of prank tea does sound appealing, and you never heard such an album before, this premiere CD by The Jerky Boys is a good place to start.[/quote]","torrent":{"xt":"urn:btih:f05f53a88623c995b4ccbe20b1bf0e580c1236a3","amp;dn":"The+Jerky+Boys+320cbr+%28Big+Papi%29+1993+Prank+Call+Comedy+Skits","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f05f53a88623c995b4ccbe20b1bf0e580c1236a3","infoHashBuffer":{"type":"Buffer","data":[240,95,83,168,134,35,201,149,180,204,190,32,177,191,14,88,12,18,54,163]},"announce":[],"urlList":[]}}