{"title":"William Blake - Complete Poetry, Prose &amp; Letters (8 books)","uid":12081900,"size":69958971,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f21c2ca236b8997f45bc819af95e30774ab8bd6c&amp;dn=William+Blake+-+Complete+Poetry%2C+Prose+%26amp%3B+Letters+%288+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"workerbee","files":15,"time":1435792090,"description":"\nWILLIAM BLAKE (1757-1827) was an English poet, painter, and printmaker.  Largely unrecognised during his lifetime, Blake is now considered a seminal figure in the history of the poetry and visual arts of the Romantic Age.  His prophetic poetry has been said to form &quot;what is in proportion to its merits the least read body of poetry in the English language.&quot;  His visual artistry led one contemporary art critic to proclaim him &quot;far and away the greatest artist Britain has ever produced.&quot;  Although he lived in London his entire life (except for three years spent in Felpham), he produced a diverse and symbolically rich oeuvre, which embraced the imagination as &quot;the body of God&quot; or &quot;human existence itself&quot;.\n\nAlthough Blake was considered mad by contemporaries for his idiosyncratic views, he is held in high regard by later critics for his expressiveness and creativity, and for the philosophical and mystical undercurrents within his work.  His paintings and poetry have been characterised as part of the Romantic movement and as &quot;Pre-Romantic&quot;.  Reverent of the Bible but hostile to the Church of England (indeed, to all forms of organised religion), Blake was influenced by the ideals and ambitions of the French and American Revolutions.  Though later he rejected many of these political beliefs, he maintained an amiable relationship with the political activist Thomas Paine; he was also influenced by thinkers such as Emanuel Swedenborg.  Despite these known influences, the singularity of Blake's work makes him difficult to classify.  The 19th-century scholar William Rossetti characterised him as a &quot;glorious luminary&quot;, and &quot;a man not forestalled by predecessors, nor to be classed with contemporaries, nor to be replaced by known or readily surmisable successors.&quot;\n\n\nThe following books are in ePUB or PDF format as indicated:\n\n* COLLECTED POEMS (Routledge, 2002).  Edited by W. B. Yeats with a new Introduction by Tom Paulin. -- PDF\n\n* THE COMPLETE POEMS (Penguin Classics, 2004).  Edited by Alicia Ostriker. -- ePUB\n\n* THE COMPLETE POEMS (Routledge, 2007).  Third edition.  Edited by W. H. Stevenson. -- PDF\n\n* THE DIVINE COMEDY ILLUSTRATIONS (Dover, 2008).  102 color plates. -- ePUB\n\n* THE LETTERS OF WILLIAM BLAKE (Scribner's, 1906).  Edited with an Introduction and Notes by Archibald G. B. Russell. -- PDF\n\n* THE MARRIAGE OF HEAVEN AND HELL (Dover, 1994).  Color plates. -- ePUB\n\n* THE POETRY AND PROSE OF WILLIAM BLAKE (Anchor, 1970).  Edited by David V. Erdman with Commentary by Harold Bloom. -- PDF\n\n* THE PORTABLE WILLIAM BLAKE (Penguin, 1974).  Edited with an Introduction by Alfred Kazin. -- ePUB\n\n_____________________________________________________________________________\n\n\n&gt;&gt; CONTACT ME\nYou may reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\n             &lt;a href=&quot;\nhttps://pirates-forum.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/User-workerbee&lt;/a&gt;  \n\n&gt;&gt; PLEASE HELP TO SEED!\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:f21c2ca236b8997f45bc819af95e30774ab8bd6c","amp;dn":"William+Blake+-+Complete+Poetry%2C+Prose+%26amp%3B+Letters+%288+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f21c2ca236b8997f45bc819af95e30774ab8bd6c","infoHashBuffer":{"type":"Buffer","data":[242,28,44,162,54,184,153,127,69,188,129,154,249,94,48,119,74,184,189,108]},"announce":[],"urlList":[]}}