{"title":"Dare Dorm 23","uid":12305164,"size":2640755502,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f30b7c00d0bf3583701e2eb7a6a3c6e899af9051&amp;dn=Dare+Dorm+23&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"irealu69","files":1,"time":1440782206,"description":"Dare Dorm 23\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nSynopsis: 100% Real submitted dorm room footage!Study GroupThis latest submission, is all about nerds getting some ass. After being teased by their jock friend for doing the homework of two girls, the nerds came up with the idea to record the girls to prove they were hot. Not only were these girls hot, but they were also willing to reward these nerds with really intense and messy blow jobs, which lead to these two geeks banging the chicks in more ways than one. All these girls cared for was getting an A in class, and all the nerds cared for was to stick their cocks in the girls vags. It was a win-win situation for all.Poke Her NiteGambling is always fun, and these college guys were having an amazing poker game going, until the girls showed up, and then it became awesome. Once the girls saw the guys playing cards, and not really paying attention to them, they decided to disrupt their game by showing their tits and making out with each other. That only made the game go from poker to truth or dare. From that point on, things got really naughty quickly. Truth or dare became just dare, and then everybody got naked. This night was a night to remember. I know the girls will.Best FriendsWhenever girls are having a slumber party, I always think that they are getting naked and pillow fighting all night, while teaching each other how to give blow jobs. Well, that's not the case for this dorm slumber party. There is no pillow fighting, and no bj class, instead there are four extremely hot naked girls, and they are teaching each other how to eat pussy. This latest daredorm submission is so hot it will definitely make you shoot your load within the first few sexual positions. You gotta watch the eating out train, or the four way kiss. I mean, this is sexy as hell guys. Enjoy.\n\nScreenshots:\n~~~~~~~~~~~~ &lt;a href=&quot;\nhttp://www.picturevip.com/x/clean/e9N&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.picturevip.com/x/clean/e9N&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.picturevip.com/x/clean/e9v&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.picturevip.com/x/clean/e9v&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.picturevip.com/x/clean/e96&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.picturevip.com/x/clean/e96&lt;/a&gt;\n\nVideos Info:\n~~~~~~~~~~~~\nSize: 2.459 GB\nDuration: 03:04:21 \t\nResolution: 720x400","torrent":{"xt":"urn:btih:f30b7c00d0bf3583701e2eb7a6a3c6e899af9051","amp;dn":"Dare+Dorm+23","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f30b7c00d0bf3583701e2eb7a6a3c6e899af9051","infoHashBuffer":{"type":"Buffer","data":[243,11,124,0,208,191,53,131,112,30,46,183,166,163,198,232,153,175,144,81]},"announce":[],"urlList":[]}}