{"title":"Franz Xaver Mozart - Piano Concerto No. 1 &amp; No. 2 - Gunhard","uid":10838194,"size":208653495,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f3ee22ac0540b29d80c60799a6ecc5cb80eabf7e&amp;dn=Franz+Xaver+Mozart+-+Piano+Concerto+No.+1+%26amp%3B+No.+2+-+Gunhard+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zyx2010","files":-1,"time":1408716795,"description":"Franz Xaver Mozart: Piano Concerto No. 1 &amp; No. 2\nGunhard Mattes, Henri Sigfridsson, International New Symphony Orchestra Lemberg\n\n\nComposer: Franz Xaver Mozart\nConductor: Gunhard Mattes\nEnsemble: International New Symphony Orchestra Lemberg\nPerformer: Henri Sigfridsson\nAlbum: Piano Concerto No. 1 &amp; No. 2\nYear: 2004\nLabel: Novalis\nGenre: Classical\n\nDescription:\n\nWolfgang Amadeus Mozart's son Franz Xaver was born four and a half months before Mozart's death, after which the cash-strapped Constanze renamed him Wolfgang Amadeus Mozart Jr. and began to groom him as another prodigy. The younger Mozart had some success as a youthful touring performer, playing his father's concertos, and he found aristocratic patrons who hired him as a piano teacher. He ended up in Lemberg, which is now L'vov, Ukraine, and never succeeded in cracking the Viennese musical scene despite his famous name.\n\nFranz Xaver was much less prolific than his father; about 50 of his pieces survive. The two piano concertos included on this disc show that he mastered Mozart's style but not his ease; everything is there but the sublime melodies. The transparent interaction between keyboard and orchestra that marks the elder Mozart's concertos, a marvelously lively thing that seems to arise from very modest resources, survives in the concertos of the son. The Piano Concerto No. 1, written when Franz Xaver was 14, is modeled on the more expansive type of Mozart concerto, perhaps the Piano Concerto No. 25 in C major, K. 503. The second concerto dates from seven years later and shows growth in the younger Mozart's piano skills; some brilliant passagework is grafted onto a rather plain thematic framework.\n\nLittle-known Finnish pianist Henri Sigfridsson and the International New Symphony Orchestra of Lemberg make a good case for this music and display the sparkling smoothness that is its best point. Other recordings of these works are rare, so this one welcome -- who has read about Franz Xaver and not wondered what his music sounded like?\n\nTracklist:\n\nConcerto for piano &amp; orchestra No. 1 in C major, Op 14\n01. Allegro maestoso\n02. Adagio\n03. Allegretto (Rondo)\n\nConcerto for piano &amp; orchestra No. 2 in E flat major, Op 25\n04. Allegro con brio\n05. Andante espressivo\n06. Allegretto (Rondo)","torrent":{"xt":"urn:btih:f3ee22ac0540b29d80c60799a6ecc5cb80eabf7e","amp;dn":"Franz+Xaver+Mozart+-+Piano+Concerto+No.+1+%26amp%3B+No.+2+-+Gunhard+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3ee22ac0540b29d80c60799a6ecc5cb80eabf7e","infoHashBuffer":{"type":"Buffer","data":[243,238,34,172,5,64,178,157,128,198,7,153,166,236,197,203,128,234,191,126]},"announce":[],"urlList":[]}}