{"title":"Kate.Humble.Living.with.Nomads.s01e01.Nepal.ENG.SUBS.WEBRIP","uid":11994803,"size":666537492,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f44d0bf181995f411cee382c747b03c670736021&amp;dn=Kate.Humble.Living.with.Nomads.s01e01.Nepal.ENG.SUBS.WEBRIP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":4,"time":1433602210,"description":"Kate.Humble.Living.with.Nomads.s01e01.Nepal.ENG.SUBS.WEBRIP\n\nIn this first episode, Kate travels to south west Nepal in search of the country's last community of nomads, the Raute people. Almost all of the Raute population has already settled in Nepal and India - just one group of 140 people remain living as nomads. These hunter-gatherers still move camp every few weeks through the steeply wooded hills and mountains in one of the poorest countries on the planet. Life for this last Raute group is increasingly tough, as they face pressure to settle from Nepal's government and hostility from the farmers on whose land they camp.\n\nThe Raute are famously private, and it proves a difficult task for Kate to get to know them. At the beginning they are wary, only engaging with her to ask for money. With perseverance and a rather unlikely rendition of Old MacDonald, Kate is slowly accepted into this tightly knit and proud community. But it's a demanding and emotional journey as she witnesses them move ever further from their ancient traditions and encounters first hand the hostility that the Raute face from mainstream Nepali society. As she helps them move camp twice, bearing heavy loads up punishingly steep hills, she comes face to face - and almost fist to fist - with the conflicts and contradictions facing Nepal's last nomads","torrent":{"xt":"urn:btih:f44d0bf181995f411cee382c747b03c670736021","amp;dn":"Kate.Humble.Living.with.Nomads.s01e01.Nepal.ENG.SUBS.WEBRIP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f44d0bf181995f411cee382c747b03c670736021","infoHashBuffer":{"type":"Buffer","data":[244,77,11,241,129,153,95,65,28,238,56,44,116,123,3,198,112,115,96,33]},"announce":[],"urlList":[]}}