{"title":"More Happy Than Not - Adam Silvera","uid":12105564,"size":1508791,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f46e5ad32bbab5218b65c244a8608afe1d4b3a26&amp;dn=More+Happy+Than+Not+-+Adam+Silvera&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1436447913,"description":"Part Eternal Sunshine of the Spotless Mind, part Aristotle and Dante Discover the Secrets of the Universe, Adam Silvera's extraordinary debut confronts race, class, and sexuality during one charged near-future summer in the Bronx.\n\nThe Leteo Institute's revolutionary memory-relief procedure seems too good to be true to Aaron Soto -- miracle cure-alls don't tend to pop up in the Bronx projects. But Aaron can't forget how he's grown up poor or how his friends aren't always there for him. Like after his father committed suicide in their one bedroom apartment. Aaron has the support of his patient girlfriend, if not necessarily his distant brother and overworked mother, but it's not enough. \n\nThen Thomas shows up. He has a sweet movie-watching setup on his roof, and he doesn't mind Aaron's obsession with a popular fantasy series. There are nicknames, inside jokes. Most importantly, Thomas doesn't mind talking about Aaron's past. But Aaron's newfound happiness isn't welcome on his block. Since he's can't stay away from Thomas or suddenly stop being gay, Aaron must turn to Leteo to straighten himself out, even if it means forgetting who he is","torrent":{"xt":"urn:btih:f46e5ad32bbab5218b65c244a8608afe1d4b3a26","amp;dn":"More+Happy+Than+Not+-+Adam+Silvera","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f46e5ad32bbab5218b65c244a8608afe1d4b3a26","infoHashBuffer":{"type":"Buffer","data":[244,110,90,211,43,186,181,33,139,101,194,68,168,96,138,254,29,75,58,38]},"announce":[],"urlList":[]}}