{"title":"Uncanny X-Men 1965 Comics [MARVEL]","uid":12105560,"size":260266016,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f4f1dca107f8d84de8ba9eb16dded29a687960d8&amp;dn=Uncanny+X-Men+1965+Comics+%5BMARVEL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"djupload","files":21,"time":1436447823,"description":"The X-Men are a fictional team of superheroes appearing in American comic books published by Marvel Comics. Created by writer Stan Lee and artist/co-writer Jack Kirby, the characters first appeared in The X-Men #1 (September 1963). They are among the most recognizable and lucrative intellectual properties of Marvel Comics, appearing in numerous books, television shows, films, and video games.\n\nThe X-Men are mutants, a subspecies of humans who are born with superhuman abilities. The X-Men fight for peace and equality between normal humans and mutants in a world where antimutant bigotry is fierce and widespread. They are led by Charles Xavier, also known as Professor X, a powerful mutant telepath who can control and read minds. Their archenemy is Magneto, a powerful mutant with the ability to generate and control magnetic fields. Professor X and Magneto have opposing views and philosophies regarding the relationship between mutants and humans. While Professor X works towards peace and understanding between mutants and humans, Magneto views humans as a threat and believes in taking an aggressive approach against them, though he has found himself working alongside the X-Men from time to time.\n\nProfessor X is the founder of Xavier's School for Gifted Youngsters at a location commonly called the X-Mansion, which recruits mutants from around the world. Located in Westchester County, New York, the X-Mansion is the home and training site of the X-Men. The founding five members of the X-Men who appear in The X-Men #1 (September 1963) are Angel (Archangel), Beast, Cyclops, Iceman, and Marvel Girl (Jean Grey); Professor X and Magneto also make their first appearances in The X-Men #1. Since then, dozens of mutants from various countries and diverse backgrounds have held membership as X-Men.\n\nThis set of X-Men comics are from 1965","torrent":{"xt":"urn:btih:f4f1dca107f8d84de8ba9eb16dded29a687960d8","amp;dn":"Uncanny+X-Men+1965+Comics+%5BMARVEL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4f1dca107f8d84de8ba9eb16dded29a687960d8","infoHashBuffer":{"type":"Buffer","data":[244,241,220,161,7,248,216,77,232,186,158,177,109,222,210,154,104,121,96,216]},"announce":[],"urlList":[]}}