{"title":"Alice in Puzzle Land, Smullyan ^ heliiaruy + hyperlinked","uid":12006704,"size":1465432,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f5b1168bed1d48a37533d6d745004851c9f11748&amp;dn=Alice+in+Puzzle+Land%2C+Smullyan+%5E+heliiaruy+%2B+hyperlinked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"heliiaruy","files":1,"time":1433906289,"description":"pdf file\n\nAlice in Puzzle-Land: A Carrollian Tale for Children Under Eighty (Dover Recreational Math)\n\n             Raymond Smullyan\n\nAlice and her friends return for another romp through Wonderland and the Looking-Glass with these eighty-eight puzzles, paradoxes, and logic problems. Raymond M. Smullyan's characters speak and behave like the originals, and their puzzles abound in typical Carrollian word play, logic problems, and dark philosophical paradoxes. Isaac Asimov described this book as &quot;amusing, entertaining, and surprisingly educational. And it might just send you back to reread Alice.&quot;\nReaders of all ages will delight in the charming stories and the wealth of ingenious puzzles. Written by a distinguished mathematician and creator of popular puzzle books, this volume requires no background in formal logic. The puzzles become progressively more complex, and complete solutions appear at the end. Puzzle authority Martin Gardner provides an Introduction to the text, which is enhanced by sixty charming illustrations. &quot;An ingenious book,&quot; declared the Boston Globe, &quot;magnificent for those who like conundrums, amusing for those who don't, and a tribute in itself to the genius of Lewis Carroll.&quot;\n\n\nWith a Table of Contents so you can navigate all around like,  \n\n, \n\ncause the file that WAS out there was a digital brick\n\n\n,\n\nyay\n\n\nlove y'all\n\n                  heli  iaruy    yura         iileh","torrent":{"xt":"urn:btih:f5b1168bed1d48a37533d6d745004851c9f11748","amp;dn":"Alice+in+Puzzle+Land%2C+Smullyan+%5E+heliiaruy+%2B+hyperlinked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5b1168bed1d48a37533d6d745004851c9f11748","infoHashBuffer":{"type":"Buffer","data":[245,177,22,139,237,29,72,163,117,51,214,215,69,0,72,81,201,241,23,72]},"announce":[],"urlList":[]}}