{"title":"The Constitution of Phenomenal Consciousness - Steven M. Miller","uid":11999335,"size":8037823,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f678147b05ef95e1a5d1ae6214fd0386ee0fe75f&amp;dn=The+Constitution+of+Phenomenal+Consciousness+-+Steven+M.+Miller&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1433723094,"description":"Philosophers of mind have been arguing for decades about the nature of phenomenal consciousness and the relation between brain and mind. More recently, neuroscientists and philosophers of science have entered the discussion. Which neural activities in the brain constitute phenomenal consciousness, and how could science distinguish the neural correlates of consciousness from its neural constitution? At what level of neural activity is consciousness constituted in the brain and what might be learned from well-studied phenomena like binocular rivalry, attention, memory, affect, pain, dreams and coma? What should the science of consciousness want to know and what should explanation look like in this field? How should the constitution relation be applied to brain and mind and are other relations like identity, supervenience, realization, emergence and causation preferable? Building on a companion volume on the constitution of visual consciousness (AiCR 90), this volume addresses these questions and related empirical and conceptual territory. It brings together, for the first time, scientists and philosophers to discuss this engaging interdisciplinary topic","torrent":{"xt":"urn:btih:f678147b05ef95e1a5d1ae6214fd0386ee0fe75f","amp;dn":"The+Constitution+of+Phenomenal+Consciousness+-+Steven+M.+Miller","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f678147b05ef95e1a5d1ae6214fd0386ee0fe75f","infoHashBuffer":{"type":"Buffer","data":[246,120,20,123,5,239,149,225,165,209,174,98,20,253,3,134,238,15,231,95]},"announce":[],"urlList":[]}}