{"title":"Haydn Complete Symphonies Dorati","uid":10711587,"size":10878461363,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:f696ace1df30fa630bdf596709792b035a2a6022&amp;dn=Haydn+Complete+Symphonies+Dorati&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"magneez","files":550,"time":1407362456,"description":"FLAC per track + scans\n\n\nAfter the previous debacle of naming the Brilliant release &quot;complete works&quot; by mistake, I am trying to make up for it by posting something which is actually complete. \n\n\n\n\n\n\n\nrandom amazon review:\n\nI own this set in its multi-jewel box, entire shelf length previous incarnation - so I cannot say anything about improvements in remastering. But in terms of the performances, this newest collection of &quot;discs-in-sleeves-at-a-fraction-of-their-original-price&quot; is, argumentatively, the greatest classical music bargain currently on the market. (Note: At amazon's current 07/09 price you are paying approximately $1/disc! Unbelievable!)\n\nDorati was known primarly for his 50s and early 60s recordings on Mercury Living Presence recordings (recordings which stand the test of time well - both in terms of performance, as well as recording sound). By the time he made these recordings, he had well settled into the &quot;second rank&quot; of conductors. Upon the release of these recordings - the first complete cycle of Haydn's symphonic output - Dorati secured his place in the pantheon of notable conductors.\n\nThis is a cycle for the ages. Never mind that you won't listen to each of the discs in succession (and in fact, you shouldn't) Never mind that you're apt to replay the later symphonies with much more frequency then most of the others (excepting those from the sturm und drang period (you will). This series is the wellspring of classical music. A musical &quot;first lake&quot; that leads to smaller streams, than greater rivers, and eventually leads to the oceans of Mozart and Beethoven. These are the musical source waters containing the rich and fertile nutrients that lead from the Baroque into the great Classical period of music.\n\nThe joy in listening to this series, is ...","torrent":{"xt":"urn:btih:f696ace1df30fa630bdf596709792b035a2a6022","amp;dn":"Haydn+Complete+Symphonies+Dorati","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f696ace1df30fa630bdf596709792b035a2a6022","infoHashBuffer":{"type":"Buffer","data":[246,150,172,225,223,48,250,99,11,223,89,103,9,121,43,3,90,42,96,34]},"announce":[],"urlList":[]}}