{"title":"Renaissance (Abbeville Art Ebook).pdf","uid":12095244,"size":13511774,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f69ecb8401a40603dced124a2111d84f51299bf7&amp;dn=Renaissance+%28Abbeville+Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"STBGD","files":1,"time":1436130006,"description":"Renaissance\nAbbeville Press | 1995 | ISBN: 0789200236 | English | 104 pages | PDF | 13 MB\n\n\nThe Renaissance was hailed as a new style, yet its namemeaning &quot;rebirth&quot; - shows a historical bent. In the classical past, fifteenth- and sixteenth-century designers such as Michelangelo, Palladio, and Brunelleschi found models of ideal form.But as Tracy E. Cooper explains in this compact guide, the Renaissance was also a modern age of exploration and invention. People began to build again, released from the Dark Ages, and used science and nature to achieve a cultural rebirth. No Renaissance man exemplified the spirit of this era more than Leonardo da Vinci - scientist, innovator, and artist of world-renowned works such as the Mona Lisa.From the miraculous domed cathedral of Florence to urban palaces and rural villas, Renaissance captures the new world view that spread from Italy throughout Europe - to English country houses, French chateaux, and German town halls. It chronicles the achievements of the period along with its architectural styles, furnishings, fashions, art, designers, and notable buildings. The book recreates the full spectrum of Renaissance life - its churches and courtyards, its Palladian villas and piazzas, its ideal cities and real gardens, all in an inviting format that recalls the world of Leonardo and Michelangelo","torrent":{"xt":"urn:btih:f69ecb8401a40603dced124a2111d84f51299bf7","amp;dn":"Renaissance+%28Abbeville+Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f69ecb8401a40603dced124a2111d84f51299bf7","infoHashBuffer":{"type":"Buffer","data":[246,158,203,132,1,164,6,3,220,237,18,74,33,17,216,79,81,41,155,247]},"announce":[],"urlList":[]}}