{"title":"Norman Finkelstein - Method and Madness (2014) [epub]","uid":12023447,"size":627353,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f83e3e0ab828e946ca01c7fa66d60fd4e6a99ba3&amp;dn=Norman+Finkelstein+-+Method+and+Madness+%282014%29+%5Bepub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Eugene_Debs","files":1,"time":1434486416,"description":"Method and Madness: The Hidden Story of Israel's Assults on Gaza\n\n In the past five years Israel has mounted three major assaults on the 1.8 million Palestinians trapped behind its blockade of the Gaza Strip. Taken together, Operation Cast Lead (2008-9), Operation Pillar of Defense (2012), and Operation Protective Edge (2014), have resulted in the deaths of some 3,700 Palestinians. Meanwhile, a total of 90 Israelis were killed in the invasions. On the face of it, this succession of vastly disproportionate attacks has often seemed frenzied and pathological. Senior Israeli politicians have not discouraged such perceptions, indeed they have actively encouraged them. After the 2008-9 assault Israel's then-foreign minister, Tzipi Livni, boasted, &quot;Israel demonstrated real hooliganism during the course of the recent operation, which I demanded.&quot; However, as Norman G. Finkelstein sets out in this concise, paradigm-shifting new book, a closer examination of Israel's motives reveals a state whose repeated recourse to savage war is far from irrational. Rather, Israel's attacks have been designed to sabotage the possibility of a compromise peace with the Palestinians, even on terms that are favorable to it. Looking also at machinations around the 2009 UN sponsored Goldstone report and Turkey's forlorn attempt to seek redress in the UN for the killing of its citizens in the 2010 attack on the Gaza freedom flotilla, Finkelstein documents how Israel has repeatedly eluded accountability for what are now widely recognized as war crimes. Further, he shows that, though neither side can claim clear victory in these conflicts, the ensuing stalemate remains much more tolerable for Israelis than for the beleaguered citizens of Gaza. A strategy of mass non-violent protest might, he contends, hold more promise for a Palestinian victory than military resistance, however brave","torrent":{"xt":"urn:btih:f83e3e0ab828e946ca01c7fa66d60fd4e6a99ba3","amp;dn":"Norman+Finkelstein+-+Method+and+Madness+%282014%29+%5Bepub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f83e3e0ab828e946ca01c7fa66d60fd4e6a99ba3","infoHashBuffer":{"type":"Buffer","data":[248,62,62,10,184,40,233,70,202,1,199,250,102,214,15,212,230,169,155,163]},"announce":[],"urlList":[]}}