{"title":"XpSp3_USB_PXE_iPXE Edition (working)","uid":12027509,"size":1168291989,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f913b5b71c50a048b45fc13570d863752f0536d8&amp;dn=XpSp3_USB_PXE_iPXE+Edition+%28working%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"over9OOO","files":1,"time":1434550841,"description":"\n\n\t\t\t    WARNING !!!!!!!\n\n1 .This torrent is NOT verified with any antivirus so I strongly recomend that first thing you do after download the torrent is to scan it with your favorite antivirus . If you find any infected aplication .....just delete it and download the app again from the internet .\n\n2. If you intend to use this torrent and you dont have too much experience with Linux there is a 99% chance to delete/destroy/loose all data from ur Client PC .\nI strongly reccomend to save/backup in a safe location all the data from ur hard drives and any usb storage connected to the Client PC before u start.\n\n3. An old proverb say : 1 single image/picture make more sense then 1 milion words . So i did put all the information on how to use the torent in the watch_me.avi file . I strongly recomend to watch the video first and if something dont work then read the Q &amp; A section in the readme file .\n\nOK so now that we got those warnings out of the way I will make a short description of this torrent.\nThere are many methods out there to install XP from CD/DVD/USB/NETWORK . But 99% of the apps out there that allow you to create a bootable USB or network installation will require a original virgin 100% untouched XP cd. What if.....you want to install from USB or network a heavily modified version of XP with SP3 ,updated drivers , and even some apps ??? I could not find one single easy way to create a bootable USB or network installation from an altered XP CD/DVD . \nAnd this is how i started this project . With this torrent you will be able to install a modified (nlite) version of XP (99% automated )  with SP3 , updated drivers and some apps from 1 Gb or biger usb storage device or from any standard Pxe / iPxe server .After you did prepared the USB or PXE/iPXE server , its one time boot in linux to prepare a ntfs bootable partition and dump there the xp install files that can be located on the USB storage or any FTP/HTTP/etc server .\nThis method is how back in the days I used to install win95/98 .You can even add some finall touches to the xp install files before you reboot and give control to the xp install itself.With this method you can install practically any operating system you want .It give you the user full controll , flexibility and speed over the installation process.\n\nPS: If you watched the video tutorial and read the readme file ......and still have issues/problems please let me and other users know about that here in the comments section","torrent":{"xt":"urn:btih:f913b5b71c50a048b45fc13570d863752f0536d8","amp;dn":"XpSp3_USB_PXE_iPXE+Edition+%28working%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f913b5b71c50a048b45fc13570d863752f0536d8","infoHashBuffer":{"type":"Buffer","data":[249,19,181,183,28,80,160,72,180,95,193,53,112,216,99,117,47,5,54,216]},"announce":[],"urlList":[]}}