{"title":"Compact Heat Exchangers Selection, Design and Operation","uid":12023489,"size":23226865,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f9ea88302c3a5ca003c201ee5159ed50e21d6e98&amp;dn=Compact+Heat+Exchangers+Selection%2C+Design+and+Operation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1434488588,"description":"ISBN 0080428398\n\nThis book presents the ideas and industrial concepts in compact heat exchanger technology that have been developed in the last 10 years or so. Historically, the development and application of compact heat exchangers and their surfaces has taken place in a piecemeal fashion in a number of rather unrelated areas, principally those of the automotive and prime mover, aerospace, cryogenic and refrigeration sectors. Much detailed technology, familiar in one sector, progressed only slowly over the boundary into another sector. This compartmentalisation was a feature both of the user industries themselves, and also of the supplier, or manufacturing industries. These barriers are now breaking down, with valuable cross-fertilisation taking place. \n\nOne of the industrial sectors that is waking up to the challenges of compact heat exchangers is that broadly defined as the process sector. If there is a bias in the book, it is towards this sector. Here, in many cases, the technical challenges are severe, since high pressures and temperatures are often involved, and working fluids can be corrosive, reactive or toxic. The opportunities, however, are correspondingly high, since compacts can offer a combination of lower capital or installed cost, lower temperature differences (and hence running costs), and lower inventory. In some cases they give the opportunity for a radical re-think of the process design, by the introduction of process intensification (PI) concepts such as combining process elements in one unit. An example of this is reaction and heat exchange, which offers, among other advantages, significantly lower by-product production.\n\nTo stimulate future research, the author includes coverage of hitherto neglected approaches, such as that of the Second Law (of Thermodynamics), pioneered by Bejan and co- workers. The justification for this is that there is increasing interest in life-cycle and sustainable approaches to industrial activity as a whole, often involving exergy (Second Law) analysis. Heat exchangers, being fundamental components of energy and process systems, are both savers and spenders of exergy, according to interpretation","torrent":{"xt":"urn:btih:f9ea88302c3a5ca003c201ee5159ed50e21d6e98","amp;dn":"Compact+Heat+Exchangers+Selection%2C+Design+and+Operation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9ea88302c3a5ca003c201ee5159ed50e21d6e98","infoHashBuffer":{"type":"Buffer","data":[249,234,136,48,44,58,92,160,3,194,1,238,81,89,237,80,226,29,110,152]},"announce":[],"urlList":[]}}