{"title":"Cat People 1, 2, 3 - Horror Drama 1942-1982 Eng Subs 720p 480p [","uid":12312616,"size":3340104460,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:faffda043c9cae08448321b49e6335a19918c3d7&amp;dn=Cat+People+1%2C+2%2C+3+-+Horror+Drama+1942-1982+Eng+Subs+720p+480p+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"eyezin","files":30,"time":1440892890,"description":".....................................................\n..:+++++++++++++++++++++++++++++++++++++++++++++++:..\n..:++++++++++Cat People Triple Feature++++++++++++:..\n..:+++++++++++++++++++++++++++++++++++++++++++++++:..\n.....................................................\n\nCat People 1942.\nWhen naval construction designer Oliver Reed sees Serbian born beauty \nIrena Dubrovna at a zoo, he flirts with her, and soon they fall in love \nand marry. Complications arise because Irena believes she is the victim \nof an ancient Serbian curse that causes her to turn into a panther if a \nman tries to make love to her, and the marriage is not consummated. Oliver \nsends Irena for treatment with psychiatrist Dr. Louis Judd, and Oliver \nseeks &quot;consolation&quot; with his colleague Alice Moore. Irena becomes jealous \nwhen she learns that she may be losing Oliver to Alice.\n\nStars.\n=&gt;-Simone Simon.\n=&gt;-Tom Conway.\n=&gt;-Kent Smith.\n\nDirector.\n=&gt;-Jacques Tourneur.\n\nThe Curse of the Cat People 1944.\nOfficially a sequel to Val Lewton's psychological-horror classic Cat People \n(1942), Curse of the Cat People is in fact an engrossing and oftimes charming \nfantasy, told from a child's point of view. Six-year-old Ann Carter plays \nAmy Reed, the lonely daughter of eternally preoccupied Oliver Reed (Kent Smith). \nAmy's vivid imagination and inability to get along with her schoolmates leads \nOliver to worry that the girl will start exhibiting the psychopathic tendencies \nof his long-deceased first wife Irena (Simone Simon), the obsessive Cat Woman \nin the earlier film. Oliver's second wife Alice (Jane Randolph) and Amy's \nsympathetic schoolteacher (Eve March) try to help, but Amy prefers the company \nof elderly Julia Farren (Julia Dean), a harmlessly crazy ex-actress who lives \nin a forbidding mansion with her neurotic daughter Barbara (Elizabeth Russell). \nInsanely jealous of Amy, Barbara ultimately tries to do the girl harm, but she \nis thwarted in this effort by the ghost of Irena, Amy's self-appointed guardian \nangel. Advertised as a horror picture, Curse of the Cat People has only one \ngenuine &quot;shock&quot; scene; otherwise, the most frightening moment in the film is \nJulia Farren's spirited rendition of &quot;The Midnight Ride of Paul Revere. \nSaddled with a lurid title, producer Lewton and screenwriter DeWitt Bodeen \nchose to offer a fascinating glimpse into the wonderfully boundless realm of \na child's imagination, and in this respect the film is an unqualified success.\n\nStars.\n=&gt;-Simone Simon.\n=&gt;-Kent Smith.\n=&gt;-Jane Randolph.\n\nDirector.\n=&gt;-Gunther von Fritsch.\n\nCat People 1982.\nIn this loose adaptation of the 1942 horror classic of the same name, a \n2001-style opening montage establishes some sort of sacrificial, mystical \nunion between panthers and an ancient tribe of humans. Flash forward to 1980's \nNew Orleans, where waifish Irina (Natassja Kinski) meets her older brother, \nPaul (Malcolm McDowell), a minister, for the first time since their animal \ntrainer parents died and she was sent to a series of foster homes. Paul's \nCreole housekeeper, Female (Ruby Dee), helps Irina settle into her brother's \nhome, but Paul himself disappears. Cut to a fleabag motel where a blas? \nprostitute finds an angry panther instead of a client; after mauling her, \nthe cat is captured by police and a team of zoologists: Oliver (John Heard), \nAlice (Annette O'Toole), and Joe (Ed Begley Jr.). The next day Irina finds \nherself in the zoo where these scientists work; drawn to the newly captured \npanther, she befriends Oliver and takes a job in the gift shop. Shortly after \nthe panther's violence turns deadly, it escapes, and soon Paul turns up \nspouting an unbelievable story about his family's were-cat heritage and his \ninevitable sexual union with little Irina. On the run from her dangerous \nbrother, Irina takes refuge in a sexually frustrated romance with Oliver, \nafraid of what might happen if she consummates their passion.\n\nStars.\n=&gt;-Nastassja Kinski.\n=&gt;-Malcolm McDowell.\n=&gt;-John Heard.\n\nDirector.\n=&gt;-Paul Schrader.\n\nInfo.\n=&gt;-Genre.......................: Drama : Horror : Thriller.\n=&gt;-Release Date................: 1942 : 1943 : 1982.\n=&gt;-Language....................: English.\n=&gt;-File Size...................: 889 MiB : 846 MiB : 1.42 GiB.\n=&gt;-Overall bit rate............: 1 717 Kbps.\n=&gt;-Movie Runtime...............: 1h 12mn : 1h 09mn : 1h 58mn.\n=&gt;-Cat People 1942.............: http://www.imdb.com/title/tt0034587/\n=&gt;-The Curse of the Cat People.: http://www.imdb.com/title/tt0036733/\n=&gt;-Cat People 1982.............: http://www.imdb.com/title/tt0083722/\n=&gt;-Cat People 1942.............: http://www.rottentomatoes.com/m/1003757-cat_people/\n=&gt;-The Curse of the Cat People.: http://www.rottentomatoes.com/m/curse_of_the_cat_people/\n=&gt;-Cat People 1982.............: http://www.rottentomatoes.com/m/1003758-cat_people/\n\nVideo.\n=&gt;-Codec.......................: H.264/MPEG-4 AVC.\n=&gt;-Aspect Ratio................: 4:3 : 1.85:1.\n=&gt;-Resolution..................: 720 x 528 : 1280 x 688.\n=&gt;-Bit rate....................: 1 600 Kbps.\n\nAudio English.\n=&gt;-Codec.......................: mp4a: MPEG-4 AAC LC.\n=&gt;-Channels....................: 2 channel Stereo.\n=&gt;-Bit Rate....................: 112 Kbps.\n=&gt;-Maximum bit rate............: 221 Kbps.\n\nSubtitles Softsubbed SubRip MicroDVD.\n=&gt;-English","torrent":{"xt":"urn:btih:faffda043c9cae08448321b49e6335a19918c3d7","amp;dn":"Cat+People+1%2C+2%2C+3+-+Horror+Drama+1942-1982+Eng+Subs+720p+480p+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"faffda043c9cae08448321b49e6335a19918c3d7","infoHashBuffer":{"type":"Buffer","data":[250,255,218,4,60,156,174,8,68,131,33,180,158,99,53,161,153,24,195,215]},"announce":[],"urlList":[]}}