{"title":"Darkside - Psychic (2013) [MP3]","uid":12013311,"size":112341568,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fb012ff7433219bc4d354f25ef5ad21a5c18324e&amp;dn=Darkside+-+Psychic+%282013%29+%5BMP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Diegomerck","files":8,"time":1434260875,"description":"Darkside - Psychic (2013) [MP3][320kbps]\n\n  Genre: Electronic\n  Style: House\n  Source: WEB\n  Codec: MP3\n  Bit Rate: ~ 320 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n  Converted from FLAC files.\n\n  01 Golden Arrow \n  02 Sitra \n  03 Heart \n  04 Paper Trails \n  05 The Only Shrine I've Seen\n  06 Freak, Go Home \n  07 Greek Light \n  08 Metatron \n\n  Darkside is the work of electro-pop minimalist composer Nicolas Jaar and Brooklyn-based multi-instrumentalist Dave Harrington, which steeps Jaar's spacious solo work with brittle bursts of electronic distortion, watery drums, and slick neon guitar patterns. A self-titled EP in 2011 yielded three lengthy songs of the duo's wild combination of airy atmospheres and menacing fuzz, but debut full-length Psychic moves into more compositional territory, though it remains drifty and narcotic in ways similar to its predecessor. The album kicks off with 11-minute standout track &quot;Golden Arrow,&quot; moving like a suite through an intro of dark, fuzzy ambience and wobbling stereo effects into a sleazy, submerged house beat and fragmented synth and string samples. Caught between the creeping underground thump of minimal avant-techno experimentalists like Pole or Gas and the sharp, clean lines of nocturnal pop acts like the Chromatics or James Blake, the song is an unlikely success in its deep contrasts. Space is a primary concern throughout Psychic, with plenty of ambient interludes and raw tape experiments serving as cushioning between pop moments like the oddly bluesy dirge of &quot;Paper Trails&quot; and the dubby shadows of album-closer &quot;Metatron.&quot; Ultimately, it's the contrasts and the way they fit so well together that makes Psychic a success. The meeting of hurried noise, slick dubstep-styled R&amp;B undertones, wonky blues, and grainy electronics seems destined for ugly clashing, but somehow the organization of sounds, stereo field space, and the amount of distance Jaar and Harrington put between the disparate elements themselves makes so much compositional sense that the album floats by like a strange, faraway dream.\n\nSEED FOREVER!","torrent":{"xt":"urn:btih:fb012ff7433219bc4d354f25ef5ad21a5c18324e","amp;dn":"Darkside+-+Psychic+%282013%29+%5BMP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb012ff7433219bc4d354f25ef5ad21a5c18324e","infoHashBuffer":{"type":"Buffer","data":[251,1,47,247,67,50,25,188,77,53,79,37,239,90,210,26,92,24,50,78]},"announce":[],"urlList":[]}}