{"title":"The Bipolar Disorder Survival Guide (2002) Pdf Gooner","uid":12103018,"size":60722055,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb5fe3181212c91eece2c3b3b3d3e58d8d7c647a&amp;dn=The+Bipolar+Disorder+Survival+Guide+%282002%29+Pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1436377549,"description":"Publisher: The Guilford Press; 1 edition (January 24, 2002)\nLanguage: English\nISBN-10: 1572305258\nISBN-13: 978-1572305250\n\nThanks to sharper diagnosis and better medicine, the future is brighter for people with bipolar disorder than in past generations. But if you or someone you love is struggling with the frantic highs and crushing lows of this illness, there are still many hurdles to surmount at home, at work, and in daily life.\n\n*How can you learn to distinguish between the early warning signs of mood swings and the normal ups and downs of life?\n*What medications are available, and what are their side effects?\n*What should you do when you find yourself escalating into mania or descending into depression?\n*How can you get the help and support you need from family members and friends?\n*How can you tell your coworkers about your illness without endangering your career?\n\nIn this comprehensive guide, Dr. David J. Miklowitz offers straight talk that can help you tackle these and related questions, take charge of your illness, and reclaim your life. A leading researcher and clinical specialist who knows what works, Dr. Miklowitz supplies proven tools to help you achieve balance--and free yourself from the emotional and financial havoc that result when symptoms rule your life--without sacrificing your right to rich and varied emotional experiences.\n\nThis essential resource will help you and your family members come to terms with the diagnosis, recognize early warning signs of manic or depressive episodes, cope with triggers of mood swings, resolve medication problems, and learn to collaborate effectively with doctors and therapists. You'll learn specific ways to ask for support and help from your family and friends--and what to do when their &quot;caring&quot; feels like &quot;controlling.&quot; For times when the going gets tough, a wealth of examples of how others have dealt with similar challenges offer new perspectives and new solutions.\n\nWhether you have recently been diagnosed with bipolar disorder, are considering seeking help for the first time, or have been in treatment for years, this empowering book is designed to help put you--not your illness--back in charge of your life.\n\nAbout the Author\n\nDavid J. Miklowitz, PhD, is Professor of Psychology at the University of Colorado, Boulder, where he has been a faculty member since 1989. His research has been funded by the National Institute of Mental Health and the MacArthur Foundation, and recognized with awards from the International Congress on Schizophrenia Research and the National Alliance for Research on Schizophrenia and Depression, among others. The author of over 90 journal articles and book chapters, Dr. Miklowitz is the coauthor (with Michael G. Goldstein) of Bipolar Disorder: A Family-Focused Treatment Approach, which won the 1998 Outstanding Research Publication Award from the American Association for Marital and Family Therapy","torrent":{"xt":"urn:btih:fb5fe3181212c91eece2c3b3b3d3e58d8d7c647a","amp;dn":"The+Bipolar+Disorder+Survival+Guide+%282002%29+Pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb5fe3181212c91eece2c3b3b3d3e58d8d7c647a","infoHashBuffer":{"type":"Buffer","data":[251,95,227,24,18,18,201,30,236,226,195,179,179,211,229,141,141,124,100,122]},"announce":[],"urlList":[]}}