{"title":"A Brief History of the Future - John Noughton","uid":12014619,"size":1617911,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fbd250ea40933ec51cacb030f320f63e267912df&amp;dn=A+Brief+History+of+the+Future+-+John+Noughton&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Djofullinn","files":1,"time":1434287377,"description":"ISBN-10: 1585671843\nISBN-13: 978-1585671847\n\nFrom Publishers Weekly\nOne of the better meditations on technology and the Internet to burble up from the digerati in recent years, this fact-filled volume offers a selective history of computing as it traces the dawn of the World Wide Web and honors the engineers who created it. Naughton, a Cambridge fellow and a columnist for the Observer (U.K.), plunges into the nuances of packet-switching and compression algorithms as he indulges his obsession with communication, first evidenced by an intense interest in short-wave radio during his childhood in rural Ireland. Conveying detailed aspects of programming with relative ease, Naughton surveys the heroes of the Internet and reviews their achievements. We meet J.C.R. Licklider, the MIT-trained engineer who first pondered the tantalizing potential of &quot;man-computer symbiosis,&quot; and the great Paul Baran, a talented young engineer at the RAND think tank who in 1959 developed the first distributed digital network for the U.S. military (which was stoutly resisted, Naughton points out, by top brass at the analogue-based AT&amp;T). The heaviest hitter, however, is probably Tim Berners-Lee, who got interested in the idea of hyperlinks as a way of aiding his terrible memory and went on to develop the first Web browser and the now-ubiquitous HTML language for the Web. With amusing asidesAthe first e-mail message may have been sent by an engineer in L.A. asking his colleagues to retrieve a razor he left at a conference in the U.K.Athis is a particularly thoughtful and readable history of the Web to date. (July) \nCopyright 2000 Reed Business Information, Inc. --This text refers to an out of print or unavailable edition of this title","torrent":{"xt":"urn:btih:fbd250ea40933ec51cacb030f320f63e267912df","amp;dn":"A+Brief+History+of+the+Future+-+John+Noughton","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbd250ea40933ec51cacb030f320f63e267912df","infoHashBuffer":{"type":"Buffer","data":[251,210,80,234,64,147,62,197,28,172,176,48,243,32,246,62,38,121,18,223]},"announce":[],"urlList":[]}}