{"title":"The Global Minotaur . Yanis Varoufakis . 2015 . ebook","uid":12109946,"size":1037124,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fc4b0b4a9be7fb3d96277642ba32859daf85d7c6&amp;dn=The+Global+Minotaur+.+Yanis+Varoufakis+.+2015+.+ebook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"heliiaruy","files":1,"time":1436546090,"description":"Yanis Varoufakis    was the Greek Minister of Finance and an MP for Syriza. He is professor of economics at the University of Athens and visiting professor at the University of Texas, Austin.\n\nPublisher: Zed Books; 3 edition (July 5, 2015)\n\nPrint Length: 304 pages\n\n\n'The emerging rock-star of Europe's anti-austerity uprising' - Daily Telegraph 'The book is one of those exceedingly rare publications of which one can say they are urgent, timely and absolutely necessary.' - Terry Eagleton 'Yanis Varoufakis is a rare economist: skilled at explaining ideas, happy to join in public debates and able to put his discipline in a broader context.' - Aditya Chakrabortty, Guardian lead economics writer 'Yanis is one of the best, brightest and most innovative economists on the planet' - Steve Keen, author of Debunking Economics 'Clearly and strongly written, with logical organization building towards simple conclusions, the book is an easy yet rewarding read ... perhaps should become the standard way we think about the nature of our increasingly dysfunctional world economy.' - Joel Campbell, International Affairs 'In the most comprehensive guide to the contemporary economic crisis yet written, Yanis Varoufakis traces out the path from post-war US economic supremacy to the current predicament. This book's provocative thesis, written in lively and impassioned prose, is that which neither the US nor the EU nor any other nation can now restore robust global growth. Whether you agree or disagree, this book's lively and impassioned prose will engage you both heart and mind, and hold you in thrall to the last word. The Global Minotaur is a masterwork that registers for all time the challenge of our time.' - Prof. Gary Dymski, University of California, Riverside 'If you want to know how serious the current crisis is, you should read his book. With much eloquence, Yanis Varoufakis argues that the current financial problems are connected to the emerging fault lines of the international monetary system. The US (the Minotaur) used to govern the international monetary system, but no more; and this crucially means that there is no surplus recycling mechanism that can reliably stabilise the world economy. The elephant in the room, so to speak, is a stumbling Minotaur.' - Prof. Shaun Hargreaves-Heap, University of East Anglia\n\n\nthanks cntl+c +++++++   the reviews are better than the write up summary of book..\n\n\nThis is the latest\n              and probably final edition\n                                released, so soak it up y'all\n\n\nazw3 format, use Calibre &amp;/ Kindle directory...\n\nhel                    ii  ar        u y       y   u     r   a    i  l  e         h","torrent":{"xt":"urn:btih:fc4b0b4a9be7fb3d96277642ba32859daf85d7c6","amp;dn":"The+Global+Minotaur+.+Yanis+Varoufakis+.+2015+.+ebook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc4b0b4a9be7fb3d96277642ba32859daf85d7c6","infoHashBuffer":{"type":"Buffer","data":[252,75,11,74,155,231,251,61,150,39,118,66,186,50,133,157,175,133,215,198]},"announce":[],"urlList":[]}}