{"title":"Novel Concepts in Catalysis and Chemical Reactors","uid":12086640,"size":7341380,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fcbbf982632ab16233d8afc8df9e48f76b3b9f0b&amp;dn=Novel+Concepts+in+Catalysis+and+Chemical+Reactors&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1435881963,"description":"Novel Concepts in Catalysis and Chemical Reactors - Improving the Efficiency for the Future (Wiley-VCH, 2010).pdf\n\nISBN 9783527324699\n\nThe chemical process industry faces a tremendous challenge of supplying a growing and ever more demanding global population with the products we need. The average efficiency at which resources are converted into the final products is however still dramatically low. The most obvious solution is to carry out chemical conversions at much higher yields and selectivity and this is where active and selective catalysts and efficient chemical reactors play a crucial role. Written by an international team of highly experienced editors and authors from academia and industry, this ready reference focuses on how to enhance the efficiency of catalysts and reactors. It treats key topics such as molecular modeling, zeolites, MOFs, catalysis at room temperature, biocatalysis, catalysis for sustainability, structured reactors including membrane and microchannel reactors, switching from batch to continuous reactors, application of alternative energies and process intensification. By including recent achievements and trends, the book provides an up-to-date insight into the most important developments in the field of industrial catalysis and chemical reactor engineering. In addition, several ways of improving efficiency, selectivity, activity and improved methods for scale-up, modeling and design are presented in a compact manner","torrent":{"xt":"urn:btih:fcbbf982632ab16233d8afc8df9e48f76b3b9f0b","amp;dn":"Novel+Concepts+in+Catalysis+and+Chemical+Reactors","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fcbbf982632ab16233d8afc8df9e48f76b3b9f0b","infoHashBuffer":{"type":"Buffer","data":[252,187,249,130,99,42,177,98,51,216,175,200,223,158,72,247,107,59,159,11]},"announce":[],"urlList":[]}}