{"title":"Elvis Presley - Complete 1954-1962 USA Singles (4CD-Box 2015)","uid":12078027,"size":1278228517,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fe935aebed698ebbefc4294dbdb3fb087041731e&amp;dn=Elvis+Presley+-+Complete+1954-1962+USA+Singles+%284CD-Box+2015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bluesmax","files":140,"time":1435682864,"description":"\nLimited-edition 4 CD set comprising the complete Presley singles and EPs released in the USA up to 1962 presented in the order in which they were issued. This edition comes with a comprehensive booklet full of discographical information, rare photos and memorabilia. Eight tracks have been added as a bonus making 100 songs recorded by Elvis in his prime \n\nElvis Presley - ELVIS: The Complete 1954-1962 U.S.A. Singles\nLabel: Valentine Records - 47772\nFormat: 4 x CD, Compilation, Box Set, Remastered, Limited Edition\nCountry: UK\nReleased: 2015\nGenre: Rock\nStyle: Rock'n'Roll, Ballads, Pop\n\n\nCD1:\n01. That s All Right Mama (Arthur &quot;Big Boy&quot; Crudup) 1:56\n02. Blue Moon Of Kentucky (Bill Monroe) 2:03\n03. Good Rockin Tonight (Roy Brown) 2:12\n04. I Don t Care If The Sun Don t Shine (Mack David - Marion Keisker) 2:28\n05. Milkcow Blues Boogie (Kokomo Arnold) 2:40\n06. You're A Heartbreaker (Jack Sallee) 2:12\n07. Baby, Let s Play House (Arthur Gunter - Elvis Presley) 2:16\n08. I'm Left, You're Right, She's Gone (Stan Kesler - William Taylor) 2:37\n09. Mystery Train (Junior Parker - Sam Phillips) 2:25\n10. I Forgot To Remember To Forget (Stan Kesler - Charlie Feathers) 2:29\n11. Heartbreak Hotel (Mae Boren Axton - Thomas Durden - Elvis Presley) 2:07\n12. I Was The One (Aaron Schroeder - Claude DeMetrius - Hal Blair - Bill Peppers) 2:29\n13. I Want You, I Need You, I Love You (Lou Kolsoff - George Mysels) 2:38\n14. My Baby Left Me (Arthur &quot;Big Boy&quot; Crudup) 2:09\n15. Hound Dog (Jerry Leyber - Mike Stoller) 2:15\n16. Don't Be Cruel (Otis Blackwell - Elvis Presley) 2:03\n17. Blue Suede Shoes (Carl Perkins) 1:59\n18. Tutti Frutti (Dorothy Labostrie - Richard Penniman) 1:57\n19. I Got A Woman (Ray Charles) 2:23\n20. I'm Counting On You (Don Robertson) 2:22\n21. I'll Never Let You Go (Little Darlin) (Jimmy Wakely) 2:22\n22. I'm Gonna Sit Right Down And Cry (Over You) (Joe Thomas - Howard Biggs) 1:59\n23. Tryin' To Get To You (Rosemary McCoy - Charlie Singleton) 2:32\n24. I Love You Because (Leon Payne) 2:41\n25. Blue Moon (Richard Rodgers - Lorenz Hart) 2:39\n\nCD2:\n01. Just Because (Sydney Robin - Bob Shelton - Joe Shelton) 2:32\n02. Money Honey (Jesse Stone) 2:32\n03. One-Sided Love Affair (Bill Campbell) 2:10\n04. Lawdy Miss Clawdy (Lloyd Price) 2:07\n05. Shake Rattle And Roll (Charles E. Calhoun) 2:29\n06. Love Me Tender (Vera Matson - Elvis Presley) 2:45\n07. Anyway You Want Me (That's How I Will Be) (Aaron Schroeder - Cliff Owens) 2:14\n08. Playing For Keeps (Stanley A. Kesler) 2:53\n09. Too Much (Bernard Weinman - Lee Rosemberg) 2:32\n10. All Shook Up (Otis Blackwell - Elvis Presley) 1:57\n11. That s When Your Heartaches Begin (Fred Fisher - Billy Hill - J. Raskin) 3:23\n12. (Let Me Be Your) Teddy Bear (Kal Mann - Bernie Lowe) 1:47\n13. Loving You (Jerry Leyber - Mike Stoller) 2:14\n14. Jailhouse Rock (Jerry Leyber - Mike Stoller) 2:25\n15. Treat Me Nice (Jerry Leyber - Mike Stoller) 2:12\n16. Don't (Jerry Leyber - Mike Stoller) 2:48\n17. I Beg Of You (Rose Marie McCoy - Kelly Owens) 1:51\n18. Wear My Ring Around Your Neck (Bert Carroll - Russell Moody) 2:14\n19. Doncha' Think It's Time (Clyde Otis - Willie Dixon) 1:54\n20. Hard Headed Woman (Claude DeMetrius) 1:53\n21. Don't Ask Me Why (Fred Wise - Ben Weisman) 2:05\n22. One Night (Dave Bartholomew - Pearl King - Anita Steiman) 2:30\n23. I Got Stung (Aaron Schroeder - David Hill) 1:48\n24. I Need Your Love Tonight (Sid Wayne - Bix Reichner) 2:03\n25. (Now And Then There's) A Fool Such As I (Bill Trader) 2:29\n\nCD3:\n01. Big Hunk O'Love (Aaron Schroeder - Sidney Wyche) 2:11\n02. My Wish Came True (Ivory Joe Hunter) 2:33\n03. Stuck On You (Aaron Schroeder - John Leslie - MacFarland) 2:19\n04. Fame And Fortune (Fred Wise - Ben Weisman) 2:30\n05. It's Now Or Never (Aaron Schroeder - Wally Gold [based on &quot;O Sole Mio&quot; by Alfredo Mazzucchi - Eduardo di Capua - Giovanni Capurro]) 3:15\n06. A Mess Of Blues (Doc Pomus - Mort Shuman) 2:41\n07. Are You Lonesome Tonight? (Roy Turk - Lou Handman) 3:05\n08. I Gotta Know (Paul Ewans - Matt Williams) 2:14\n09. Surrender (Doc Pomus - Mort Shuman) 1:53\n10. Lonely Man (Bernie Benjamin - Sol Marcus) 2:46\n11. I Feel So Bad (Chuck Willis) 2:54\n12. Wild In The Country (George Weiss - Hugo Peretti - Luigi Creatore) 1:52\n13. (Marie s The Name) His Latest Flame (Doc Pomus - Mort Shuman) 2:06\n14. Little Sister (Doc Pomus - Mort Shuman) 2:29\n15. Can't Help Falling In Love (George Weiss - Hugo Peretti - Luigi Creatore[based on &quot;Plasir d'amour&quot; by Jean Paul Egine Martini]) 3:03\n16. Rock-A-Hula Baby (Ben Weisman - Fred Wise - Dolores Fuller) 2:00\n17. Good Luck Charm (Aaron Schroeder - Wally Gold) 2:22\n18. Anything That's Part Of You (Don Robertson) 2:02\n19. She's Not You (Jerry Leyber - Mike Stoller - Doc Pomus) 2:06\n20. Just Tell Her Jim Said Hello (Jerry Leyber - Mike Stoller) 1:53\n21. Return To Sender (Otis Blackwell - Winfield) 2:07\n22. Where Do You Come From (Ruth Batchelor - Bob Roberts) 2:05\n23. Rip It Up (Robert &quot;Bumps&quot; Blackwell - John Marascalco) 1:54\n24. Love Me (Jerry Leyber - Mike Stoller) 2:46\n25. When My Blue Moon Turns To Gold Again (Gene Sullivan - Wiley Walker) 2:22\n\nCD4:\n01. (There'll Be) Peace In The Valley (For Me) (Thomas A. Dorsey) 3:21\n02. It's No Secret (What God Can Do) (Stuart Hambler) 3:56\n03. I Believe (Ervin Drake - Irvin Graham - Jimmy Shirt - Al Stillman) 2:04\n04. Take My Hand, Precious Lord (Thomas A. Dorsey) 3:17\n05. I Need You So (Ivory Joe Hunter) 2:40\n06. Have I Told You Lately That I Love You (Scotty Wiseman) 2:31\n07. Blueberry Hill (Al Lewis - Vincent Rose - Larry Stock) 2:39\n08. Is It So Strange (Faron Young) 2:29\n09. Flaming Star (Sherman Edward - Donald Meyer - Sid Wayne) 2:26\n10. Summer Kisses, Winter Tears (Andrew Lloyd Webber - Ben Weisman - Fred Wise) 1:38\n11. Follow That Dream (Ben Weisman - Fred Wise) 1:38\n12. Angel (Roy Bennett - Sid Tepper) 2:38\n13. What A Wonderful Life (Jerry Livingston - Sid Wayne) 2:26\n14. I'm Not The Marrying Kind (Mack David - Sherman Edwards - Donald Meyer) 1:51\n15. King Of The Whole Wide World (Ruth Batchelor - Don Robertson) 2:41\n16. This Is Living (Ben Weisman - Fred Wise) 1:44\n17. Riding The Rainbow (Ben Weisman - Fred Wise) 1:38\n18. Home Is Where The Heart Is (Hal David - Sherman Edwards - Donald Meyer) 3:17\n19. I Got Lucky (Ben Weisman - Dolores Fuller - Fred Wise) 2:11\n20. A Whistling Tune (Hal Davis - Sherman Edwards - Donald Meyer) 3:17\n21. Long Tall Sally (Robert &quot;Bumps&quot; Blackwell - Enotris Johnson - Little Richard) 1:55\n22. First In Line (Aaron Schroeder - Ben Weisman) 3:23\n23. Paralyzed (Elvis Presley - Otis Blackwell) 2:26\n24. How s The World Treating You (Chet Atkins - Boudleaux Bryant) 2:26\n25. How Do You Think I Feel (Webb Pierce - Wiley Walker) 2:12","torrent":{"xt":"urn:btih:fe935aebed698ebbefc4294dbdb3fb087041731e","amp;dn":"Elvis+Presley+-+Complete+1954-1962+USA+Singles+%284CD-Box+2015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe935aebed698ebbefc4294dbdb3fb087041731e","infoHashBuffer":{"type":"Buffer","data":[254,147,90,235,237,105,142,187,239,196,41,77,189,179,251,8,112,65,115,30]},"announce":[],"urlList":[]}}