{"title":"Bopup.Messenger.v6.5.5.Enterprise.Network.IM.Communication.Chat","uid":11955926,"size":13716162,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fed0345da1bc54415d6dd19c42716e85d1a16995&amp;dn=Bopup.Messenger.v6.5.5.Enterprise.Network.IM.Communication.Chat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"boffon","files":12,"time":1432417003,"description":"Bopup Messenger version 6.5.5.11226\nSecure instant messenger for effective business communications\n\nThis torrent includes English, German, Spanish, French, Dutch, Italian \nand Russian setup packages of the product.\n========================================================================\n\n\nOverview\n------------------------------------------------------------------------\n\nBopup Messenger is a secure instant messenger designed to communicate \nover LAN and enterprise-size networks. This clear, easy to use and \nlight-weight IM client offers a set of corporate features and answers \nmost of the business needs you may have. \n\nWith this messenger, you can easily connect users from all other offices \nand locations to one IM workspace and exchange files, urgent and \nextended messages with links, font and color formatting and emoticons, \nand can receive assigned files and directories from the IM server. \nOrganize your personal contact list that is accessible to you from any \nworkplace and see who is online and available to communicate among your \ncontacts. \n\nMessaging and File Transfer are encrypted with strong algorithms so that \npersonal and group conversations are safe and secure even if you send \nmessages and files via the Internet. You will never lose any information \nyou exchange because offline data are stored and automatically delivered \nby the server when the recipient goes online. \n\nNo user experience and skills are needed to use the program. The smart \nand comfortable user interface with advanced usability options and popup \nnotifications allows you to join the IM network in a few mouse clicks. \nThe messenger completely supports the Terminal Server/Citrix environment \nand can be used simultaneously by multiple users on one computer. Bopup \nMessenger can automatically download and install updates from the IM \nserver. \n\nThe centralized client/server architecture offers complete and flexible \nmanagement for controlling your IM infrastructure. The central server \nlogs all user activity and archives all messages and transfers with the \nreporting, search and printing options. It allows you to manage \nmessaging groups, users' contact information and permissions to send and \nview other users, assign and distribute important files and documents to \nusers. It is easy to import user accounts from your Active Directory \n(LDAP) and start an efficient Instant Messaging system right now. \n\n\nLimitations\n------------------------------------------------------------------------\n\nThis is 45-day trial version! For advanced details and purchasing \ninformation please refer B Labs website and product page at   &lt;a href=&quot;\nhttp://www.bopup.com/products/messenger/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bopup.com/products/messenger/&lt;/a&gt;\n\n\n========================================================================\nCopyright (C) 2000-2015 B Labs. All rights reserved. &lt;a href=&quot;\nhttp://www.bopup.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bopup.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:fed0345da1bc54415d6dd19c42716e85d1a16995","amp;dn":"Bopup.Messenger.v6.5.5.Enterprise.Network.IM.Communication.Chat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fed0345da1bc54415d6dd19c42716e85d1a16995","infoHashBuffer":{"type":"Buffer","data":[254,208,52,93,161,188,84,65,93,109,209,156,66,113,110,133,209,161,105,149]},"announce":[],"urlList":[]}}