{"title":"Israeli Fortifications of the October War 1973","uid":11932136,"size":33617332,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ff2fc3b849be2e6e85ef3c9c52506080b92cf5e1&amp;dn=Israeli+Fortifications+of+the+October+War+1973&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1431834712,"description":"The Bar Lev Line along the Suez Canal was born out of the overwhelming victory of the Israel Defense Forces (IDF) in the Six Day War of 1967. Devastated by their defeat, the Egyptian army began a prolonged campaign of artillery bombardments of Israeli positions causing many casualties. Accordingly, the IDF Chief of Staff, General Haim Bar-Lev, ordered the construction of a series of fortified positions and observation posts that were named the Bar Lev Line by the Israeli press, thanks to its inevitable association with the heavily fortified Maginot Line.\n\nThis book examines the original 23 positions of the Bar Lev Line, known as Moazims (Moaz is 'castle keep' in Hebrew), each of which were between five and 15 kilometers apart and surrounded by barbed wire and minefields. With rare photographs and cutaway artwork, the design of these positions is described. Finally, the author analyzes the effectiveness of these positions when the Egyptians launched an offensive on Yom Kippur 1973. Manned by just 436 reservists the Moazims were quickly cut off and the Israeli defenders paid a high price with a casualty rate of almost 50 percent. Although widely criticized, the Bar Lev Line proved a success during the war of attrition, and in 1973 it was the political and military failures which allowed the Moazims to be surrounded, rather than the failure of the defensive line itself","torrent":{"xt":"urn:btih:ff2fc3b849be2e6e85ef3c9c52506080b92cf5e1","amp;dn":"Israeli+Fortifications+of+the+October+War+1973","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff2fc3b849be2e6e85ef3c9c52506080b92cf5e1","infoHashBuffer":{"type":"Buffer","data":[255,47,195,184,73,190,46,110,133,239,60,156,82,80,96,128,185,44,245,225]},"announce":[],"urlList":[]}}