{"title":"Four Elizabeth Ferrars Mystery Stories  (Unabridged)","uid":12041495,"size":370550350,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ff355b7411166333a14404ecfadc5ad56fc9dbc4&amp;dn=Four+Elizabeth+Ferrars+Mystery+Stories++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"davieboy1966","files":29,"time":1434796795,"description":"Audio Books : Mystery and Suspense : Other quality : English\n\n\nAll are unabridged and from CDs.\nAll are recorded at 32 kbps / 22 kHz Mono CBR Fraunhofer MP3.\n\n\n\nThese four titles are as far as I know the only general Ferrars mystery titles to be released on CD. (Although there are a couple in her Toby Dyke series on CD).\nI do wish there were more CD releases, although thankfully the cassette conversions I have posted are decent.\n\nWith Murder in Mind [1948] 7 hours 18 mins, read by Norma West.\nSomething on her mind, something that burns in her brain every waking minute, has driven Andrea Stone to consult Dr. Fromhold, the eminent psychiatrist. In the cloistered quiet of his consulting room, where the secrets of many distracted minds have been laid bare, Andrea tells her extraordinary story. She is married to a murderer, a man whom she still loves deeply. And she is frightened!\n\nThe Doubly Dead [1963] 6 hours 12 mins, read by Hugh Walters.\nMargot Dalziel, the well-known journalist, was due in London on Friday. On Saturday she was expected at her rural cottage. By Sunday it had become apparent that something had gone amiss and Margot had vanished. Her country neighbors are soon swept into the web of mystery and suspicion. A murder becomes a catalyst to people already taut with fear - although the villagers have made up their collective mind as to who is responsible...\n\nHanged Man's House [1974] 5 hours 57 mins, read by Clive Mantle.\nRelationships among the inhabitants of a small English village, most of whom are on staff at the Martindale, a scientific research station, are revealed as very complex after the director, Charles Gair, is found hanged in his home by his assistant and his sister, who are also his neighbors. Romances, old and new, failed marriages and affairs, and the reappearance of missing persons all surface as detective superintendent Patrick Dunn investigates. (The relaxed and natural narration by Clive Mantle fits the mood of the novel perfectly, and his skill at voicing the very different characters makes the listener feel a part of the investigation and of the neighborhood).\n\nWitness Before the Fact [1979] 6 hours 13 mins, read by Raymond Sawyer.\nPeter Corey, writer of a successful children's book series featuring an otter named Edward, goes to Madeira to check up on seedy, needy Alec Methuen--one-time Hong Kong policeman, one-time Zaire mercenary, and long-estranged husband of Peter's illustrator Claire. When Peter arrives, however, he finds Alec shot dead--in surprisingly comfortable surroundings. Was it suicide or murder? Despite all indications to the contrary, Clare's ex-husband had not eaten his last meal in solitude, and somebody was very anxious to conceal that fact. As if one death on the beautiful island of Madeira was not enough, there was another. Although Peter who had found the first body, had an iron cast alibi: he was on a plane to the island at the time of the first death - but what of the other?\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:ff355b7411166333a14404ecfadc5ad56fc9dbc4","amp;dn":"Four+Elizabeth+Ferrars+Mystery+Stories++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff355b7411166333a14404ecfadc5ad56fc9dbc4","infoHashBuffer":{"type":"Buffer","data":[255,53,91,116,17,22,99,51,161,68,4,236,250,220,90,213,111,201,219,196]},"announce":[],"urlList":[]}}