{"title":"[FemaleAgent] Maximus, Anna Rose - Horny Studs Cock Causes Him P","uid":12005490,"size":773409550,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ff464ed6be71f2cc33479fd52d5b90a1f2a19bd4&amp;dn=%5BFemaleAgent%5D+Maximus%2C+Anna+Rose+-+Horny+Studs+Cock+Causes+Him+P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xuluhulu","files":1,"time":1433864630,"description":"[FemaleAgent] Maximus, Anna Rose - Horny Studs Cock Causes Him Problems During Sexy Casting (f1305) (09.06.2015)\n\nMaximus (35 mins). This was definitely the easiest casting I have done so far, this stud was pretty much up for doing anything for money and that's the way I like it. He wanted to do modelling work originally but when I suggested porn and that he do a casting test with me today, he agreed without hesitation. I couldn't wait to see this ripped studs dick, as his body when he undressed for me earlier had made my panties moisten with sexual dew. As he stripped off his pants I could see he had a beautiful cock that looked long and thick between his legs, but first I wanted to get his tongue inside my pussy. As he licked and sucked my honey hole I could feel the beginnings of an orgasm swirl inside me. I needed his cock deep inside me and when I told him to fuck me, we hit our first problem. This guys dick was not hard, trying to fuck me with a soft dick is like trying to play pool with a rope. He managed to wank himself erect and we began to fuck in missionary but then we hit another problem when he pulled out and said he wanted to cum, after only a few minutes of fucking. I told him that he couldn't cum yet and we switched to doggystyle. I concentrated hard on his big cock pounding my pussy as I realized I would need to have an orgasm as soon as possible, as this guy could not control his cock. It wasn't long before my orgasm exploded inside me as his thick length drove into me from behind. It was time to see this studs cumshot, I'd got what I wanted but we began to hit more problems again. His cock had deflated once more and he said he felt dizzy. I needed this stud to show me his load and then get out. We finally got him erect again and he pulled out of my tight pussy just in time to empty his balls all over my stomach. I'd got what I wanted but this stud had no cock control and he would not be getting any work from me, even if I had some to offer.\n\nSCREENS:\n &lt;a href=&quot;\nhttp://imghell.com/viewer.php?file=61323024307936073026.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imghell.com/viewer.php?file=61323024307936073026.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imghell.com/viewer.php?file=77709326357303698905.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imghell.com/viewer.php?file=77709326357303698905.jpg&lt;/a&gt;\n\n\nSEED &amp; ENJOY!!!","torrent":{"xt":"urn:btih:ff464ed6be71f2cc33479fd52d5b90a1f2a19bd4","amp;dn":"%5BFemaleAgent%5D+Maximus%2C+Anna+Rose+-+Horny+Studs+Cock+Causes+Him+P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff464ed6be71f2cc33479fd52d5b90a1f2a19bd4","infoHashBuffer":{"type":"Buffer","data":[255,70,78,214,190,113,242,204,51,71,159,213,45,91,144,161,242,161,155,212]},"announce":[],"urlList":[]}}