{"title":"Computer Graphics - Alexey Boreskov and Evgeniy Shikin","uid":11994842,"size":4062422,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ff47f7b1a17c0354fa768e374d271747fcc52d9b&amp;dn=Computer+Graphics+-+Alexey+Boreskov+and+Evgeniy+Shikin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SectorVector","files":1,"time":1433603696,"description":"Computer Graphics: From Pixels to Programmable Graphics Hardware\n\nby Alexey Boreskov, Evgeniy Shikin.\n\n# Publisher : CRC Press, 2013\n# Pages     : 568\n# ISBN      : 1439867305\n# Format    : PDF\n\n\n* Complete Coverage of the Current Practice of Computer Graphics:\n\nExplores all major areas of modern computer graphics, starting from basic mathematics and algorithms and concluding with OpenGL and real-time graphics. It gives students a firm foundation in today's high-performance graphics.\n\n\n* Up-to-Date Techniques, Algorithms, and API:\n\nThe book includes mathematical background on vectors and matrices as well as quaternions, splines, curves, and surfaces. It presents geometrical algorithms in 2D and 3D for spatial data structures using large data sets. Although the book is mainly based on OpenGL 3.3, it also covers tessellation in OpenGL 4.0, contains an overview of OpenGL ES 2.0, and discusses the new WebGL, which allows students to use OpenGL with shaders directly in their browser.\n\nIn addition, the authors describe a variety of special effects, including procedural modeling and texturing, fractals, and non-photorealistic rendering. They also explain the fundamentals of the dominant language (OpenCL) and platform (CUDA) of GPGPUs.\n\n\n* Web Resource:\n\nOn the book's CRC Press web page, students can download many ready-to-use examples of C++ code demonstrating various effects. C++ wrappers for basic OpenGL entities, such as textures and programs, are also provided.\n\n\n* In-Depth Guidance on a Programmable Graphics Pipeline:\n\nRequiring only basic knowledge of analytic geometry, linear algebra, and C++, this text guides students through the OpenGL pipeline. Using one consistent example, it leads them step by step from simple rendering to animation to lighting and bumpmapping","torrent":{"xt":"urn:btih:ff47f7b1a17c0354fa768e374d271747fcc52d9b","amp;dn":"Computer+Graphics+-+Alexey+Boreskov+and+Evgeniy+Shikin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff47f7b1a17c0354fa768e374d271747fcc52d9b","infoHashBuffer":{"type":"Buffer","data":[255,71,247,177,161,124,3,84,250,118,142,55,77,39,23,71,252,197,45,155]},"announce":[],"urlList":[]}}