{"title":"Runtastic Running PRO 5.11 [Apk - MultiLang] TNT Village","uid":12015848,"size":30768170,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:ffeaaf1be4bd1ff75e8258eccbc2a4c736982e94&amp;dn=Runtastic+Running+PRO+5.11+%5BApk+-+MultiLang%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"albysprx","files":1,"time":1434307471,"description":"Take your fitness to a new level with Runtastic PRO: The best fitness &amp; running app tracker on Android!\nThe Runtastic Running &amp; Fitness app uses GPS to map and track sports and fitness activities, such as running, jogging, biking, walking, hiking and many more. The 4.5+ rated app tracks details like duration, distance, elevation change, calories burned &amp; more of your cardio and strength training workouts to help you build healthy lifestyle habits and reach your exercise goals. You want to live a healthier life and be your best self? Download our easy-to-use tracker app today and benefit from great design and exciting features to pump up your workouts. Try it out now!\nThe Runtastic PRO running app is a great fit for users of all fitness levels. Become a part of a global fitness community with millions of registered users that is fun and motivational whether you're looking to improve your overall health, build cardio endurance or train for a marathon!\nFITNESS APP FEATURES &amp; BENEFITS:\n* Map workouts in real-time with GPS &amp; monitor exercise progress\n* Personal workout diary, advanced statistics &amp; graphs\n* Mapping: Detailed live mapping &amp; historic mapping of training sessions (Google Maps)\n* Runtastic Earth View: Watch your workout in 3D (free Google Earth App required)\n* LIVE Tracking &amp; Cheering: Show your friends where you are &amp; draw motivation from their cheers\n* Routes: Create, browse &amp; find routes and save them to your Android phone\n* Customizable dashboard configuration: Display preferred training statistics (duration, distance, pace, speed, heart rate, calories burned, elevation gain, time, post-workout hydration recommendation) during your workouts\n* Monthly &amp; overall metrics for elevation gain, pace, speed, heart rate, distance, number of workouts, duration &amp; calories burned\n* Voice Coach: Audio feedback based on your personal preferences\n* Auto Pause: Session is paused automatically when you stop moving\n* Use Runtastic Training Plans to make progress &amp; reach fitness goals\n* Interval run training, coaching and dynamic split (km/mi) tables \n* Training Goals: Select heart rate zone, calorie goal or pace goal to optimize training\n* Challenge a Run: Compete against yourself by challenging past activity results \n* Geotagging: Take pictures during your workout and see them on the map on Runtastic.com\n* Orbit Connect: View activity stats on Runtastic Orbit, our new 24-hour wearable\n* Powersong: Activate Powersong to boost your motivation\n* Enjoy music with Google Play Music, Spotify, Pandora, SoundCloud &amp; more, directly within the Runtastic app (available on Android 4.4 and above)\n* LiveWareâ„¢ extension for Sony SmartWatch\n* Post-activity details: Enter mood &amp; surface info, receive hydration recommendation\n* Colored Traces: Colors indicate training changes, incl. pace, elevation, slope\n* Manual entry of workouts: Add treadmill, spinning, weight lifting workouts &amp; more\n* Sync your activities to Google Fit\n* Integrate Runtastic activities to your MyFitnessPal account\n* Android Wear Integration: Control your Runtastic app with Android Wear\n* Share sports activities on Google+, Facebook, Twitter &amp; via email\nRUNTASTIC.COM\nSave workouts to Runtastic.com &amp; join our online fitness community. You'll get further exercise data analysis, coaching &amp; comparisons with friends! These benefits keep you motivated while striving to reach fat burning, cardio training or overall health &amp; wellness goals.\nADDITIONAL TRAINING RESOURCES\nYou can also choose an expert training plan to help you reach your goals. Training plans provide coaching &amp; inspiration for fitness goals, incl.: weight loss, building endurance, jogging a 10k, running a half-marathon, running a marathon or attaining a bikini body!\nRuntastic is all about health &amp; fitness apps! Check out more of our apps to help you reach your fitness goals at http://play.google.com/store/search?q=pub:Runtastic","torrent":{"xt":"urn:btih:ffeaaf1be4bd1ff75e8258eccbc2a4c736982e94","amp;dn":"Runtastic+Running+PRO+5.11+%5BApk+-+MultiLang%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffeaaf1be4bd1ff75e8258eccbc2a4c736982e94","infoHashBuffer":{"type":"Buffer","data":[255,234,175,27,228,189,31,247,94,130,88,236,203,194,164,199,54,152,46,148]},"announce":[],"urlList":[]}}